Repository: GDQuest/learn-gdscript-translations
Catalog: */application.po
Languages: fa, hu, id, nl, pl, sv, th

source: If you face an issue in the app, please click the link below to report it on GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] On that page, you can report any issues, whether something's not working or there's an error in a lesson. You can generate a log to help us identify the problem. To do so, click here: [b][url=download]generate error log[/url][/b]. Please drag and drop the generated file onto your issue on GitHub to attach it. [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font] GitHub is an online platform to host and manage open-source projects like the GDScript Learn app. It helps developers organize their work and collaborate online. You can use GitHub to study the source code of many open projects, report issues, or even contribute code yourself. [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font] 1. Click the link above to get to the [i]GitHub Issues[/i] page. 2. Click on the [i]New Issue[/i] button. 3. Fill out the form to tell us more about your problem. You will need a GitHub account to do so. Please add as much relevant information as possible, such as the kind of device you're using to access the app, and maybe attach a screenshot or video clip showcasing the issue. [center]Thank you for contributing to open source![/center]
fa: اگر درون برنامه مشکلی برایتان رخ داد، خواهشمندیم برای گزارش در گیت‌هاب روی پیوند زیر کلیک کنید. [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] در آن برگه می‌توانید هرگونه مشکلی را گزارش دهید، خواه چیزی که کار نمی‌کند خواه خطایی که در آموزه است. می‌توانید با ساختن یک لاگ به ما در شناسایی مشکل کمک کنید، برای این کار، روی [b][url=download]generate error log[/url][/b] کلیک کنید. پرونده‌ی لاگ ساخته‌شده را برای پیوست دادن به «issue» خود در گیت‌هاب بکشانید و روی آن بیندازید. [font=res://ui/theme/fonts/font_title.tres]گیت‌هاب چیست[/font] گیت‌هاب یک سکوی برخط برای نگهداری و مدیریت پروژه‌های متن‌باز مانند برنامه‌ی یادگیری جی.دی.اسکریپت است. در سامان‌بندی کارها و همکاری برخط نیز به توسعه‌گران کمک می‌کند. می‌توانید گیت‌هاب را برای خواندن کد منبع چندین پروژه‌ی آزاد و گزارش دادن مشکل‌ها به‌کار ببرید، یا حتا خودتان به دیگران کمک کنید. [font=res://ui/theme/fonts/font_title.tres]شیوه‌ی گزارش دادن[/font] ۱. برای رسیدن به برگه‌ی [i][/i]GitHub issues روی پیوند بالا کلیک کنید. ۲. روی دکمه‌ی [i]New Issue[/i] کلیک کنید. ۳. فُرم را با اطلاعاتی که درباره‌ی مشکل دارید پر کنید. برای این کار نیاز به یک حساب گیت‌هاب دارید. خواهشمندیم تا جایی که می‌توانیید اطلاعات مربوط را بیفزایید، مانند گونه‌ی دستگاهی که برای برنامه به‌کار می‌برید، و شاید ویدیو یا نماگرفتی(اسکرین‌شات) از مشکل به آن پیوست دهید. [center]از کمکتان به متن‌باز سپاسگزاریم![/center]
hu: Ha hibát találnál az alkalmazásban, kérlek kattints a linkre, hogy jelezd nekünk GitHubon (angolul): [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Azon az oldalon bármit jelenthetsz, ha valami nem működik, vagy valami hiba van az egyik leckében, stb. Generálhatsz egy log fájlt, hogy segíts nekünk a hiba felderítésében. Csak kattints a linkre: [b][url=download]generate error log[/url][/b]. Kérjük csatold az így létrejött fájlt a hibajelzésedhez GitHubon.. [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font] A GitHub egy online platform, olyan nyílt forráskodú programok tárolására, mint amilyen a GDScript Learn app is. Segít a fejlesztőknek rendszerezni a munkájukat és együttműködni másokkal. Használhatod a GitHubot, hogy tanulmányozd sok-sok nyílt forráskódú projekt felépítését, küldhetsz hibajelzéseket, vagy akár saját kódot is beadhatsz a közösbe. [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font] 1. Kattints a fenti linkre, hogy megnyisd a [i]GitHub Issues[/i] oldalt. 2. Kattints a [i]New Issue[/i] gombra. 3. Töltsd ki az űrlapot, hogy többet tudjunk meg a problémádról. Ehhez szükséged lesz egy GitHub fiókra. Kérjük, próbáld meg a lehető legtöbb releváns információt közölni, például, hogy milyen eszközön használod az alkalmazást, sőt akár képernyőképet vagy videót is mellékelhetsz. [center]Köszönjük, hogy hozzájárulsz a nyílt forráskódú programokhoz![/center]
id: Jika kamu mengalami kendala ketika menggunakan aplikasi, mohon untuk klik di bawah untuk melaporkannya di GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Pada laman tersebut, kamu dapat melaporkan kendala apapun, baik terkait ada yang berjalan ataupun ada kesalahan dalam Pelajaran. Kamu dapat membuat sebuah log yang dapat membantu kami menemukan masalahnya. Caranya, klik di sini: [b][url=download]generate error log[/url][/b]. Mohon untuk seret dan lepas file yang dihasilkan ke issue yang telah kamu buat di GitHub untuk melampirkannya. [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font] GitHub adalah sebuah platform online untuk menyimpan dan mengelola proyek open-source seperti aplikasi Learn GDScript. Github membantu developer mengatur pekerjaan mereka dan berkolaborasi secara online. Kamu bisa menggunakan GitHub untuk mempelajari kode dari banyak proyek umum, melaporkan masalah, atau bahkan menyumbangkan kode kamu sendiri. [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font] 1. Klik tautan di atas untuk masuk ke laman [i]GitHub Issues[/i]. 2. Klik tombol [i]New Issue[/i]. 3. Isi formulir untuk menjelaskan ke kami masalah yang kamu alami. Kamu butuh akun GitHub untuk melakukan langkah tersebut. Mohon cantumkan informasi bersangkutan sedetil mungkin, seperti perangkat apa yang kamu gunakan untuk mengakses aplikasi, dan tambahkan screenshot atau video yang memperlihatkan kejadian kendalanya. [center]Terima kasih telah berkontribusi ke dunia open-source![/center]
pl: Jeśli napotkasz problem w aplikacji, kliknij w poniższy link, aby zgłosić go na GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] Na tej stronie możesz zgłaszać wszelkie problemy, niezależnie od tego, czy coś kompletnie nie działa, czy wystąpił błąd w lekcji. Możesz wygenerować dziennik, który pomoże nam zidentyfikować problem. Aby to zrobić, kliknij tutaj: [b][url=download]wygeneruj dziennik błędów[/url][/b]. Przeciągnij i upuść wygenerowany plik na swoje Issue w serwisie GitHub, aby go załączyć. [font=res://ui/theme/fonts/font_title.tres]Co to jest GitHub[/font] GitHub to platforma internetowa do hostowania i zarządzania projektami typu open source, takimi jak aplikacja GDScript od zera. Pomaga programistom organizować pracę i współpracować online. Możesz użyć GitHuba do przeglądania kodu źródłowego wielu otwartych projektów, zgłaszania problemów, a nawet zamieszczania kodu własnych programów. [font=res://ui/theme/fonts/font_title.tres]Jak zgłosić problem[/font] 1. Kliknij powyższy link, aby przejść do strony [i]GitHub Issues[/i]. 2. Kliknij przycisk [i]New Issue[/i]. 3. Wypełnij formularz, w którym możesz opisać nam bardziej szczegółowo napotkany problem. Oczywiście do zgłoszenia błędu potrzebujesz konta GitHub. Dodaj w swoim zgłoszeniu jak najwięcej istotnych informacji, takich jak rodzaj urządzenia, z którego korzystasz, a także dołącz zrzut ekranu lub klip wideo przedstawiający problem. [center]Dziękujemy za wkład w rozwój oprogramowania open source![/center]
sv: Om du upplever ett problem i appen, vänligen klicka på länken här under för att rapportera det på GitHub: [center][b][url=https://github.com/GDQuest/learn-gdscript/issues]GitHub.com > GDQuest > learn-gdscript > Issues[/url][/b][/center] På den sidan kan du rapportera alla fel, oavsett om det är något som inte fungerar eller om där är ett fel i lektionen. Du kan generera en log för att hjälpa oss att identifiera problemet. För att göra så, klicka här:[b][url=download]generera fellog[/url][/b]. Vänligen dra och släpp den genererade filen i din felanmälan på Github för att bifoga den. [font=res://ui/theme/fonts/font_title.tres]Vad är GitHub[/font] GitHub är en onlineplattform för att hosta och hantera öppna källkodsprojekt som t.ex. GDScript Learn-appen. Den hjälper utvecklare att organisera deras arbete och samarbeta online. Du kan använda GitHub för att studera källkoden till många öppna projekt, rapportera problem eller t.o.m. bidra med kod själv. [font=res://ui/theme/fonts/font_title.tres]Hur man rapporterar ett problem[/font] 1. Klicka på länken ovan för att gå till [i]GitHub Issues[/i]-sidan. 2. Klicka på knappen [i]New Issue[/i]. 3. Fyll ut formuläret för att berätta för oss om problemet. Du kommer behöva ett GitHub konto att göra detta. Vänligen lägg till så mycket relevant information som möjligt, som t.ex. vilken typ av enhet du använder för att komma åt appen, kanske en bifogad skärmdump eller ett videoklipp över hur problemet uppstår. [center]Tack för att ni bidrar till öppen källkod![/center]

source: OK
fa: باشه
hu: Oké
th: โอเค

source: Configure the App
fa: پیکربندی برنامه
hu: Alkalmazás beállítása
id: Atur Aplikasi
nl: App Configureren
pl: Konfiguruj aplikację
sv: Konfigurera appen
th: ปรับแต่งโปรแกรม

source: Language
fa: زبان
hu: Nyelv
id: Bahasa
nl: Taal
pl: Język
sv: Språk
th: ภาษา

source: Text Size
fa: اندازه‌ی نوشتار
hu: Szövegméret
id: Ukuran Teks
nl: Tekstgrootte
pl: Wielkość tekstu
sv: Textstorlek
th: ขนาดตัวอักษร

source: Sample text
fa: نوشتار نمونه
hu: Példa szöveg
id: Contoh teks
nl: Voorbeeldtekst
pl: Przykładowy tekst
sv: Exempeltext
th: ตัวอย่างข้อความ

source: Scroll sensitivity
fa: حساسیت پیمایش
hu: Görgetés érzékenysége
id: Sensitivitas scroll
nl: Scroll gevoeligheid
pl: Czułość przewijania
sv: Bläddringskänslighet
th: ความไวการเลื่อนหน้าจอ

source: Framerate cap
fa: بیشینه‌ی فریم بر ثانیه
hu: FPS korlát
id: Batas framerate
nl: Framerate-limiet
pl: Ogranicz liczbę klatek
sv: Bildfrekvensbegränsning
th: จำกัดเฟรมเรตไว้

source: Lower contrast
fa: کنتراست کمتر
pl: Zmniejsz kontrast

source: Apply
fa: به‌کاربستن
hu: Alkalmazás
id: Terapkan
nl: Toepassen
pl: Zatwierdź
sv: Tillämpa
th: ยืนยันการเปลี่ยน

source: Open Lesson
fa: گشودن آموزه
hu: Lecke megnyitása
id: Buka Pelajaran
nl: Les Openen
pl: Otwórz lekcję
sv: Öppna lektion
th: เปิดบทเรียน

source: Continue Lesson
fa: ادامه دادن آموزه
hu: Lecke folytatása
id: Lanjut ke Pelajaran berikutnya
nl: Les Hervatten
pl: Kontynuuj lekcję
sv: Fortsätt lektion
th: ไปต่อ

source: Start Lesson
fa: آغازیدن آموزه
hu: Lecke kezdése
id: Mulai Pelajaran
nl: Les Starten
pl: Rozpocznij lekcję
sv: Starta lektionen
th: เริ่มบทเรียน

source: Lesson Title Goes Here
fa: عنوان آموزه اینجا می‌رود
hu: Lecke címének helye
id: Judul Pelajaran Ada Di Sini
nl: Les Titel Komt Hier
pl: Tutaj idzie tytuł lekcji
sv: Lektionens titel hamnar här
th: หัวเรื่องบทเรียนเริ่มต้นที่นี่

source: Lesson read
fa: آموزه خوانده شد
hu: Lecke elolvasva
id: Pelajaran sudah dibaca
nl: Les gelezen
pl: Lekcja przeczytana
sv: Lektion läst
th: บทเรียนที่ได้อ่านแล้ว

source: Quizzes completed
fa: آزمونک انجامید
hu: Befejezett kvízek
id: Kuis selesai
nl: Quizzen afgerond
pl: Quizy ukończone
sv: Frågesporter avklarade
th: ทำควิซทดสอบเสร็จแล้ว

source: Practices completed
fa: تمرین‌ها انجامیدند
hu: Befejezett gyakorlatok
id: Latihan selesai
nl: Oefeningen voltooid
pl: Ćwiczenia ukończone
sv: Övningar avklarade
th: ทำ แบบฝึกหัดต่าง ๆ เสร็จแล้ว

source: Lesson 0
fa: آموزه‌ی ۰
hu: 0. lecke
id: Pelajaran 0
nl: Les 0
pl: Lekcja 0
sv: Lektion 0
th: บทที่ 0

source: Lesson Title
fa: عنوان آموزه
hu: Lecke címe
id: Judul Pelajaran
nl: Les Titel
pl: Tytuł lekcji
sv: Lektionstitel
th: หัวเรื่องบทเรียน

source: Course Index -
fa: اندیس دوره- .
hu: Kurzusok -
id: Indeks Kursus -
nl: Cursus Inhoudsopgave -
pl: Spis kursu -
sv: Kursindex -

source: Course Title Goes Here
fa: عنوان دوره اینجا می‌رود
hu: Kurzus címének helye
id: Judul Kursus Ada Di Sini
nl: Cursus Titel Komt Hier
pl: Tytuł lekcji idzie tutaj
sv: Kurstitel hamnar här
th: หัวเรื่องคอร์สเริ่มต้นที่นี่

source: Reset Progress
fa: بازگردانی پیشرفت
hu: Haladás törlése
id: Hapus Progres
nl: Voortgang Resetten
pl: Zresetuj postępy
sv: Återställ framsteg
th: รีเซ็ตประวัติการเรียนที่ผ่านมา

source: Confirm Resetting Progress
fa: بازگردانی پیشرفت را تایید کنید
hu: Haladás törlésének megerősítése
id: Konfirmasi Hapus Progres
nl: Voortgang Resetten Bevestigen
pl: Potwierdź reset postępów
sv: Bekräfta återställning av framsteg
th: ยืนยันที่จะรีเซ็ตประวัติการเรียนที่ผ่านมา

source: YOU MADE IT!
fa: !توانستید!
pl: UDAŁO CI SIĘ!

source: Not only did you learn the foundations of coding, you’re a big step closer to making your own games.
fa: نه تنها بنیاد‌های کدنویسی را آموختید، بلکه یک گام بزرگ به ساخت بازی‌هایتان نزدیکتر شدید.
pl: Nie tylko nauczyłeś się podstaw kodowania, ale zrobiłeś ogromny krok do tworzenia własnych gier.

source: Don't stop here...
fa: اینجا نایستید...
pl: Nie spoczywaj na laurach...

source: The fun stuff starts now!
fa: چیزای باحال اکنون می‌آغازد!
pl: Tutaj zaczynają się dopiero fajne rzeczy!

source: There are 2 pathways learners traditionally take from here:
fa: دانش‌آموزان بیشتر زمان‌ها پس از این نقطه ۲ مسیر برمی‌گزینند:
pl: Od tego momentu są dwie ścieżki którymi osoby uczące się tradycyjnie wybierają:

source: Following video tutorials
fa: دنبال کردن آموزش‌های ویدیویی
pl: Uczenie się z poradników wideo

source: They’re a great way to pick up specific game mechanics but they’re not as effective when you’re trying to learn new skills from the ground up.
fa: راه‌های خوبی برای یادگیری سازوکارهای مشخص بازی‌هااند ولی زمانی که دارید مهارتی را از صفر یاد می‌گیرید کارامدی کمتری دارند.
pl: One są świetne aby zrozumieć specyficzne mechaniki gier. Aczkolwiek nie są aż tak efektywne kiedy uczysz się od podstaw.

source: • There’s no clear learning path.
fa: • هیچ مسیر درستی برای یادگیری نیست.
pl: • Nie ma klarownej drogi uczenia się.

source: • Retention and skill acquisition is slow and limited.
fa: • نگهداری و به دست آوردن مهارت کند و کرانمند است.
pl: • Przyswajanie wiedzy i zdobywanie umiejętności to powolny i ograniczony proces.

source: We make our fair share of [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]free tutorials[/url][/color][/b]. They will come in very handy once you start making games on your own. But to get started, we really recommend you learn how to think like a game developer using [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]courses[/url][/color][/b].
fa: ما به اندازه‌ی خود [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]آموزش‌های رایگان[/url][/color][/b] می‌سازیم. هنگامی که بازی‌های خودتان را بسازید بسیار به‌دردبخور خواهند بود. ولی برای آغازیدن، ما پیشنهاد می‌کنیم که اندیشیدن مانند یک بازی‌ساز را با گذراندن [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]دوره‌ها[/url][/color][/b] یاد بگیرید.
pl: Mamy sporo [b][color=#ebc3ff][url=https://www.youtube.com/@Gdquest/videos]darmowych poradników[/url][/color][/b]. Będą przydatne kiedy zaczniesz robić własne gry. Ale zanim zaczniesz, gorąco zalecamy nauczyć się jak zacząć myśleć jak twórca gier z pomocą [b][color=#ebc3ff][url=https://school.gdquest.com/godot-4-early-access]kursów[/url][/color][/b].

source: Learning with courses
fa: یادگیری با دوره‌ها
pl: Nauka z pomocą kursów

source: Note that most available courses online are actually premium series of video tutorials. The problem of retaining information and acquiring real skills unfortunately still applies to them.
fa: به یاد داشته باشید که بیشتر دوره‌های دردسترس برخط یا آنلاین، زنجیره‌ای از آموزش‌های ویدیویی پولی‌اند. شوربختانه دشواری نگهداری و به دست آوردن مهارت واقعی همچنان با آنها همراه است.
pl: Pamiętaj że większość kursów online to tak właściwie płatne serie poradników wideo. Więc problem z przyswajaniem wiedzy i zdobywaniem umiejętności też ich dotyczy.

source: At GDQuest, we’re educators at heart. We believe in applied study and we believe it doesn’t have to be boring. When teaching is done correctly, most people highly enjoy the sensation of leveling up! That’s the reason we made this app. It is in fact part of our beginner course [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Learn Gamedev From Zero with Godot[/url][/color][/b].
fa: در GDQuest، آموزش در قلب ما جای دارد. ما به آموزش عملی باور داریم و بر این باوریم که نیازی به حوصله‌سربر بودن آن نیست. اگر آموزاندن درست بیانجامد، بیشتر مردم از احساس پیشرفت لذت می‌برند! این یکی از دلیل‌های ساخت این برنامه است. در واقع بخشی از دوره‌ی نوآموزگرای [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]بازی‌سازی با گودوت را از صفر یاد بگیر[/url][/color][/b] ما می‌باشد.
pl: W GDQuest jesteśmy nauczycielami z pasji. Wierzymy w naukę przez praktykę i w to że nauka nie musi być nudna. Kiedy nauka jest prowadzona poprawnie, większość osób doświadcza wspaniałego uczucia rozwoju! To jest powód dlaczego zrobiliśmy tą aplikację. Tak właściwie to jest część naszego kursu dla początkujących [b][color=#ebc3ff][url=https://school.gdquest.com/products/bundle_learn_gamedev_godot_4]Naucz Się Tworzenia Gier Od Zera Z Godotem[/url][/color][/b].

source: LEARN GAMEDEV WITH GODOT
fa: !بازی‌سازی را با گودوت یاد بگیرید!
pl: NAUCZ SIĘ TWORZENIA GIER Z GODOTEM

source: Now available
fa: اکنون در دسترس است
pl: Dostępne teraz

source: for preorders
fa: برای پیش‌سفارش
pl: w przedsprzedaży

source: Godot 4 courses!!
fa: دوره‌های گودوت ۴!!
pl: Kursy godota 4!!

source: Teaching gamedev in the classroom?
fa: در آموزگاه، بازی‌سازی می‌آموزانید؟
pl: Uczysz tworzenia gier w klasie?

source: Get in touch
fa: در ارتباط باشید
pl: Skontaktuj się

source: Congratulations!
fa: شادباش!
hu: Gratulálunk!
id: Selamat!
pl: Gratulacje!
sv: Grattis!
th: ยินดีด้วยน้าาา!

source: You completed Learn GDScript From Zero. You now have the basics you need to make games with the Godot game engine. You can keep learning with the free series [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url].
fa: شما «جی.دی.اسکریپت را از صفر یاد بگیرید» را انجامیدید. اکنون پایه‌های ساخت بازی با موتور بازی‌سازی گودوت را می‌دانید. می‌توانید با خواندن زنجیره‌ی رایگان [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]آغاز کردن با گودوت[/url] به یادگیری ادامه دهید.
pl: Skończyłeś kurs Naucz Się GDScript Od Zera. Teraz znasz podstawy potrzebna aby zacząć robić gry w Godocie. Możesz kontynuować naukę z darmową seriąL [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Podstawy Godota[/url].

source: This is an Open-Source project!
fa: این یک پروژه‌ی متن‌باز است!
pl: To jest projekt Open-Source!

source: Early Access release: 2024/01/30
fa: رهش دسترسی زود: ۲۰۲۴/۰۱/۳۰ (۱۴۰۲/۱۱/۱۰ هجری)
pl: Wydanie Early Access: 2024/01/30

source: [b]Question[/b]
fa: [b]پرسش[/b]
hu: [b]Kérdés[/b]
id: [b]Pertanyaan[/b]
nl: [b]Vraag[/b]
pl: [b]Pytanie[/b]
sv: [b]Fråga[/b]
th: [b]คำถาม[/b]

source: Explanation
fa: روشن‌سازی
hu: Magyarázat
id: Penjelasan
nl: Uitleg
pl: Wyjaśnienie
sv: Förklaring
th: คำอธิบาย

source: Skip
fa: رد کردن
hu: Kihagyás
id: Lewati
nl: Overslaan
pl: Pomiń
sv: Hoppa över
th: ข้ามไป

source: Submit
fa: فرستادن
hu: Beküldés
id: Kirim
nl: Indienen
pl: Wyślij
sv: Skicka in
th: ส่งคำตอบ

source: You're right!
fa: درست گفتید!
hu: Igazad van!
id: Kamu benar!
nl: Je hebt het goed!
pl: Masz rację!
sv: Du har rätt!
th: เธอเข้าใจถูกแล้ว!

source: Answers here
fa: پاسخ‌ها در اینجا
hu: Válaszok helye
id: Jawaban ada di sini
nl: Antwoorden hier
pl: Odpowiedzi tutaj
sv: Svar här
th: คำตอบต่าง ๆ อยู่นี่แล้ว

source: Learn More
fa: بیشتر یاد بگیرید
hu: Tudj meg többet
id: Pelajari lebih lanjut
nl: Leer Meer
pl: Dowiedz się więcej
sv: Läs mer
th: อ่านเพิ่มเติม

source: Placeholder heading
fa: جانگهدار سرفصل
hu: Címsor helye
id: Judul penampung
nl: Tijdelijke Kop
pl: Nagłówek zastępczy
sv: Platshållartitel
th: ตัวอย่างหัวข้อ

source: Practice title
fa: عنوان تمرین
hu: Gyakorlat címe
id: Judul Latihan
nl: Titel Oefening
pl: Nazwa ćwiczenia
sv: Övningstitel
th: หัวเรื่อง แบบฝึกหัด

source: next
fa: پسین
hu: következő
id: berikutnya
nl: volgende
pl: dalej
sv: nästa
th: ถัดไป

source: Practice
fa: تمرین
hu: Gyakorlat
id: Latihan
nl: Oefening
pl: Ćwiczenie
sv: Övning
th: แบบฝึกหัด

source: You are here
fa: شما اینجایید
hu: Itt vagy most
id: Kamu ada di sini
nl: Je bevind je hier
pl: Jesteś tutaj
sv: Du är här
th: เธออยู่ตรงนี้

source: Answer label
fa: برچسب پاسخ
hu: Válasz címke
id: Label Jawaban
nl: Antwoord Label
pl: Etykieta odpowiedzi
sv: Svarsetikett
th: ข้อความคำตอบ

source: (select all that apply)
fa: (همه‌ی گزینه‌های درست را برگزینید)
hu: (több válasz is jelölhető)
id: (pilih semua yang berlaku)
nl: (selecteer alles wat van toepassing is)
pl: (wybierz wszystkie pasujące)
sv: (välj alla alternativ som stämmer)
th: (เลือกทั้งหมดที่คิดว่าใช่)

source: Show Hint
fa: نمایش راهنمایی
hu: Tipp mutatása
id: Tampilkan Petunjuk
nl: Toon Hint
pl: Pokaż wskazówkę
sv: Visa tips
th: แสดงคำบอกใบ้

source: Method descriptions
fa: شرح‌های روش
hu: Metódusok leírása
id: Deskripsi Metode
nl: Methode omschrijvingen
pl: Opis metody
sv: Metodbeskrivningar
th: คำอธิบายวิธีการ (Method)

source: Property descriptions
fa: شرح‌های ویژگی
hu: Tulajdonságok leírása
id: Deskripsi Properti
nl: Eigenshap omschrijvingen
pl: Opis właściwy
sv: Egenskapsbeskrivningar
th: คำอธิบายคุณสมบัติ (Property)

source: Summary - Lesson Name
fa: چکیده - نام آموزه
hu: Összegzés - Lecke neve
id: Rangkuman - Nama Pelajaran
nl: Samenvatting - Les Naam
pl: Temat - nazwa lekcji
sv: Sammanfattning - Lektionsnamn
th: บทสรุป - ชื่อบทเรียน

source: Goals
fa: هدف‌ها
hu: Célok
id: Tujuan
nl: Doelen
pl: Cele
sv: Mål
th: เป้าหมาย

source: Hints
fa: راهنمایی‌ها
hu: Tippek
id: Petunjuk
pl: Wskazówki
sv: Tips
th: คำบอกใบ้

source: Checks
fa: بررسی‌ها
hu: Ellenőrzések
id: Cek
nl: Controles
pl: Lista testów
sv: Kontroller
th: ตรวจสอบ

source: Documentation
fa: مستندات
hu: Dokumentáció
id: Dokumentasi
nl: Documentatie
pl: Dokumentacja
sv: Dokumentation
th: เอกสาร

source: Open Practice List
fa: گشودن فهرست تمرین‌ها
hu: Gyakorlatok megnyitása
id: Buka Daftar Latihan
nl: Open Oefeningen Lijst
pl: Otwórz listę ćwiczeń
sv: Öppna övningslista
th: เปิดรายการ แบบฝึกหัด

source: Test text
fa: نوشتار آزمایشی
hu: Teszt szöveg
id: Teks tes
nl: Test tekst
pl: Tekst tekst
th: ข้อความทดสอบ

source: CONTINUE
fa: ادامه
hu: FOLYTATÁS
id: LANJUTKAN
nl: VERDER GAAN
pl: KONTYNUUJ
sv: FORTSÄTT
th: ไปต่อ

source: START
fa: آغاز
hu: KEZDÉS
id: MULAI
pl: ZACZNIJ
sv: STARTA
th: เริ่มต้น

source: SELECT LESSON
fa: گزینش آموزه
hu: LECKE KIVÁLASZTÁSA
id: PILIH PELAJARAN
nl: SELECTEER LES
pl: WYBIERZ LEKCJĘ
sv: VÄLJ LEKTION
th: เลือกบทเรียน

source: OPTIONS
fa: گزینه‌ها
hu: BEÁLLÍTÁSOK
id: PENGATURAN
nl: OPTIES
pl: OPCJE
sv: ALTERNATIV
th: ตัวเลือก

source: QUIT
fa: برون‌رفت
hu: KILÉPÉS
id: KELUAR
nl: AFSLUITEN
pl: WYJDŹ
sv: AVSLUTA
th: ปิดโปรแกรม

source: run()
hu: futtatás()
pl: uruchom()
sv: kör()
th: ฟังก์ชั่น run()

source: [center]Get [b]50% off[/b] on all our Godot courses with the coupon code [b]DISCOUNT50[/b][/center]
pl: [center]Zdobądź [b]50% zniżki[/b] na wszystkie nasze kursy Godot dzięki kuponowi [b]DISCOUNT50[/b][/center]
