Repository: GDQuest/learn-gdscript-translations
Catalog: */application.po
Languages: fa, hu, id, nl, pl, sv, th

source: You need to type a whole number for this answer. Example: 42
fa: شما باید یک شماره‌ی صحیح برای این پاسخ تایپ کنید. نمونه: ۴۲
hu: A válaszhoz egy egész számot kell megadnod. Példa: 42
id: Anda perlu mengetikkan bilangan bulat untuk jawaban ini. Contoh: 42
nl: Bij dit antwoord moet je een geheel getal typen. Bijvoorbeeld: 42
pl: Musisz wpisać liczbę całkowitą w odpowiedzi. Przykład: 42
sv: Du behöver skriva ett heltal för detta svar. Exempel: 42
th: เธอต้องพิมพ์เป็นเลขจำนวนเต็มสำหรับคำตอบนี้ ตัวอย่าง: 42

source: You need to type a decimal for this answer. Use a "." to separate the decimal part. Example: 3.14
fa: شما باید یک شماره‌ی اعشاری برای این پاسخ تایپ کنید. برای جدا کردن اعشار «.» (نقطه) را به‌کار ببرید. نمونه: ۳.۱۴
hu: A válaszhoz egy tört számot kell megadnod. Az elválasztáshoz használj "."-ot. Példa: 3.14
id: Anda perlu mengetikkan bilangan desimal untuk jawaban ini. Gunakan "." untuk memisahkan bagian desimal. Contoh: 3.14
nl: Bij dit antwoord moet je een decimaal typen. Gebruik een "." om de decimaal te scheiden. Bijvoorbeeld: 3.14
pl: Musisz wpisać liczbę z rzeczywistą. Użyj "." aby oddzielić część dziesiętną. Przykład 3.14
sv: Du behöver skriva ett decimaltal för detta svar. Använd ett "." för att separera decimal-delen. Exempel: 3.14
th: เธอต้องพิมพ์เป็นเลขทศนิยมสำหรับคำตอบนี้ โดยใช้มหัพภาค(จุด) "." เพื่อแยกส่วนของทศนิยมออกมา ตัวอย่าง: 3.14

source: Title
fa: عنوان
hu: Cím
id: Judul
nl: Titel
pl: Tytuł
sv: Titel
th: หัวเรื่อง

source: Practices
fa: تمرین‌ها
hu: Gyakorlatok
id: Praktikum
nl: Praktijken
pl: Ćwiczenia
sv: Övningar
th: แบบฝึกหัด

source: Go back in your navigation history
fa: در تاریخچه‌ی رهیابی خود برگردید
hu: Menj vissza az előzményekben
id: Kembali ke riwayat navigasi anda
nl: Ga terug in je navigatiegeschiedenis
pl: Cofnij się w historii nawigacji
sv: Gå tillbaka i din navigationshistorik
th: ย้อนกลับไปประวัติการดูเนื้อหา

source: (no previous history)
fa: (تاریخچه پیشینی نیست)
hu: (nincsenek előzmények)
id: (tidak ada riwayat sebelumnya)
nl: (geen vorige geschiedenis)
pl: (brak dalszej historii)
sv: (ingen tidigare historik)
th: (ไม่มีประวัติการดูเนื้อหา)

source: CHRISTMAS SALE - 50% OFF
fa: تخفیف کریسمس - ۵۰٪ تخفیف
hu: KARÁCSONYI AKCIÓ - 50% KEDVEZMÉNY
pl: ŚWIĄTECZNA WYPRZEDAŻ - 50% ZNIŻKI

source: CHRISTMAS SALE
fa: تخفیف کریسمس
hu: KARÁCSONYI KIÁRUSÍTÁS
pl: ŚWIĄTECZNA WYPRZEDAŻ

source: Hint %s
fa: راهنمایی %s
hu: Tipp %s
id: Petunjuk %s
pl: Wskazówka %s
sv: Tips %s
th: บอกใบ้ %s

source: Validating Your Code...
fa: اعتبارسنجی کد شما...
hu: Kód ellenőrzése...
id: Memvalidasi Kode Anda...
nl: Je Code Valideren...
pl: Weryfikacja kodu…
sv: Validerar din kod...
th: กำลังตรวจโค้ดเธอดู...

source: The function `%s` calls itself, this creates an infinite loop
fa: تابع `%s` خود را فرامی‌خواند، این کار یک چرخه‌ی بی‌پایان می‌سازد
hu: A `%s` függvény meghívja magát, ez végtelen ciklust hoz létre
pl: Funkcja '%s' wywołuje samą siebie, co tworzy nieskończoną pentlę

source: Running Your Code...
fa: اجرای کد شما...
hu: Kód futtatása...
id: Menjalankan Kode Anda...
nl: Je Code Uitvoeren...
pl: Uruchamianie kodu…
sv: Kör din kod...
th: กำลังรันโค้ดเธอดู...

source: There is a division by zero in your code. You cannot divide by zero in code. Please ensure you have no "/ 0" or "% 0" in your code.
fa: در کد شما تقسیمی بر صفر هست. نمی‌توانید درون کد چیزی را بر صفر بخش کنید. خواهشمندیم از نبود «0 /» یا «0%» در کد خود مطمئن شوید.
hu: A kódodban nullával való osztás található. A kódban nem lehet nullával osztani. Kérjük, győződjön meg arról, hogy a kódjában nem szerepel "/ 0" vagy "% 0".
pl: W twoim kodzie jest dzielenie przez zero. Nie możesz dzielić przez zero w kodzie. Spraw aby w twoim kodzie nie było " / 0" lub "% 0".

source: Oh no! The script has an error, but the Script Verifier did not catch it
fa: وای نه! اسکریپت خطایی دارد، ولی تاییدگر اسکریپت آن را نگرفت
hu: Ó nem! A szkriptben hiba van, de a Script Verifier nem észlelte
pl: O rety kotlety! Skrypt ma błędy których Weryfikator Skryptów znalazł

source: Running Tests...
fa: اجرای آزمایش...
hu: Tesztek futtatása...
id: Menjalankan Tes...
nl: Tests Uitvoeren...
pl: Testowanie rozwiązania…
sv: Kör test...
th: กำลังรันเทส...

source: Suggested Solution
fa: چاره‌ی پیشنهادی
hu: Javasolt megoldás
id: Solusi yang Disarankan
nl: Voorgestelde Oplossing
pl: Sugerowane rozwiązanie
sv: Föreslagen lösning
th: วิธีแก้ปัญหาที่เราแนะนำ

source: Use Solution
fa: بکارگیری چاره
hu: Megoldás használata
id: Gunakan Solusi
nl: Gebruik Oplossing
pl: Użyj rozwiązania
sv: Använd lösningen
th: เลือกใช้วิธีแก้ปัญหานี้

source: Leave unfinished practice?
fa: تمرین نیمه‌کاره رها شود؟
hu: Kilépsz a befejezetlen gyakorlatból?
id: Tinggalkan Latihan yang belum selesai?
nl: Onafgemaakte oefening verlaten?
pl: Chcesz opuścić niedokończone ćwiczenie?
sv: Lämna ofärdig övning?
th: ออกจากแบบฝึกหัดที่ยังไม่เสร็จ?

source: Button
fa: دکمه
hu: Gomb
id: Tombol
nl: Knop
pl: Przycisk
sv: Knapp
th: ปุ่ม

source: Run
fa: اجرا
hu: Futtatás
id: Jalankan
nl: Uitvoeren
pl: Uruchom
sv: Kör
th: เรียกใช้

source: Pause
fa: درنگ
hu: Szünet
id: Jeda
nl: Pauzeren
pl: Pauza
sv: Pausa
th: ค้างไว้

source: Reset
fa: بازگردانی
hu: Visszaállítás
id: Ulang
nl: Resetten
sv: Återställ
th: รีเซ็ต

source: Solution
fa: چاره
hu: Megoldás
id: Solusi
nl: Oplossing
pl: Rozwiązanie
sv: Lösning
th: คำตอบ

source: Output
fa: برونداد
hu: Kimenet
id: Hasil
nl: Uitvoer
pl: Wynik wyjściowy
sv: Utdata
th: ผลลัพธ์

source: Continue
fa: ادامه
hu: Folytatás
id: Melanjutkan
nl: Hervatten
pl: Kontynuuj
sv: Fortsätt
th: ไปต่อ

source: Value
fa: ارزش
hu: Érték
id: Nilai
nl: Waarde
pl: Wartość
sv: Värde
th: ค่า

source: Paused
fa: درنگیده
hu: Szüneteltetve
id: Dijeda
nl: Gepauzeerd
pl: Zapauzowano
sv: Pausad
th: ค้าง

source: Term
fa: گزاره
hu: Kifejezés
id: Ketentuan
pl: Wyrażenie
th: คำเฉพาะ

source: Our error explanation.
fa: روشن‌سازی خطای ما.
hu: A hiba magyarázata.
id: Penjelasan kesalahan kami.
nl: Onze foutmelding omschrijving.
pl: Nasze wytłumaczenie błędu.
sv: Vår felförklaring.
th: คำอธิบาย ข้อผิดพลาด ของเรา

source: ERROR:
fa: خطا:
hu: HIBA:
id: EROR:
nl: FOUTMELDING:
pl: BŁĄD:
sv: FEL:
th: ข้อผิดพลาด:

source: Placeholder text
fa: نوشتار جانگهدار
hu: Kitöltő szöveg
id: Teks pengganti
nl: Tijdelijke text
pl: Tekst zastępczy
sv: Platshållartext
th: ข้อความตัวอย่าง

source: in
fa: درون
hu: Ebben
id: di
pl: w
sv: i
th: ใน

source: FileName
fa: نام پرونده
hu: FájlNév
id: NamaFile
nl: BestandsNaam
pl: NazwaPliku
sv: Filnamn
th: ชื่อไฟล์

source: at
fa: در
hu: Itt
id: pada
nl: bij
pl: na
sv: vid
th: ที่

source: Sometimes errors are reported outside of your code. Why does that happen?
fa: گاهی خطا‌ها بیرون از کدتان گزارش می‌شوند. چرا رخ می‌دهد؟
hu: Néha a hibaüzenetek jelennek meg a kódodon kívül. Miért történik ez?
id: Terkadang kesalahan dilaporkan di luar kode Anda. Mengapa itu terjadi?
nl: Soms worden er foutmeldingen gerapporteerd van buiten jouw code. Waarom gebeurt dit?
pl: Czasem błędy zgłaszane są spoza twojego kodu. Czemu tak się dzieje?
sv: Ibland rapporteras fel utanför din kod. Varför händer detta?
th: บางครั้ง ข้อผิดพลาดต่าง ๆ ที่แจ้งมากลายเป็นไม่อยู่ในโค้ดที่เราเขียนเสียงั้น มันเกิดแบบนั้นได้ไง?

source: Explain
fa: روشن‌سازی
hu: Magyarázat
id: Menjelaskan
nl: Leg uit
pl: Wytłumaczenie
sv: Förklara
th: คำอธิบาย

source: Expand
fa: گسترش
hu: Kibontás
id: Meluaskan
pl: Rozwiń
sv: Expandera
th: ขยาย

source: step
fa: گام
pl: krok

source: Debugger
fa: اشکال‌زدا

source: Only until
fa: تنها تا .
pl: Tylko do

source: CHECK OUT OUR COURSES
fa: !نگاهی به آموزش‌هایمان بیندازید!
pl: SPRAWDŹ NASZE KURSY

source: Confirm
fa: تایید
hu: Megerősítés
id: Konfirmasi
nl: Bevestigen
pl: Zatwierdź
sv: Bekräfta
th: ยืนยัน

source: Cancel
fa: برهم‌زدن
hu: Mégsem
id: Batalkan
nl: Annuleren
pl: Anuluj
sv: Avbryt
th: ยกเลิก

source: Original error message
fa: پیام خطای آغازین
hu: Eredeti hibaüzenet
id: Pesan kesalahan asli
nl: Oorspronkelijke foutmelding
pl: Pierwotna wiadomość błędu
sv: Ursprungligt felmeddelande
th: ข้อความแจ้งข้อผิดพลาดดั้งเดิม

source: Why this happens
fa: چرا رخ می‌دهد
hu: Ezért történik
id: Mengapa ini terjadi
nl: Waarom dit gebeurt
pl: Czemu to się dzieje
sv: Varför händer detta
th: ทำไมเกิดแบบนี้ขึ้นได้

source: How to fix this
fa: چگونه درستش کنیم
hu: Így javítsd ki
id: Bagaimana cara memperbaikinya
nl: Hoe dit op te lossen
pl: Jak to rozwiązać
sv: Hur man kan lösa det
th: จะแก้ไขอย่างไรดี

source: Our suggestion on how to fix it.
fa: پیشنهاد ما برای چگونگی درست کردنش.
hu: Javaslatunk a javításra.
id: Saran kami tentang cara memperbaikinya.
nl: Onze suggestie om dit op te lossen.
pl: Nasza sugestia rozwiązania.
sv: Vårt förslag på hur man fixar det.
th: คำแนะนำของเราเพื่อแก้ไข

source: Sorry, we don't have this particular error message covered yet! Please, use the [b]Report[/b] button in the top-right corner to tell us more about how you've got it, and we will try to improve our knowledge base for the next version of the application. [center]Thank you![/center]
fa: ببخشید، ما هنوز این پیام خطای مشخص را پوشش ندادیم! خواهشمندیم دکمه‌ی [b]گزارش[/b] در گوشه‌ی راست بالا را برای روشن‌سازی درباره‌ی چگونگی رخ دادن این خطا برای ما به‌کار بگیرید، و ما نیز می‌کوشیم تا دانش خود را برای نسخه‌ی پسین این برنامه بیشتر کنیم. [center]سپاسگزاریم![/center]
hu: Sajnáljuk, ezt a hibaüzenetet még nem dogoztuk fel. Kérjük, használd a [b]Jelentés[/b] gombot a jobb felső sarokban, hogy elmondd nekünk, hogyan kaptad, és mi megpróbáljuk frissíteni a tudásbázisunkat az alkalmazás következő verziójában. [center]Köszönjük![/center]
id: Maaf, pesan kesalahan khusus ini belum kami cakup! Silakan, gunakan tombol [b]Laporkan[/b] di sudut kanan atas untuk memberi tahu kami lebih banyak tentang bagaimana Anda mendapatkannya, dan kami akan mencoba meningkatkan basis pengetahuan kami untuk versi aplikasi berikutnya. [center]Terima kasih![/center]
nl: Sorry, we hebben deze specifieke foutmelding nog niet behandeld. Graag de [b]Rapporteer[/b] knop in de rechter-boven hoek gebruiken om ons meer te vertellen hoe je deze melding hebt gekregen, dan zullen wij proberen onze kennisbank te verbeteren in de volgende versie van de applicatie. [center]Dank je![/center]
pl: Niestety nie ma jeszcze objaśnienia dla tego komunikatu błędu! Użyj przycisku [b]Zgłoś[/b] w prawym górnym rogu i opisz napotkany problem, a postaramy się rozszerzyć naszą bazę wiedzy w kolejnych uaktualnieniach aplikacji. [center]Dziękujemy![/center]
sv: Tyvärr, vi har inte täckt detta specifika felmeddelande ännu! Vänligen använd knappen[b]Rapportera[/b] uppe i högra hörnet för att berätta mer om hur du fick det, så ska vi försöka förbättra vår kunskapsdatabas för nästa version av applikationen. [center]Tack![/center]

source: Hide
fa: پنهانیدن
hu: Elrejtés
id: Sembunyikan
nl: Verbergen
pl: Ukryj
sv: Göm
th: ซ่อนไว้

source: Where do external errors come from?
fa: خطاهای بیرونی از کجا می‌آیند؟
hu: Honnan jönnek a külső hibák?
id: Dari mana kesalahan eksternal berasal?
nl: Waar komen externe foutmeldingen vandaan?
pl: Skąd ten zewnętrzny błąd się wziął?
sv: Var kommer externa fel från?
th: พวก ข้อผิดพลาดภายนอก นี่มาจากไหนกัน?

source: Lessons in this course are designed so you only need to edit the [b]important bits[/b]. But there is much more code outside of what you see that makes the project run. This means that sometimes changes you make can affect code you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit! [i]This is like how game engines work too.[/i] There is a lot of hidden code that they execute to ensure your project runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
fa: آموزه‌های این دوره به گونه‌ای طراحی شده‌اند که شما تنها نیاز به ویرایش [b]تکه‌های مهم[/b] داشته باشید. ولی کد فراوانی بیرون از چیزی که می‌بینید برای اجرای این پروژه به‌کار رفته است. این یعنی گاهی دگرگونی‌هایی که می‌انجامید بر کدی که بیرون از واپایش(کنترل) شما است نیز اثر می‌گذارند. ولی نگران نباشید، همچنان می‌توانید همه‌ی این مشکل‌ها را با کدی که [b]می‌توانید[/b] بویرایید، درست کنید. [i]موتورهای بازی‌سازی نیز اینگونه کار می‌کنند.[/i] اندازه‌ی فراوانی کد پنهان وجود دارد که برای اجرای آسان پروژه‌ی شما اجرا می‌شود. با این همه، یک خطا در اسکریپت شما می‌تواند آنها را بشکند. خواهیم کوشید تا شیوه‌ی رسیدگی به هر خطای مشخصی که شاید برایتان رخ دهد را روشن‌سازیم. تند! روی دکمه‌ی [b]روشن‌سازی[/b] کنار پیام خطا کلیک کنید!
pl: Lekcje w prezentowanym kursie są skonstruowane w taki sposób, byś musiał edytować wyłącznie jego [b]kluczowe części[/b]. Aczkolwiek jest o wiele więcej kodu niewidocznego dla ciebie, który sprawia że ten projekt działa. Oznacza to, że niektóre ze zmian mogą wpłynąć na kod, nad którym nie masz kontroli. Nic się jednak nie martw, wciąż możesz poprawić wszystkie błędy z poziomu kodu, który [b]możesz[/b] edytować! [i]W ten sam sposób działają również silniki do tworzenia gier.[/i] Jest w nich znacznie więcej kodu, który zostanie wykonany po to, by zapewnić twojemu programowi płynną pracę, a którego nie widzisz. Błędy w twoim kodzie mogą jednak namieszać w poprawnym działaniu programu. Spróbujemy wyjaśnić, jak rozwiązać każdy z błędów, jaki napotkasz. Szybko, kliknij na przycisk [b]Wytłumaczenie[/b] obok wiadomości o błędzie!

source: Got it!
fa: گرفتم!
hu: Értem!
id: Mantap!
nl: Ik snap het!
pl: Mamy to!
sv: Jag förstår!
th: เข้าใจแล้ว!

source: Lesson complete!
fa: آموزه انجامید!
hu: Lecke befejezve!
id: Pelajaran selesai!
nl: Les afgerond!
pl: Lekcja ukończona!
sv: Lektionen är avklarad!
th: จบบทเรียนนี้แล้ว!

source: But there are still some practices that you've skipped.
fa: ولی هنوز تمرین‌هایی هستند که شما آنها را رد کردید.
hu: Még van néhány gyakorlat, amit kihagytál.
id: Tapi masih ada beberapa latihan yang kamu lewati.
nl: Baar er zijn nog steeds oefeningen die je hebt overgeslagen.
pl: Wciąż są ćwiczenia, które opuściłeś.
sv: Men där är fortfarande några övningar som du har hoppat över.
th: แต่มันยังมี แบบฝึกหัดต่าง ๆ ที่เธอข้ามไป

source: [center][b]Stay[/b] and revisit the study material, or [b]continue[/b] the course.[/center]
fa: [center][b]بمانید[/b] و داده‌های آموزشی را بازبینید، یا دوره‌ را [b]ادامه[/b] دهید.[/center]
hu: [center][b]Maradj[/b] és ismételd át a tanultakat, vagy [b]folytasd[/b] a kurzust.[/center]
id: [center][b]Menetap[/b] dan pelajari kembali Materi, atau [b]Lanjut[/b] ke Materi berikutnya.[/center]
nl: [center][b]Blijf[/b] en herzie het stuidie materiaal, of [b]ga verder[/b] met de cursus.[/center]
pl: [center][b]Zostań[/b] i przyjrzyj jeszcze raz materiał, lub [b]kontynuuj[/b] kurs.[/center]
sv: [center][b]Stanna[/b] och återbesök studiematerialet, eller [b]fortsätt[/b] med kursen.[/center]
th: [center][b]อยู่ต่อ[/b] และกลับไปศึกษาเนื้อหาบทเรียน หรือ [b]ไปต่อ[/b] ในส่วนที่เหลือของคอร์สนี้[/center]

source: Stay
fa: بمانید
hu: Maradj
id: Menetap
nl: Blijf
pl: Zostań
sv: Stanna
th: อยู่ต่อ

source: Well done!
fa: آفرین!
hu: Szép munka!
id: Berhasil!
nl: Goed gedaan!
pl: Dobra robota!
sv: Bra jobbat!
th: เก่งมั่ก ๆ !

source: You completed the practice.
fa: شما تمرین را انجامیدید.
hu: Befejezted a gyakorlatot.
id: Kamu telah menyelesaikan latihan.
nl: Je hebt de oefening afgerond.
pl: Ukończyłeś ćwiczenie.
sv: Du har klarat övningen.
th: เธอทำ แบบฝึกหัด จบแล้ว

source: [center][b]Stay[/b] and play around, or [b]continue[/b] the course.[/center]
fa: [center][b]بمانید[/b] و وَر بروید، یا دوره را [b]ادامه[/b] دهید.[/center]
hu: [center][b]Maradj[/b] és próbálgasd a dolgokat, vagy [b]folytasd[/b] a kurzust.[/center]
id: [center][b]Menetap[/b] dan coba eksperimen, atau [b]lanjut[/b] ke Materi berikutnya.[/center]
nl: [center][b]Blijf[/b] en speel verder, of [b]ga verder[/b] met de cursus.[/center]
pl: [center][b]Zostań[/b], by jeszcze się pobawić, lub [b]kontynuuj[/b] kurs.[/center]
sv: [center][b]Stanna[/b] och lek, eller [b]fortsätt[/b] med kursen.[/center]
th: [center][b]อยู่ต่อ[/b] และลองนั่นโน่นนี่ไปอีกนิด หรือ [b]ไปต่อ[/b] เนื้อหาอื่นในคอร์สนี้[/center]

source: Practice List
fa: فهرست تمرین‌ها
hu: Gyakorlatok
id: Daftar latihan
nl: Oefeningen Lijst
pl: Lista ćwiczenia
sv: Övningslista
th: รายการ แบบฝึกหัด

source: Close
fa: بستن
hu: Bezárás
id: Tutup
nl: Sluiten
pl: Zamknij
sv: Stäng
th: ปิด

source: Report an issue
fa: گزارش یک مشکل
hu: Hibajelentés küldése
id: Laporkan masalah
nl: Meld een probleem
pl: Zgłoś problem
sv: Rapportera ett problem
th: รายงานปัญหา
