Repository: GDQuest/learn-gdscript-translations
Catalog: */application.po
Languages: fa, hu, id, nl, pl, sv, th

source: Like Godot, this app and course is free and open-source. You can find the app's source code and contribute translations here: [url="https://github.com/GDQuest/learn-gdscript"]Learn GDScript From Zero (Github repository)[/url].
id: Seperti Godot, aplikasi dan kursus ini gratis dan bersumber terbuka. Anda dapat menemukan kode sumber aplikasi dan berkontribusi menerjemahkannya di sini: [url="https://github.com/GDQuest/learn-gdscript"]Belajar GDScript Dari Nol (repositori Github)[/url].
pl: Podobnie jak Godot, ta aplikacja i kurs jest wolna i otwarto źródłowa. Możesz znaleźć kod źródłowy aplikacji i pomóc w tłumaczeniu tutaj: [url="https://github.com/GDQuest/learn-gdscript"]Naucz Się GDScript Od Zera (Repozytorium github)[/url].

source: This means that sometimes changes you make can affect code you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit!
th: นั่นแสดงว่า เธออาจจะแก้โค้ดแบบฝึกหัดในบางครั้ง มันก็อาจจะส่งผลกับโค้ดส่วนที่มองไม่เห็นในโปรแกรมนี้จนเกิดข้อผิดพลาดขึ้น แต่ไม่ต้องกังวลมากไป เธอยังสามารถแก้ไขปัญหาทุกแบบได้ด้วยตัวเองทั้งหมด โดยการ[b]แก้เฉพาะส่วนที่ออกแบบมาให้เธอแก้ไข[/b]เท่านั้น!

source: [i]This is like how game engines work too.[/i] There is a lot of hidden code that they execute to ensure your project runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
th: [i]นี่ก็เป็นลักษณะการทำงานของสิ่งที่เรียกว่า Game Engine ด้วย[/i] เพราะเกมส์เอนจิ้นนั้นมีโค้ดที่มองไม่เห็นจำนวนมากที่ทำงานไปพร้อม ๆ กันกับโค้ดของเรา และทำให้เกมส์เราทำงานได้ราบรื่น แต่ข้อผิดพลาดในโค้ดของเราก็ทำให้เกมส์เอนจิ้นหยุดทำงานได้ เราจะพยายามอธิบายวิธีแก้ไขแต่ละปัญหาที่เธอจะเจอให้ดีที่สุด ง่ายสุดก็คลิกที่ปุ่ม [b]คำอธิบาย[/b] ที่อยู่ถัดไปจากข้อผิดพลาดที่แสดง!

source: If you face an issue in the app, please click the link below to report it on GitHub:
th: หากคุณประสบปัญหาใดภายในแอป โปรดคลิกลิงก์ด้านล่างเพื่อรายงานบน GitHub:

source: On that page, you can report any issues, whether something's not working or there's an error in a lesson.
th: ในหน้านั้น คุณสามารถรายงานปัญหาใดๆก็ได้ไม่ว่าจะมีปัญหาหรือมีพบข้อผิดพลาดในบทเรียน

source: You can generate a log to help us identify the problem. To do so, click here: [b][url=download]generate error log[/url][/b].
th: คุณสามารถสร้างตัวบันทึกได้เพื่อช่วยเราในการระบุปัญหาได้ คลิกที่นี่: [b][url=download]สร้างบันทึกข้อผิดพลาด[/url][/b].

source: Please drag and drop the generated file onto your issue on GitHub to attach it.
th: โปรดลากและวางไฟล์ที่สร้างขึ้นไปยัง issue ของคุณบน GitHub เพื่อแนบไฟล์ลงไป

source: [font=res://ui/theme/fonts/font_title.tres]What's GitHub[/font]
th: [font=res://ui/theme/fonts/font_title.tres]GitHub คืออะไร[/font]

source: GitHub is an online platform to host and manage open-source projects like the GDScript Learn app. It helps developers organize their work and collaborate online.
th: GitHub เป็นแพลตฟอร์มออนไลน์สำหรับโฮสต์และจัดการโครงการโอเพนซอร์ส ตัวอย่างเช่น แอป GDScript Learn ช่วยให้นักพัฒนาจัดระเบียบงานและทำงานร่วมกันทางออนไลน์ได้

source: You can use GitHub to study the source code of many open projects, report issues, or even contribute code yourself.
th: คุณสามารถใช้ GitHub เพื่อศึกษาซอร์สโค้ดของโครงการที่เปิดอยู่จำนวนมาก รายงานปัญหา หรือแม้แต่ร่วมเขียนโค้ดด้วยตัวเอง

source: [font=res://ui/theme/fonts/font_title.tres]How to report an issue[/font]
th: [font=res://ui/theme/fonts/font_title.tres]วิธีการรายงานปัญหา[/font]

source: 1. Click the link above to get to the [i]GitHub Issues[/i] page. 2. Click on the [i]New Issue[/i] button. 3. Fill out the form to tell us more about your problem.
th: 1. คลิกลิงก์ด้านบนเพื่อไปที่หน้า [i]GitHub Issues[/i] 2. คลิกที่ปุ่ม [i]New Issue[/i] 3. กรอกแบบฟอร์มเพื่อแจ้งให้เราทราบเพิ่มเติมเกี่ยวกับปัญหาของคุณ

source: You will need a GitHub account to do so.
th: คุณจะต้องมีบัญชี GitHub ก่อนเพื่อดำเนินการดังกล่าว

source: Please add as much relevant information as possible, such as the kind of device you're using to access the app, and maybe attach a screenshot or video clip showcasing the issue.
th: โปรดเพิ่มข้อมูลที่เกี่ยวข้องให้มากที่สุด เช่น ประเภทของอุปกรณ์ที่คุณใช้ในการเข้าถึงแอป และอาจแนบภาพหน้าจอหรือคลิปวิดีโอเพื่อแสดงปัญหา

source: [center]Thank you for contributing to open source![/center]
th: [center]ขอขอบคุณที่มีส่วนร่วมในโอเพ่นซอร์ส![/center]

source: You can keep learning with the free series [url=https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html]Getting Started with Godot[/url].
th: หากคุณกำลังมองหาซีรีส์ฟรีเพื่อเรียนรู้พื้นฐานกับเราต่อไป คุณสามารถไปที่ [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]เริ่มต้นใช้งาน Godot[/url].

source: You completed Learn GDScript From Zero. You now have the basics you need to dive into game creation with the Godot game engine. If you're looking for a free series to keep learning the basics with us, you can move on to [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]Getting Started with Godot[/url].
id: Kamu telah menyelesaikan Belajar GDScript Dari Nol. Kamu telah memahami dasar serta terjun langsung membuat game dengan Godot game engine. Jika kamu ingin belajar lebih lanjut bersama kami secara gratis, kamu bisa kunjungi [url=https://www.gdquest.com/tutorial/godot/learning-paths/getting-started-in-2021/]Getting Started with Godot[/url].

source: Or level up faster by taking this shortcut
id: Atau naik tingkat lebih cepat dengan mengambil jalan pintas ini

source: There are loads of free game creation tutorials, but they don't form a clear path. Worse, most of them are like step-by-step recipes. But as you learned, you can't become a developer by just following recipes. Every project has unique challenges and requires [i]creative problem solving[/i]. You need to [i]think like a programmer[/i]. Learning that on your own can take years.
id: Ada banyak tutorial gratis membuat game, tetapi mereka tidak menjelaskan dengan baik. Lebih buruknya lagi, kebanyakan mereka hanya memberikan langkah-langkahnya saja. Seiring kamu belajar, kamu tidak akan bisa menjadi developer dengan mengikuti langkah saja. Setiap proyek memiliki rintangan tersendiri dan membutuhkan [i]penyelesaian masalah secara kreatif[/i]. Kamu perlu memiliki kemampuan untuk [i]berpikir sebagai seorang programmer[/i]. Mempelajari pola pikir itu sendiri membutuhkan waktu bertahun-tahun.

source: Learn to Code From Zero, with Godot
id: Belajar Koding Dari Nol, dengan Godot

source: This app is the free part of our in-depth course, [url=https://gdquest.mavenseed.com/courses/learn-to-code-from-zero-with-godot][b]Learn to Code From Zero, with Godot[/b][/url]. The course picks up right where this app ends to take you to the point where you can make [i]your[/i] game. It's the only course that'll truly teach you [i]how to become a game developer[/i] with Godot.
id: Aplikasi ini adalah bagian dari kursus mendalam kami, [url=https://gdquest.mavenseed.com/courses/learn-to-code-from-zero-with-godot][b]Belajar Koding Dari Nol, dengan Godot[/b][/url]. Kursus ini lanjut langsung dari akhir aplikasi ini sampai akhirnya kamu bisa buat [i]game kamu[/i] sendiri. Ini satu-satunya kursus yang akan mengajari kamu [i]bagaimana cara menjadi seorang game developer[/i] dengan Godot.

source: Connected to the server.
nl: Verbonden met de server.

source: Can't reach the server. The server might be down, or your internet may be down.
nl: Kan de server niet bereiken. De server kan uitgevallen zijn, of je internet ligt er uit.

source: Can't reach the server. The tests will be less precise.
nl: Kan de server niet bereiken. De tests zullen minder accuraat zijn.

source: Lessons in this course are constructed in such a way that you only need to edit the [b]important bits[/b]. But there is much more code outside of what you see that makes the project run. This means that sometimes changes that you make can affect code that you have no control over. But don't worry, you can still fix all the issues yourself with the code you [b]can[/b] edit! [i]This is kind of like game engines work too.[/i] There is a lot of hidden code that they execute to make sure your projects runs smoothly. And yet, an error in your scripts can break them. We'll try to explain how to address each individual error that you face. Quick, click the [b]Explain[/b] button next to the error message!
nl: Lessen in deze cursus zijn op zo'n wijze opgezet dat je alleen de [b]belangrijke stukken[/b] hoeft aan te passen. Maar er is veel meer code, buiten die je kunt zien, welke er voor zorgt dat je het project kunt uitvoeren. Soms betekent dit dat aanpassingen die je maakt aan de code een effect heeft op codee waar je geen invloed op hebt. Niet gevreest, je kunt zelf nog steeds alle problemen oplossen met de code die je [b]kunt[/b] aanpassen. [i]Zo werkt het bij game engines ook.[/i] Er is heel veel verborgen code welke uitgevoerd wordt om je project naadloos uit te voeren. En toch kan een fout in je scrips deze breken. We zullen proberen uit te leggen hoe elke individuele foutmelding aan te pakken die je tegenkomt. Snel, klik de [b][Uitleg[/b] knop naast de foutmelding!

source: That's it... for now!
nl: Dat is het... voor nu!

source: Thanks for participating in the beta test. We hope you enjoyed what's available so far. We wish we had a lot more to give you already, but creating this app took time. A [i]lot[/i] of time. The good news is: now we figured out many of the more challenging parts, moving forward, we can shift our focus onto new lessons and practices.
nl: Bedankt voor je deelname aan de b√®tatest. We hopen dat je genoten hebt van wat er tot nu toe beschikbaar is. We zouden willen dat we je al veel meer konden bieden, maar het maken van deze app kostte tijd. Heel [i]veel[/i] tijd. Het goede nieuws is: nu we veel van de meer uitdagende onderdelen hebben uitgevogeld, kunnen we ons focussen op nieuwe lessen en oefeningen.

source: [font=res://ui/theme/fonts/font_title.tres]What's coming next[/font] We have plans for many more lessons and improvements. You can find our plan for future releases on our [url=https://github.com/GDQuest/learn-gdscript#roadmap]roadmap[/url].
nl: [font=res://ui/theme/fonts/font_title.tres]What's coming next[/font] We hebben plannen voor veel meer lessen en verbeteringen. Je kunt onze plannen voor toekomstige uitgaven vinden op onze [url=https://github.com/GDQuest/learn-gdscript#roadmap]roadmap[/url].
