Repository: GDQuest/learn-gdscript-translations
Catalog: */classref_database.po
Languages: fa, id, pl, th

source: shows the current scene
fa: پرده‌ی کنونی را نمایش می‌دهد
id: memunculkan scene saat ini
pl: pokazuje obecną scenę
th: แสดง scene ปัจจุบัน

source: hides the current scene
fa: پرده‌ی کنونی را می‌پنهاند
id: sembunyikan scene saat ini
pl: ukrywa obecną scenę
th: ซ่อน scene ปัจจุบัน

source: Applies a rotation to the node, in radians, starting from its current rotation.
fa: چرخشی به گره، به رادیان، که از چرخش کنونی‌ آن می‌آغازد به‌کار می‌بندد.
id: Memutar node, dalam radian, mulai dari rotasi saat ini.
pl: Stosuje obrót węzła w radianach, zaczynając od jego bieżącego obrotu.
th: ปรับค่าหมุนให้ node ในหน่วย เรเดียน เริ่มจากมุมหมุน ณ ปัจจุบัน

source: Moves the turtle in the direction it's facing by some pixels.
fa: لاک‌پشت را در سویی که رو به آن است به اندازه‌ی چند پیکسل جابه‌جا می‌کند.
id: Gerakkan kura-kura ke arah yang dihadapinya dengan beberapa piksel.
pl: Przemieszcza żółwia w kierunku, w którym jest zwrócony, o kilka pikseli.
th: ให้พา (move) เต่าไปยังทิศที่มันมุ่งหน้าไป เติมระยะทาง (pixel) ตามต้องการ

source: Rotates the turtle to the right by some degrees.
fa: لاک‌پشت را چند درجه به راست می‌چرخاند.
id: Putar kura-kura ke kanan beberapa derajat.
pl: Obraca żółwia w prawo o kilka stopni.
th: หมุนเต่า (rotate) ไปทางขวา เติมองศาตามต้องการ

source: Rotates the turtle to the left by some degrees.
fa: لاک‌پشت را چند درجه به چپ می‌چرخاند.
id: Putar kura-kura ke kiri beberapa derajat.
pl: Obraca żółwia w lewo o kilka stopni.
th: หมุนเต่า (rotate) ไปทางซ้าย เติมองศาตามต้องการ

source: Offsets the turtle's position by the given x and y amounts of pixels.
fa: نهشت لاک‌پشت را به اندازه‌ی x و y داده شده به پیکسل از مبدا دور می‌کند.
id: Buat kura-kura meloncat dengan jumlah piksel x dan y yang diberikan.
pl: Przesuwa pozycję żółwia o określoną liczbę pikseli w osiach x i y.
th: กระเถิบ (offset) ตำแหน่งเต่า ตามจำนวน pixels ที่กำหนดให้ ในแนวแกน x และ y

source: Makes the turtle draw a rectangle starting at its current position.
fa: لاک‌پشت را به کشیدن یک مستطیل که از نهشت کنونی آن می‌آغازد، وادار می‌کند.
id: Buat kura-kura menggambar sebuah persegi panjang, mulai dari posisinya saat ini.
pl: Sprawia, że żółw rysuje prostokąt, zaczynając od jego aktualnej pozycji.
th: ทำให้เต่าวาดรูปสี่เหลี่ยม เริ่มต้นจากตำแหน่งที่มันอยู่ปัจจุบัน

source: The position of the entity on the horizontal axis.
fa: نهشت پدیده روی محور افقی.
id: Posisi entitas pada sumbu horizontal.
pl: Pozycja jednostki na osi poziomej.
th: ตำแหน่งของสิ่งนั้นเมื่อวัดในแกนแนวนอน

source: The position of the entity on the vertical axis.
fa: نهشت پدیده روی محور عمودی.
id: Posisi entitas pada sumbu vertikal.
pl: Pozycja jednostki na osi pionowej.
th: ตำแหน่งของสิ่งนั้นเมื่อวัดในแกนแนวตั้ง

source: Applies a local translation on the node's X axis based on the [code]Node._process[/code]'s [code]delta[/code]. If [code]scaled[/code] is false, normalizes the movement.
fa: یک جنبش انتقالی بومی روی محور X گره بر پایه‌ی [code]delta[/code] (دلتای) [code]Node._process[/code] به‌کار می‌بندد. اگر [code]scaled[/code] نادرست (False) باشد، جنبش را بهنجار می‌کند.
id: Menerapkan translasi lokal pada sumbu X node berdasarkan parameter [code]delta[/code] pada [code]Node._process[/code]. Jika [code]scaled[/code] memiliki nilai salah, maka normalisasi gerakannya.
pl: Stosuje lokalną translację na osi X węzła na podstawie wartości [code]delta[/code]'y [code]Node._process[/code]'u. Jeśli [code]scaled[/code](skalowanie) ma wartość fałsz, normalizuje ruch.
th: จะกำหนดการเคลื่อนตำแหน่งของ node ในแกน x ของตัวเอง (ไม่ใช่ x ของ scene, world) โดยยึดจากความต่าง ([code]delta[/code]) ของ [code]Node._process[/code] ถ้า [code]scaled[/code] เป็น false ก็จะ normalize การเคลื่อนที่

source: Stores how many cells make up the width ([code]board_size.x[/code]) and height ([code]board_size.y[/code]) of the board.
fa: شمار یاخته‌هایی که پهنا ([code]board_size.x[/code]) و بلندای ([code]board_size.y[/code]) تخته را می‌سازد را انبار می‌کند.
id: Menyimpan berapa banyak sel yang membentuk lebar ([code]board_size.x[/code]) dan tinggi ([code]board_size.y[/code]) papan.
pl: Przechowuje ilość komórek składających się na szerokość ([code]board_size.x[/code]) i wysokość ([code]board_size.y[/code]) tablicy.
th: เก็บจำนวนเซลล์ที่สร้างเป็นความกว้าง ([code]board_size.x[/code]) และความสูง ([code]board_size.y[/code]) ของกระดาน

source: The cell position of the robot on the board. [code]Vector2(0, 0)[/code] is the square cell in the top left of the board.
fa: نهشت یاخته‌ی ربات روی تخته. [code]Vector2(0, 0)[/code] یاخته‌ی مربعی‌ چپِ بالای تخته است.
id: Posisi sel dari si robot di atas papan. [code]Vector2(0, 0)[/code] adalah sel persegi di paling kiri atas papan.
pl: Pozycja komórki robota na planszy. [code]Vector2(0, 0)[/code] to kwadratowa komórka w lewym górnym rogu tablicy.
th: ตำแหน่งเซลล์ของหุ่นยนต์บนกระดานและ [code]Vector2(0, 0)[/code] คือเซลล์สี่เหลี่ยมที่ด้านบนซ้ายของกระดาน

source: Creates a list of numbers from [code]0[/code] to [code]length - 1[/code].
fa: فهرستی از شماره‌های [code]0[/code] تا [code]length - 1[/code] می‌سازد.
id: Buat sebuah daftar berisi nomor dari [code]0[/code] sampai [code]length - 1[/code].
pl: Tworzy listę liczb od [code]0[/code] do [code]length - 1[/code] (długości pomniejszonej o 1).
th: สร้าง list ตัวเลขจาก [code]0[/code] ถึง [code]length - 1[/code]

source: Orders the robot to play an animation.
fa: به ربات فرمان پخش یک پویانمایی را می‌دهد.
id: Perintahkan robot untuk memainkan sebuah animasi.
pl: Mówi robotowi aby odtworzył animację.
th: สั่งให้หุ่นยนต์เล่นแอนิเมชั่น

source: Selects units in the cell coordinates passed as the function's argument.
fa: واحدهایی از مختصات‌های یاخته که بعنوان آرگومان تابع گذشته است را برمی‌گزیند.
id: Memilih unit dalam koordinat sel yang diteruskan sebagai argumen fungsi.
pl: Wybiera jednostki we współrzędnych komórki przekazanych jako argument funkcji.
th: เลือกหน่วยในพิกัดเซลล์ที่ส่งผ่านเป็นอาร์กิวเมนต์ของฟังก์ชัน

source: Queues a move animation towards the target cell.
fa: یک پویانمایی جابه‌جایی را به سوی یاخته‌ی هدف در صف می‌گذارد.
id: Mengantrikan sebuah animasi yang bergerak ke sel target.
pl: Kolejkuje animację ruchu w kierunku komórki docelowej.
th: จัดคิวของแอนิเมชั่นเคลื่อนไหวไปยังเซลล์เป้าหมาย

source: Adds the value passed as an argument at the back of the array.
fa: ارزشی که بعنوان آرگومان به پشت آرایه گذشته است را میفزاید.
id: Menambahkan nilai yang diteruskan sebagai argumen di belakang array.
pl: Dodaje wartość przekazywaną jako argument pod koniec tablicy.
th: เพิ่มค่าที่ส่งผ่านเป็นอาร์กิวเมนต์ไปยังด้านหลังของอาร์เรย์

source: Removes the first value from the array and returns it.
fa: یکمین ارزش آرایه را می‌زداید و آن را برمی‌گرداند.
id: Menghapus nilai pertama dari array dan mengembalikan nilai tersebut.
pl: Usuwa pierwszy element tablicy i zwraca go.
th: ลบค่าแรกออกจากอาร์เรย์และส่งค่าคืนกลับไป

source: Removes the last value from the array and returns it.
fa: آخرین ارزش آرایه را می‌زداید و آن را برمی‌گرداند.
id: Menghapus nilai terakhir dari array dan mengembalikan nilai tersebut.
pl: Usuwa ostatni element tablicy i zwraca go.
th: ลบค่าสุดท้ายออกจากอาร์เรย์และส่งค่าคืนกลับไป

source: Returns the argument converted into a [code]String[/code]. Works with the majority of value types.
fa: آرگومانی که به یک [code] String[/code] تبدیل شده است را برمی‌گرداند. با بیشتر گونه‌های ارزش کار می‌کند.
id: Mengembalikan argumen yang telah diubah menjadi sebuah [code]String[/code]. Berlaku untuk sebagian besar tipe data.
pl: Zwraca argument przekonwertowany do [code]String[/code]. Działa z większością typów wartości.
th: ส่งค่าคืนกลับไปที่อาร์กิวเมนต์ที่แปลงเป็น [code]String[/code] ใช้งานได้กับประเภทข้อมูลค่าส่วนใหญ่

source: Returns the argument converted into an [code]int[/code] (whole number) [i]if possible[/i]. Supports converting decimal numbers, strings, and booleans. Useful to convert player text input into numbers.
fa: [i]اگر شدنی باشد[/i]، آرگومان تبدیل شده به یک [code]int[/code] (شماره‌ی صحیح) را برمی‌گرداند. از تبدیل شماره‌های اعشاری، رشته‌ها و بولی‌ها پشتیبانی می‌کند. کاربردی برای تبدیل درونداد نوشتاری بازیکن به شماره.
id: Mengembalikan argumen yang diubah menjadi [code]int[/code] (bilangan bulat) [i]jika memungkinkan[/i]. Mendukung konversi angka desimal, string, dan boolean. Berguna untuk mengubah input teks pemain menjadi angka.
pl: Zwraca argument przekonwertowany do [code]int[/code] (liczba całkowita) [i]jeśli to możliwe[/i]. Wspiera konwertowanie z [code]float[/code], [code]String[/code] i [code]bool[/code]. Przydatne przy konwertowaniu tekstu wejściowego od gracza do liczb.
th: ส่งค่ากลับไปเป็นอาร์กิวเมนต์ที่แปลงเป็น [code]int[/code] (จำนวนทั้งหมด) [i]ถ้าเป็นไปได้[/i] รองรับการแปลงค่าเป็น เลขทศนิยม, สตริง, และบูลีน มีประโยชน์ในการแปลงข้อความที่ป้อนมาจากผู้เล่นเป็นให้เป็นตัวเลข

source: Creates a new unit matching the type parameter and places it at the desired cell position on the game grid.
fa: یک واحد نو که با گونه‌ی پارامتر یکی است ساخته و در نهشت یاخته‌ی خواسته‌شده روی توری بازی می‌گذارد.
id: Membuat unit baru yang cocok dengan parameter tipe dan menempatkannya pada posisi sel yang diinginkan pada kisi permainan.
pl: Tworzy nowe jednostki pasujące do typu parametru i ustawia je w żądanej komórce siatki gry.
th: สร้างยูนิตใหม่ที่ตรงกับประเภทของพารามิเตอร์และวางไว้ที่ตำแหน่งช่องที่ต้องการในตารางเกม

source: Creates a new item and displays it in the inventory.
fa: یک مورد نو ساخته و آن را در انبارک (inventory) نشان می‌دهد.
id: Membuat item baru dan menampilkannya di inventaris.
pl: Tworzy nowy przedmiot i wyświetla go w ekwipunku.
th: สร้างไอเท็มใหม่และแสดงใน inventory

source: Increases the item count by amount.
fa: شمار مورد‌ها را بر پایه‌ی میزان افزایش می‌دهد.
id: Meningkatkan jumlah item berdasarkan amount.
pl: Zwiększa ilość przedmiotów o wartość.
th: เพิ่มจำนวนไอเท็มตามจำนวน
