Repository: GDQuest/learn-gdscript-translations
Catalog: */error_database.po
Languages: fa, hu, pt, ru, sv, tr

source: Some types are compatible, and some are not. For example, you cannot directly add a whole number to a text string. You first need to convert the number into text.
hu: Néhány típus kompatibilis, mások viszont nem. Példáül, nem adhatsz egy egész számot egy szöveghez. Először szöveggé kell konvertálnod a számot.

source: You'll need to read the error message to see what is not matching because there are many possible cases.
hu: El kell olvasnod hibaüzenetet, hogy lásd, pontosan mi a probléma, mert sokféle eset lehetséges.

source: If the error mentions the assigned value type not matching the variable, the problem is on the right side of the equal sign (=).
hu: Ha a hibaüzenet szerint a megadott érték nem egyezik meg a változó típusával, akkor a hiba az egyenlőség jel (=) jobb oldalán van.

source: If the error talks about the return type not matching the function, then it is the value after the return keyword that is problematic.
hu: Ha a hibaüzenet szerint a visszatérési érték típusa nem egyezik meg a függvényével, akkor a baj a [code]return[/code] kulcsszó után van.

source: If the computer talks about an invalid operand, then the issue is that the operation does not exist for the type you're trying to use. For example, while you can add two 2D vectors, you can't add a whole number or text to a 2D vector.
hu: Ha a számítógép érvénytelen műveletről beszél, akkor a művelet, amit végre akarsz hajtani, nem létezik az adott típushoz, amit épp használsz. Például, két 2 dimenziós vektort összeadhatsz egymással, de egy egész számmal vagy szöveggel már nem.

source: GDScript supports type inference. The computer will automatically recognize the type of value you are working with. In some cases, though, it can't figure it out.
hu: A GDScript képes a típus kikövetkeztetésére. A számítógép legtöbb esetben automatikusan felismeri a változó típusát, amivel dolgozol. Néhány esetben azonban erre nem képes.

source: When that happens, you need to specify the type yourself or remove type inference altogether for this variable.
hu: Ha ez történik, akkor neked kell megadnod a típust, vagy épp el kell hagynod a típus megadást.

source: The simplest way to solve this error is to remove types for this variable or this function's arguments. Otherwise, you can manually specify the value type after the colon.
hu: Ennek a hibának a legegyszerűbb megoldása, ha eltávolítod a típusokat az adott változóhoz, vagy függvény argumentumhoz. Vagy, megadhatod te magad is a típust a változó neve után kettősponttal. Példa: [code]var health : int[/code]

source: We recommend specifying the type whenever possible to reap the typing system's benefits.
hu: Ajánlott a típust minden esetben megadni, amikor csak lehetséges, hogy élvezhessük a típusok előnyeit.

source: There is an issue with the return value of your function. There are two main cases here:
hu: Valami baj van a függvényed visszatérési értékével. Ennek két fő oka lehet:

source: 1. Your function is a void function, thus it should not return a value. This includes functions with the '-> void' syntax and class constructors ('_init()'). 2. You specified a return type for your function, but you are not returning a value in all possible branches (if, elif, and else blocks) or at the end.
hu: 1. A függvényed void, így nem kéne visszatérnie semmilyen értékkel. Ide tartoznak a '-> void' kulcsszóval ellátott függvények és a beépített osztályok ('_init()'). 2. Megadtál egy visszatérési típust, de nem adsz meg visszatérési értéket minden elágazásnál (if, elif, és else blokkok) vagy a függvény végén.

source: When your function is 'void', you should never return a value. You can use the 'return' keyword to end the function early, but you should never write anything after that.
hu: Ha 'void' függvényed van, soha ne adj meg visszatérési értéket. Használhatod a 'return' kulcsszót, hogy rendesen lezárd a függvényt, de soha ne írj utána semmit.

source: When you use a return type, you must always return something at the end of the function or in every branch (if, elif, and else block) of the function.
hu: Ha megadsz visszatérési típust, akkor minden esetben vissza kell térned valamilyen értékkel, minden elágazásnál (if, elif, és else blokkok) vagy a függvény végén.

source: Godot was unable to load your script, yet the language checker found nothing wrong.
hu: A Godot nem tudta betölteni a szkripted, a nyelv ellenőrző mégsem talált semmilyen hibát.
pt: Godot foi incapaz de carregar o seu script, porém o verificador da linguagem não encontrou nada de errado.
ru: Godot не удалось загрузить ваш скрипт, однако сервер проверки языка не обнаружил проблем.
tr: Godot, betik dosyanı yüklemeyi başaramadı, ama yine de dil kontrolcüsü herhangi bir sorun tespit edemedi.

source: Please click on the "report" button at the top and please let us know.
fa: خواهشمندیم روی دکمه‌‌ی «گزارش» در بالا کلیک کرده و ما را در جریان بگذارید.
hu: Kérjük kattints a "hibajelzés" gombra, és tudasd velünk.
pt: Por favor, clique no botão "reportar" no topo e nos avise.
ru: Данная ошибка возникает, когда вы не в сети. В противном случае, пожалуйста, нажмите на кнопку «сообщить» вверху и сообщите нам об этой проблеме.
tr: Lütfen yukarıdaki "bildir" düğmesine tıkla ve bize haber ver.

source: You called a function inside itself. This will loop forever.
fa: شما یک تابع را درون خودش فراخواندید. این چرخه‌ای بی‌پایان خواهد بود.
hu: Saját magában hívtál egy függvényt. Ez végtelen ciklust eredményez.
pt: Chamou um função dentro dela mesma. Isso vai se repetir para sempre.
ru: Вы вызвали функцию внутри самой себя. Вызов зациклится и будет повторяться вечно.
sv: Du kallade en funktion i sig själv. Detta kommer att loopa för alltid.
tr: Bir fonksiyonu kendi içerisinde çağırdın. Bu sonsuz döngüye sebep olacak.

source: There are valid reasons for using recursive functions, but none of them are part of this course, so this cannot be a valid solution.
hu: Vannak olyan esetek, amikor rekurzív függvényekre van szükség, de azok nem részei ennek a kurzusnak, szóval ez nem lehet a helyes megoldás.
pt: Há razões válidas para usar funções recursivas, mas nenhuma delas fazem parte desse curso, então isso não pode ser uma solução válida.
ru: Существуют веские причины для использования рекурсивных функций, но ни одна из них не является частью этого курса, поэтому использование рекурсии не может быть правильным решением.
sv: Det finns giltiga skäl för att använda rekursiva funktioner, men ingen av dem är en del av denna kurs, så detta kan inte vara en giltig lösning.
tr: Özçağrılı (recursive) fonksiyonlar kullanmak için geçerli pek çok sebep var, ama bunların hiç biri bu kursun parçası değil, bu nedenle çözümün geçerli bir çözüm değil.

source: You get this error when the name between the [code]for[/code] and [code]in[/code] is not a valid variable name, or you are missing the [code]in[/code] keyword. In a [code]for[/code] loop, the [code]in[/code] keyword only accepts a valid temporary variable name to assign values in each loop iteration. The loop creates a new variable with the desired name and assigns each element of the array to it.
fa: زمانی این خطا را می‌گیرید که نام میان [code]for[/code] و [code]in[/code] یک نام متغیر معتبر نباشد، یا که کلیدواژه‌ی [code]in[/code] را از جا می‌اندازید. در یک چرخه‌ی [code]for[/code]، کلیدواژه‌ی [code]in[/code] تنها یک نام متغیر گذرای *معتبر* را برای واگذاشتن ارزش در هر تکرار از چرخه می‌پذیرد. چرخه یک متغیر نو با نام خواسته‌شده ساخته و هر درایه از آرایه را به آن می‌واگذارد.
tr: Bu hatayı alıyorsan, [code]for[/code] ve [code]in[/code] arasındaki isim geçerli bir değişken ismi değildir, yada [code]in[/code] kelimesini unutmuşsundur. Bir [code]for[/code] döngüsünde, döngünün her bir yinelemesinde kullanmak için, [code]in[/code] kelimesi sadece geçici değişken isimlerini kabul eder. Bu şekilde döngü, istenilen isimde yeni bir değişken oluşturur ve dizinin öğelerini tek tek buna atama yapar.

source: To fix this error, you need to ensure that the name between the [code]for[/code] and [code]in[/code] keywords is a valid variable name with no punctuation or spaces. For example, this code is invalid: [code]for cell_position.x in cell_positions_array:[/code] because [code]cell_position.x[/code] isn't a valid variable name. To access the [code]x[/code] sub-component of the variable, you need to do that inside of the loop's body: [code]for cell_position in cell_positions_array: cell_position.x += 1.0[/code]
fa: برای درست کردن این خطا، نیاز دارید از معتبر بودن نام متغیر و نبود فاصله یا نقطه‌گذاری میان کلیدواژه‌های [code]for[/code] و [code]in[/code] مطمئن شوید. برای نمونه، این کد نامعتبر است: [code]for cell_position.x in cell_positions_array:[/code] چرا که [code]cell_position.x[/code] یک نام متغیر معتبر نیست. برای دسترسی به زیرمولفه‌ی متغیر [code]x[/code]، نیاز دارید تا آن را درون بدن چرخه بینجامید: [code]for cell_position in cell_positions_array: · · · ·cell_position.x += 1.0[/code]
tr: Bu hatayı düeltmek için, [code]for[/code] ve [code]in[/code] kelimeleri arasına, içinde noktalama işareti yada boşluk bulunmayan, geçerli bir değişken ismi girdiğinden emin olmalısın. Örneğin, bu kod hatalıdır: [code]for cell_position.x in cell_positions_array:[/code]. Çünkü [code]cell_position.x[/code] geçerli bir değişken ismi değildir. Bir dğeişkenin [code]x[/code] alt-elemanına erişmek için, döngünün içerisinde aşağıdaki gibi kullanmalısın. [code]for cell_position in cell_positions_array: # "for hücre_konumu in hücre_konumları_disizi" anlamında cell_position.x += 1.0[/code]

source: If you get this error, you are most likely trying to assign a value to something other than a variable, which is impossible. You can only assign values to variables. Another possibility is that you want to check for equality in a condition but wrote a single = instead of ==.
fa: اگر این خطا را گرفتید، به احتمال بالایی کوشیدید تا ارزشی را به چیزی جز متغیر واگذارید، که نشدنی است. تنها می‌توانید ارزش در متغیرها واگذارید. امکان دیگر این است که می‌خواهید برابری یک شرط را بررسی کنید ولی بجای == تنها یک = نوشتید.
tr: Bu hatayı alırsan, büyük ihtimalle değişken olmayan bir şeylere bir değer atamaya çalışıyorsun demektir, ve bu mümkün değildir. Sadece değişkenlere değere atayabilirsin. Bir diğer olasılık ise, bir koşul işleminde eşitliği test etmek istemiş, ama "==" yerine "=" yazmışsındır.

source: If you want to assign a value to a variable, double-check that what you have on the left side of the = sign is a variable and not a function. You also need to ensure the syntax is correct. For example, there shouldn't be parentheses on the left side of the equal sign. In the case of a condition, ensure that you are using two equal signs to check for equality (==).
fa: اگر می‌خواهید ارزشی را به یک متغیر واگذارید، از تابع نبودن و متغیر بودن چیزی که در چپ نشانه‌ی = هست مطمئن شوید. همچنین از درست بودن سینتَکس (نحو) مطمئن شوید. برای نمونه، در پهلوی چپ نشانه‌ی برابری نباید کمانکی باشد. در زمینه‌ی شرطی‌ها،‌ مطمئن شوید که دارید از دو نشانه‌ی برابری (==) برای بررسی برابری شرط بکار می‌برید.
tr: Eğer bir değişkene değer atamak istiyorsan, "=" işaretinin sol tarafına bir fonksiyon (yada değer) yazmak yerine bir değişken ismi yazdığını iki kere kontrol etmelisin. Ayrıca doğru şekilde yazdığından da emin olmalısın. Örneğin, eşitliğin sol tarafında parantezler olmamalıdır. Bir koşul yazıyorsan, iki tane eşittir işareti (==) kullandığından emin olmalısın.

source: A cyclic reference is when a class references itself, directly or indirectly. It has two possible causes: 1. You used the class name in the class itself. 2. Your code refers to another class that refers to this class, causing an endless reference cycle. Either way, due to how GDScript works in Godot 3, unfortunately,you cannot do this. Godot 4 should solve this problem, but you need to work around it in the meantime.
fa: بازبرد چرخه‌ای به زمانی گفته می‌شود که یک کلاس خودش را مستقیم یا نامستقیم بازبرد کند. می‌تواند دو دلیل داشته باشد: ۱. شما نام کلاس را در خود آن به‌کار بردید. ۲. کد شما کلاسی را بازبرد می‌کند که این کلاس به دست آن بازبرد شده است، که باعث رخ دادن یک بازبرد چرخه‌ای می‌شود. در هر گونه، بخاطر گونه‌ای که جی.دی.اسکریپت در گودوت ۳ کار می‌کند، شوربختانه، نمی‌توانید چنین کنید. گودوت ۴ احتمالا این مشکل را حل می‌کند، ولی نیاز دارید تا آن زمان این را دور بزنید.
pt: Uma referência cíclica é quando uma classe referencia ela mesma, direta ou indiretamente. Possui duas causas possíveis: 1. Usou o nome da classe na própria classe. 2. O seu código refere-se a outra classe que se refere para esta classe, causando um ciclo de referência infinito. De qualquer jeito, devido ao jeito que o GDScript funciona no Godot 3, infelizmente, Não pode fazer isso. Godot 4 poderá resolver esse problema, mas precisa contornar isso nesse meio tempo.
ru: Циклическая ссылка — это когда класс прямо или косвенно ссылается сам на себя. У циклической ссылки есть две возможные причины: 1. Вы использовали имя класса в самом классе. 2. Ваш код ссылается на другой класс, который ссылается на этот класс, вызывая бесконечный цикл ссылок. В любом случае, из-за того как GDScript работает в Godot 3, вы, к сожалению, не можете использовать циклические ссылки. Godot 4 должен решить эту проблему, но пока вам нужно ее обойти.
sv: En cyclic reference är när en klass refererar till sig själv, direkt eller indirekt. Det har två möjliga anledningar: 1. Du använde klassnamnet i själva klassen. 2. Din kod hänvisar till en annan klass som hänvisar till den här klassen, vilket orsakar en oändlig referenscykel. Hur som helst, på grund av hur GDScript fungerar i Godot 3, kan du tyvärr inte göra detta. Godot 4 borde lösa det här problemet, men du måste arbeta runt det under tiden.
tr: Dönüşsel bir başvuru, bir sınıfın doğrudan yada dolaylı bir şekilde kendisine başvuru yapmasıdır. İki olası sebebi vardır: 1. Sınıfın ismini, sınıfın kendi içinde kullanmışsındır. 2. Sınıfın içinde kullandığın başka bir sınıf, tekrardan bu sınıfa başvuru yapıyordur, bu şekilde sonu olmayan bir başvuru döngüsüne sebep oluyordur. Her iki durumda da, GDScript'in Godot 3 içinde çalışma şeklinden dolayı, bunu yapamazsın. Godot 4 bunu belk çözecektir, ama şimdilik sorunu başka şekilde çözmeye çalışmalısın.

source: Erase the type hint in the error line, and the problem should disappear. At GDQuest, when we face this error, we remove the type hints on lines causing cyclic references. It solves the problem in the vast majority of cases.
fa: راهنمایی گونه را در خط خطا پاک کنید، تا احتمالا مشکل از میان برود. در جی.دی.کوئِست، زمانی که این خطا رخ می‌دهد، راهنمایی‌های گونه‌ای که باعث بازبرد چرخه‌ای می‌شوند را می‌زداییم. بیشتر زمان‌ها مشکل را حل می‌کند.
pt: Apague a dica de tipo na linha de erro e o problema deve desaparecer. No GDQuest, quando encontramos esse erro, removemos as dicas de tipo nas linhas que causam referências cíclicas. Isso resolve o problema na grande maioria dos casos.
ru: Сотрите обозначение типа переменной в строке с ошибкой, и проблема должна исчезнуть. В GDQuest, когда мы сталкиваемся с этой ошибкой, мы удаляем обозначения типов переменных в строках, вызывающих циклические ссылки. Это решает проблему в подавляющем большинстве случаев.
sv: Radera typtipset i felraden så borde problemet försvinna. På GDQuest, när vi möter detta fel, tar vi bort typtipsen på linjer som orsakar cykliska referenser. Det löser problemet i de allra flesta fall.
tr: Hatada belirtilen satırdaki tipi silersen, sorunun düzelmesi gerek. GDQuest'te, bir sorunla karşılaşınca, dönüşsel başvuruya sebep olan tip tanımlarını sileriz. Sorunlarımızın büyük çoğunluğu bu şekilde çözülüyor.

source: The indentation of your code (the number of tab characters at the start of the line) is incorrect. You are missing one or more tabs, or you inserted too many. The computer uses those leading tab characters on code lines to know which lines of code are part of a code block, like a function.
fa: تورفتگی کد شما (شمار نویسه‌های تَب (tab) در آغاز خط) نادرست است. یک یا چند تَب را از جا انداختید، یا بیش از اندازه جایگذاشتید. رایانه آن نویسه‌های تَب روی خط‌های کد را برای دانستن اینکه کدام خط‌ها بخشی از یک گروه کدی‌اند به‌کار می‌برد، مانند یک تابع.
pt: A indentação do seu código (a quantidade de caracteres de tabulação no começo da linha) está incorreto. Faltam-lhe um ou mais caracteres de tabulação ou pôs demais. O computador usa esses caracteres de tabulação nas linhas de código para saber quais dessas linhas fazem parte de um bloco de código, como uma função por exemplo.
ru: Отступ вашего кода (количество символов табуляции в начале строки) неверен. Вам не хватает одной или нескольких табуляций, или вы вставили их слишком много. Компьютер использует эти начальные символы табуляции в строках кода, чтобы узнать, какие строки кода являются частью блока кода, например функции.
sv: Indraget i din kod (antalet tabbtecken i början av raden) är felaktig. Du saknar en eller flera tabbar eller så har du infogat för många. Datorn använder de ledande tabbtecken på kodrader för att veta vilka kodrader som är en del av ett kodblock, som en funktion.
tr: Kodunun girinti miktarı yanlış. (satır başındaki sekme karakterlerinin sayısı) Bir yada daha fazla sekme karakteri eksik, ya da çok fazla kullandın. Bilgisayar, kod satırlarının başındaki o sekme karakterlerini kullanarak, hangi satırların yazdığın kodun (mesela fonksiyonun) gövdesine ait olduğunu almaya çalışır.

source: If the line of code with the error is right after a line ending with a colon, like a function definition, you need one extra indent level compared to the previous line. In other words, your line should have one more leading tab character than the function definition.
fa: اگر خط کد دارای خطا دقیقا پس از یک خط پایانیده با دونقطه (:)، مانند یک تعریف تابع باشد، شما به یک پله تورفتگی بیشتر از خط پیشین نیازمندید. به زبانی دیگر، خط شما باید یک نویسه‌ی تَب بیشتر از تعریف تابع داشته باشد.
pt: Se a linha de código que contém o erro estiver logo após uma linha que termina com dois pontos, como uma função por exemplo, precisa de um nível extra de indentação comparado a linha anterior. Em outras palavras, a sua linha deverá ter um caractere de tabulação a mais do que a definição da função.
ru: Если строка кода с ошибкой находится сразу после строки, заканчивающейся двоеточием, как в определении функции, вам потребуется один дополнительный уровень отступа по сравнению с предыдущей строкой. Другими словами, в вашей строке должно быть на один начальный символ табуляции больше, чем в определении функции.
sv: Om kodraden med felet ligger precis efter en rad som slutar med ett kolon, som en funktionsdefinition, behöver du en extra indragsnivå jämfört med föregående rad. Med andra ord bör din rad ha ett mer ledande tabbtecken än funktionsdefinitionen.
tr: Eğer hata kodunun gösterdiği satır, iki nokta üstüste ile biten bir satırdan sonra ise (mesela bir fonksiyon tanımı gibi), önceki satırdan bir seviye içeriye girinti yapman gerekir. Başka bir deyişle, kodu yazdığın satıra, fonksiyon tanımından bir tane daha fazla sekme karakteri koymalısın.

source: You get this error when you wrote something that is syntactically invalid, or you are missing something to complete this line or previous lines of code. You need to be extremely precise when you write code for the computer. This kind of error is easy to get as all it takes is one wrong character. Note that this error can appear [b]after[/b] the line causing it due to how the computer reads and analyzes your code.
fa: زمانی این خطا را می‌گیرید که نوشته‌ی شما از نگاه نحو و سینتَکس نامعتبر باشد، یا چیزی را برای کامل کردن این خط یا خط‌های پیشین کد از جا انداخته‌اید. هنگام کدنویسی برای رایانه باید بسیار دقیق باشید. گرفتن اینگونه خطا‌ها آسان است، چرا که تنها نیازش برای رخ دادن یک نویسه‌ی نادرست است. به یاد داشته باشید که این خطا بخاطر شیوه‌ای که رایانه کد شما را می‌خواند و می‌واکاود می‌تواند [b]پس از[/b] خطی که باعث آن شده است نمایان شود.
pt: Recebe esse erro quando escreveu alguma palavra sintaticamente inválida, ou quando falta algo para completar essa linha de código ou a anterior. Deve ser extremamente preciso quando for escrever código para o computador. Esse tipo de erro é comum acontecer pois precisa somente de um caractere errado. Note que esse erro pode aparecer [b]depois[/b] da linha que o causa devido à forma que o computador lê e analisa o seu código.
ru: Вы получаете эту ошибку, когда написали что-то синтаксически недопустимое или вам чего-то не хватает для завершения этой строки или предыдущих строк кода. Вам нужно быть предельно точным, когда вы пишете код для компьютера. Такую ошибку легко получить, так как для этого потребуется всего один неправильный символ. Обратите внимание, что данная ошибка может появиться [b]после[/b] строки, вызывающей ее, из-за того, как компьютер считывает и анализирует ваш код.
sv: Du får det här felet när du skrev något som är syntaktiskt ogiltigt, eller om du saknar något för att komplettera denna rad eller tidigare kodrader. Du måste vara extremt exakt när du skriver kod till datorn. Den här typen av fel är lätt att få eftersom allt som krävs är en fel karaktär. Observera att det här felet kan dyka upp [b]efter[/b] raden som orsakar det på grund av hur datorn läser och analyserar din kod.
tr: Bu hatayı alıyorsan, yazım kurallarına uymayan bir şey yazmışsındır, ya da bu satırdaki veya önceki satırdan devam eden kodu tamamlamak için gereken bir şey eksiktir. Bilgisayar için bir kod yazarken son derece kesin olmalısın. Bu tarz bir hatayı almak çok kolaydır, çünkü tek gereken bir tane hatalı karakterdir. Ayrıca şuna dikkat et: bu hata, sebebi olan kod satırından [b]sonra[/b] geliyormuş gibi görünebilir, çünkü bilgisayar yazdığın kodu bu şekilde okuyup analiz eder.
