Repository: GDQuest/learn-gdscript-translations
Catalog: */error_database.po
Languages: fa, hu, pt, ru, sv, tr

source: A cyclic reference is when a class references itself, directly or indirectly.
hu: A körkörös hivatkozás az, amikor egy osztály saját magát hívja közvetett vagy közvetlen módon.

source: It has two possible causes:
hu: Két lehetséges oka van:

source: 1. You used the class name in the class itself. 2. Your code refers to another class that refers to this class, causing an endless reference cycle.
hu: 1. Az osztály nevét használtad az osztályon belül. 2. A kódod egy másik osztályra hivatkozik, ami viszont erre az osztályra hivatkozik, így egy végtelen referencia kör jön létre.

source: Either way, due to how GDScript works in Godot 3, unfortunately,you cannot do this. Godot 4 should solve this problem, but you need to work around it in the meantime.
hu: Akármelyik lehetőség is áll fenn, ahogy a GDScript működik a Godot 3-ban, sajnos, ilyet nem csinálhatsz. A Godot 4 megoldást kínálhat erre a problémára, de addig más megoldást kell keresned.

source: Erase the type hint in the error line, and the problem should disappear.
hu: Töröld a típus meghatározást a hibás sorból, és a problémának meg kell oldódnia.

source: At GDQuest, when we face this error, we remove the type hints on lines causing cyclic references. It solves the problem in the vast majority of cases.
hu: A GDQuestnél, ha ebbe a hibába futunk, töröljük a típus meghatározást a körkörös hivatkozást okozó sorokból. A legtöbb esetben ez megoldja a problémát.

source: The indentation of your code (the number of tab characters at the start of the line) is incorrect.
hu: Nem jó a behúzás a kódodban (a tabok száma a sorok elején).

source: You are missing one or more tabs, or you inserted too many.
hu: Vagy hiányzik egy vagy több tab, vagy pedig túl sok van.

source: The computer uses those leading tab characters on code lines to know which lines of code are part of a code block, like a function.
hu: A számítógép arra használja azokat a tabokat a sorok elején, hogy tudja melyik kódblokkhoz (pl. függvény) mely sorok tartoznak.

source: If the line of code with the error is right after a line ending with a colon, like a function definition, you need one extra indent level compared to the previous line.
hu: Ha a hibás sor közvetlenül egy olyan után van, ami kettőspontra végződik, akkor az előző sorhoz képest egy tabbal beljebb kell kezdeni.

source: In other words, your line should have one more leading tab character than the function definition.
hu: Más szóval, a sorodnak eggyel több tabbal kell kezdődni, mint a függvénynek, ami tartalmazza.

source: You get this error when you wrote something that is syntactically invalid, or you are missing something to complete this line or previous lines of code.
hu: Akkor kapod ezt a hibaüzenetet, ha szintaktikai hibát vétesz, vagy ha kihagysz valamit, amivel befejeznéd ezt vagy az előző sort.

source: You need to be extremely precise when you write code for the computer. This kind of error is easy to get as all it takes is one wrong character.
hu: Nagyon pontosnak kell lenned, ha kódot írsz a számítógépen. Nagyon könnyű belefutni ebbe a hibába, mert elég hozzá egyetlen elütés is.

source: Note that this error can appear [b]after[/b] the line causing it due to how the computer reads and analyzes your code.
hu: Vedd észre, hogy ez a hiba megjelenhet azután a sor [b]után[/b] is, ami okozza, mert a számítógép így olvassa és dolgozza fel a kódot.

source: The way to solve this kind of error is highly contextual. The error message should tell you which character or element it's missing.
hu: Ennek a problémának a megoldása eléggé környezetfüggő. A hibaüzenet el kéne, hogy árulja, melyik karakter, vagy elem hiányzik.

source: If the error says "expected," then you're likely missing something in one of the [b]previous[/b] code lines. It could be a punctuation mark, a parenthesis, or something else.
hu: Ha az üzenet azt mondja "expected", akkor valószíűleg kihagytál valamit az [b]előző[/b] sor(ok)ban. Lehet írásjel, zárójel, vagy valami más.

source: If it says "unterminated," you are missing some character at the end of an expression, like a closing bracket. In this case, it most likely comes from the line with the error.
hu: Ha azt írja "unterminated", akkor a kifejezés végéről hiányzik valami, pl. egy csukó zárójel. Ebben az esetben, valószínűleg abban a sorban lesz a hiba, ahol jelzi.

source: This error tells you that you are missing a parenthesis (or sometimes a comma or a path).
hu: Ez a hiba azt jelenti, hogy hiányzik egy zárójel (vagy néha egy vessző, vagy egy útvonal).

source: Three keywords in GDScript work like function calls and require parentheses: [code]yield()[/code], [code]preload()[/code], and [code]assert()[/code].
hu: A GDScriptben van három kulcsszó, ami függvényként működik, és szüksége van zárójelre: [code]yield()[/code], [code]preload()[/code], és [code]assert()[/code].

source: To address the error, you want to add the missing opening parenthesis, the closing parenthesis, or the comma.
fa: برای رسیدگی به این خطا، باید ویرگول (,) یا کمانک‌هایی که از جا انداختید را بیفزایید.
hu: A hiba javításához add meg a nyitó/csukó zárójelet, vagy vesszőt.
pt: Para resolver esse erro, precisa adicionar o parêntese de abertura, o parêntese de fechamento, ou a vírgula que estiver faltando.
ru: Чтобы устранить ошибку, вам необходимо добавить отсутствующую открывающую круглую скобку, закрывающую круглую скобку или запятую.
sv: För att åtgärda felet vill du lägga till den saknade öppningsparentesen, den avslutande parentesen eller kommatecken.
tr: Bu hatayı gidermek için, eksik olan açık parantez, kapalı parantez, ya da virgülü eklemek isteyebilirsin.

source: This error tells you are missing some parenthesis, a comma, or some value in your export hint.
hu: Ez a hibaüzenet azt jelenti, hogy hiányzik a nyitó/csukó zárójel, egy vessző, vagy valamilyen érték az export tippnél.

source: You need to read the error message and add the missing character or value it requests.
fa: باید پیام خطا را بخوانید و ارزش یا نویسه‌ی ازجاافتاده‌ای که درخواست می‌کند را بیفزایید.
hu: Olvasd el a hibaüzenetet és add meg a hiányzó karaktert vagy értéket.
pt: Precisa ler a mensagem de erro e adicionar o caractere ou o valor que estiver faltando.
ru: Вам нужно прочитать сообщение об ошибке и добавить отсутствующий символ или значение, которое оно запрашивает.
sv: Du måste läsa felmeddelandet och lägga till det saknade tecken eller värde som efterfrågas.
tr: Hata mesajını okumalı ve sana söylediği eksik olan karakteri ya da değeri eklemelisin.

source: This error happens in several cases:
hu: Ennek a hibának több oka is lehet:

source: 1. You wrote an identifier (variable or function name) in the wrong place. 2. You wrote a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], and you did not follow it by a name. 3. You wrote a function definition but forgot the parentheses before the colon.
hu: 1. Rossz helyre írtál egy azonosítót (változó vagy függvénynév). 2. Használtad a [code]var[/code], [code]func[/code], [code]for[/code], vagy [code]signal[/code] kulcsszavak egyikét, de nem adtál meg nevet. 3. Definiáltál egy függvényt, de lefelejtetted a zárójeleket a kettőspont előtt.

source: If the error tells you it expected something, you likely forgot to write a name after a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], making your code invalid. Or you forgot parentheses in a function definition. You can address the error by adding the missing name or parentheses.
hu: Ha hiba az, hogy "expected", akkor valószínűleg elfelejtettél nevet írni a [code]var[/code], [code]func[/code], [code]for[/code], vagy [code]signal[/code] kulcsszavak valamelyike után, ezzel érvénytelenné téve a kódod. Vagy lehagytad a zárójelet a függvényhíváskor. Kijavíthatod a hibát, ha pótolod ezeket.

source: If the error says you have something unexpected, you are likely missing a keyword like [code]var[/code], [code]func[/code], [code]for[/code], etc.
hu: Ha a hiba szerint valami "unexpected", akkor valószínűleg lehagytad a [code]var[/code], [code]func[/code], [code]for[/code], stb kulcsszavak valamelyikét.

source: Another possibility is that you need to write a colon at the end of a function definition, [code]for[/code] loop, or a line starting with [code]if[/code], [code]elif[/code], or [code]else[/code].
hu: Egy másik lehetőség, hogy tenned kell egy kettőspontot a függvény definíció, [code]for[/code] ciklus, vagy pedig egy [code]if[/code], [code]elif[/code], vagy [code]else[/code] kulcsszóval kezdődő sor végére.

source: This error tells you that you are missing a type somewhere. A type can be [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], and many identifiers representing a data structure.
hu: Ez a hiba azt jelenti, hogy valahol nem adtál meg típust. A típus lehet [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], és még sok más, ami valamilyen adatstruktúrát jelöl.

source: Most of the time, this error occurs when you wrote a colon after a variable name but did not follow it with a type name.
hu: A legtöbb esetben akkor jön elő, ha tettél egy kettőspontot egy változó neve után, de nem írtál utána típust.

source: It also occurs when you write an arrow ([code]->[/code]) after the parentheses of a function definition but do not follow it with a type name.
hu: Akkor is előjön, ha egy nyilat ([code]->[/code]) raksz a függvény definíció zárójele után, de nem követed azt típus megadással.

source: To solve this, you need to write the name of the type after the colon, arrow (in the case of function return types), inside parentheses (for export types), or after the [code]as[/code] keyword.
fa: برای حل کردن این، باید نام گونه را پس از دونقطه، پیکان (برای گونه‌های برگشتی تابع)، درون کمانک‌ها (برای گونه‌های برون‌برد) یا پس از کلید‌واژه‌ی [code]as[/code] بنویسید.
hu: A javításhoz add meg a típust a kettőspont vagy nyíl (függvény visszatérési típus esetén) után, zárójelben (export típus), vagy az [code]as[/code] kulcsszó után.
pt: Para resolver esse erro, precisa escrever o nome do tipo depois do sinal de dois pontos, da seta (no caso de ser uma função que retorna algum tipo), de dentro do parêntese (para tipos que exportam), ou depois da palavra-chave [code]as[/code].
ru: Чтобы решить эту проблему, вам нужно написать имя типа после двоеточия, стрелки (в случае типов, возвращаемых функцией), внутри круглых скобок (для типов экспорта) или после ключевого слова [code]as[/code].
sv: För att lösa detta måste du skriva namnet på typen efter kolon, pil (vid funktionsreturtyper), inom parentes (för exporttyper) eller efter nyckelordet [code]as[/code].
tr: Bunu çözmek için, iki nokta üstüste ve ok'tan (fonksiyon bir dönüş tipine sahipse) sonra, parantezlerin içinde (dışa aktarım, export, tipleri için), ve ya [code]as[/code] anahtar kelimesinden sonra, ilgili tip ismini yazmalısın.

source: The variable, function name, or class name you are trying to use does not exist.
hu: A változó, függvény vagy osztály, amire hivatkozol, nem létezik.

source: You most often get this error when you make typos. Maybe you swapped two letters, forgot a letter... sometimes, it's hard to spot.
hu: Legtöbbször akkor jön elő ez a hiba, ha elírtál valamit. Talán megcseréltél két betűt, vagy kihagytál egyet... néha nehéz észrevenni.

source: The other cause for this error is that you didn't define the variable, function, or class you're trying to access.
hu: A másik ok az lehet, hogy még nem hoztad létre a változót, függvényt vagy osztályt, amit el szeretnél érni.

source: To solve this error, triple-check that there is no typo in the line.
hu: Hogy kijavítsd ezt a hibád, ellenőrizd többször is, hogy nincs-e elírás az adott sorban.

source: If you can, try to go to the variable or function definition, double-click the name, copy it, and paste it where you see the error.
hu: Ha lehetséges, menj a változó vagy függvény deklarációhoz, jelöld ki, másold majd illeszd be a hibás sorba.

source: If you don't see any typo, then you need to ensure that you defined the variable, function, or class you are referring to.
hu: Ha nem látsz semmi elírást, győzödj meg róla, hogy definiáltad-e egyáltalán a változót, függvényt vagy osztályt, amire hivatkozol.

source: You can only use keywords like [code]break[/code] or [code]continue[/code] in a loop. Outside a loop, they are invalid.
hu: A [code]break[/code] vagy [code]continue[/code] kulcsszavakat csak ciklusokban használhatod. A cikluson kívül érvénytelenek.

source: The [code]continue[/code] keyword means "jump to the next iteration of the loop." And the [code]break[/code] keyword means "end the loop right now and jump to the first line of code after the loop block.
hu: A [code]continue[/code] azt jelenti, hogy "ugorj a ciklus következő iterációjára." A [code]break[/code] pedig azt, hogy "azonnal fejezd be a ciklust és ugorj a ciklus utáni első sorra".

source: If you wrote one of these keywords outside a loop, you need to remove it.
hu: Ha valamelyik kulcsszót a cikluson kívülre írtad, akkor töröld onnan.

source: If you are trying to use it inside a loop, your indentation is most likely at fault. You may need to insert one or more leading tab characters to the keyword.
hu: Ha cikluson belül próbálod használni, akkor valószínűleg a behúzással lesz probléma. Lehet, hogy egy vagy több tab karakterre lesz szükséged a kulcsszó előtt.

source: When the computer talks about a constant expression, it expects a fixed value, a fixed calculation, or the name of an existing constant.
hu: Ha "constant expression"-ről beszél a számítógép, akkor egy fix értékre, számításra vagy egy már létező konstans nevére számít.

source: In other words, it wants something that can never change. This is why the computer will reject function calls and variables where it needs a constant expression.
hu: Más szavakkal, valami olyasmit vár, ami soha nem változhat. Ezért nem fogad el a számítógép függvényt vagy változót ott, ahol konstansra van szüksége.

source: You need to replace function calls or variables with a constant value like a whole number, decimal number, string, vector, a predefined array, etc.
hu: A függvények vagy változók helyett egy konstans kell használnod, például: egész szám, tört szám, string, vector, előre definiált tömb, stb.

source: You can also use arithmetic operators like multiplications (*), additions (+), and so on.
hu: Használhatsz műveleti jeleket is, mint például szorzás (*) vagy összeadás (+).

source: When defining a new class, you need to follow a specific pattern. You must write the name in plain text, starting with a letter.
hu: Osztály létrehozásánál egy bizonyos mintát kell követned. Egyszerű szövegként kell megadni a nevet, betűvel kezdve.

source: We typically write class names in PascalCase: with a capital letter at the start of every word that composes the class name.
hu: Az osztályneveket általában PascalCase-ben írjuk: az osztály nevét alkotó szavak mind nagybetűvel kezdődnek.

source: To fix this error, replace whatever you put after the 'extends' or 'class_name' keyword by a name without spaces and starting with a capital letter.
hu: A javításhoz, cseréld le ami az "extends" vagy a "class_name" után van, egy olyan névre, ami nem tartalmaz szóközöket és nagybetűvel kezdődik.

source: You can optionally use numbers in the name, but not in the first position.
hu: Használhatsz számokat is a névben, de nem kezdheted azzal.

source: You are trying to define a function or variable that already exists; You can't do that.
hu: Egy olyan függvényt vagy változót próbálsz meg létrehozni, ami már létezik. Ilyet nem lehet.

source: Perhaps the function or variable already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
hu: Lehet, hogy az a függvény már létezik az aktuális script fájlban, vagy egy szülő osztályban, amiből ez a script leszármazik.

source: In the app, your code extends some built-in Godot code that's not visible to you.
hu: Az alkalmazásban a kódod olyan GDScript kódra is épül, ami számodra nem látható.

source: When that happens, you need to either rename your function or variable to one that will not collide with an existing one or remove this line of code.
hu: Amikor ez történik, akkor át kell nevezned a függvényt vagy változót valami olyanra, ami nem egyezik meg egy már létezővel, vagy törölnöd kell azt a sort.

source: You are trying to define a signal that already exists; You can't do that.
hu: Egy már létező signalt próbálsz létrehozni. Ez nem megengedett.

source: Perhaps the signal already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
hu: Lehet, hogy a signal már létezik az aktuális kódban, de lehet, hogy egy szülő osztályban van, amiből a GDScript kód leszármazik.

source: When that happens, you need to either rename your signal to one that will not collide with an existing one or remove this line of code.
hu: Ha ez történik, akkor olyan nevet kell adnod a signalnak, amilyen még nem szerepel a kódban, vagy törölnöd kell azt.

source: The function you're trying to define exists in a parent class, so your definition overrides the parent class's function.
hu: A függvény, amit létre akarsz hozni, már létezik egy szülő osztályban, szóval a deklarációd felülírja a szülő osztályban lévő függvényt.

source: When you override a parent class's function, the new function must match the parent. The new function should have the same number and type of parameters as the parent class.
hu: Ha felülírod a szülő osztályban lévő függvényt, az új függvények meg kell egyeznie vele. Az új függvény paramétereinek száma és típusa meg kell, hogy ezzen a szülő osztályéval.

source: For example, if the parent has two arguments, you need your new function also to have two arguments. If you use type hints in your function definitions, the argument types must match the parent class.
hu: Például, ha a szülőnek két argumentuma van, akkor az új függvényednek is két argumentummal kell rendelkeznie. Ha használsz típusmeghatározást a szülő osztályban, akkor az argumentumok típusának meg kell egyeznie azzal.

source: You need to check the parent class's function and its definition in the code reference. Then, you need to edit your function definition to have the same number and type of parameters as the parent class.
fa: باید تابع کلاس سرپرست و تعریف آن در بازبرد کد را بررسی کنید. سپس، باید تعریف تابع خود را بویرایید تا همان اندازه و گونه‌های پارامتر کلاس سرپرست را داشته باشد.
hu: Ellenőrizned kell a szülő osztályban lévő függvényt és annak deklarációját a kódban. Ezután módosítanod kell a saját függvény deklarációd, hogy azonos típusú és számú argumentummal rendelkezze, mint a szülő.
pt: Precisa verificar a função da classe pai e as suas definições na referência de código. Então, precisa editar a sua definição de função para ter a mesma quantidade e tipos de parâmetros que a classe pai.
ru: Вам необходимо проверить функцию родительского класса и ее определение в справочнике по коду. Затем вам нужно отредактировать определение вашей функции, чтобы оно имело то же количество и тип параметров, что и родительский класс.
sv: Du måste kontrollera moderklassens funktion och dess definition i kodreferensen. Sedan måste du redigera din funktionsdefinition så att den har samma antal och typ av parametrar som den överordnade klassen.
tr: Ana sınıfın fonksiyonunu ve nasıl tanımlandığını, kod başvuru kaynaklarından kontrol etmelisin. Sonra, fonksiyon tanımını, girdi değişkenlerinin sayıları ve tipleri ana sınıftaki ile aynı olacak şekilde yeniden düzenlemelisin.

source: This whole class of errors has to do with calling functions with either the wrong number of arguments or the wrong kind of argument. You will need to use the error message to see what is going wrong.
fa: همه‌ی خطاهای این کلاس مربوط به فراخواندن تابع‌ها با شمار نادرستی از آرگومان‌ها یا گونهٔ نادرستی از آرگومان می‌باشد. باید پیام خطا را برای فهمیدن وضعیت به‌کار ببرید.
hu: Az összes ilyen típusú hiba arra utal, hogy nem megfelelő számú vagy típusú argumentumot adtál meg. A hibaüzenetet kell használnod, hogy kiderítsd, pontosan mi a baj.
pt: Todos esses erros de classe tem a ver com chamar funções com a quantidade de argumentos errados ou com o tipo errado de argumento. Precisa usar a mensagem de erro para ver o que dá errado.
ru: Весь этот класс ошибок связан с вызовом функций либо с неправильным количеством аргументов, либо с неправильным типом аргумента. Вам нужно будет воспользоваться сообщением об ошибке, чтобы увидеть, что пошло не так.
sv: Hela denna klass av fel har att göra med att anropa funktioner med antingen fel antal argument eller fel sorts argument. Du måste använda felmeddelandet för att se vad som går fel.
tr: Bu hata sınıfı, fonksiyonları, ya yanlış sayıda girdi değişkeni ile çağırmak, ya da yanlış girdi değişkeni tipi kullanmak ile ilgilidir. Hata mesajının kendisini okuyup neyin yanlış olduğunu görmen gerekiyor.

source: You need to either remove, add, or change the values you're trying to pass to the function to solve this issue. To know exactly how many arguments you need, you need to check the code reference. It will show you the function definition and the mandatory arguments.
fa: برای حل کردن این مشکل، باید ارزشی که در کوشش دادن آن به تابع‌اید را بزدایید، دگرگون کنید یا به شمار آن بیفزایید. برای دانستن اینکه چند آرگومان نیاز دارید، باید بازبرد کد را بررسی کنید. تعریف تابع و آرگومان‌های الزامی را به شما نشان خواهد داد.
hu: Ahhoz, hogy javítsd ezt a hibát, lehet, hogy törölnöd, hozzádnod vagy módosítanod kell az értékeket, amelyeket a függvénynek próbálsz meg átadni. Ahhoz, hogy megtudd pontosan hány argumentumra van szükséged, meg kell nézned a kódot. Ez megmutatja neked a függvény deklarációt és a szükséges argumentumokat.
pt: Precisa remover, adicionar ou mudar os valores que tenta passar para a função para resolver esse problema. Para saber exatamente quantos argumentos precisa usar, precisa verificar a referência de código. Ela vai mostrar-lhe a definição da função e os argumentos mandatórios.
ru: Вам нужно удалить, добавить, либо изменить значения, которые вы пытаетесь передать функции, чтобы решить эту проблему. Чтобы точно знать, сколько аргументов вам нужно, вам нужно проверить справочник по коду. Он покажет вам определение функции и обязательные аргументы.
sv: Du måste antingen ta bort, lägga till eller ändra värdena du försöker skicka till funktionen för att lösa det här problemet. För att veta exakt hur många argument du behöver måste du kontrollera kodreferensen. Den kommer att visa dig funktionsdefinitionen och de obligatoriska argumenten.
tr: Bunu çözmek için, ya fonksiyona gönderdiğin değişkenlere ekleme yapmalı, ya bunlardan bir kaçını çıkarmalı, ya da bunların değerlerini değiştirmelisin. Tam olarak kaç tane girdi değişkeni gerektiğini görmek için kod başvuru kaynaklarına bakmak gerekiyor. Bunlar sana fonksiyonun nasıl tanımlandığını ve gerekli olan girdi değşkenlerini gösterecektir.

source: All the values in your code have a specific type. That type can be a whole number (int), a decimal number (float), text (String), and so on. There are tons of possible types, and you can even define your own!
hu: A kódban minden értéknek van egy egyedi típusa. Ez lehet egész szám (int), törtszám (float), szöveg (String), stb. Rengetegféle típus létezik, sőt sajátot is létrehozhatsz!

source: When you make any operation, the computer compares the types you are using.
hu: Ha valamilyen műveletet hajtasz végre, a számítógép összehasonlítja a típusokat, amiket használsz.
