Repository: GDQuest/learn-gdscript-translations
Catalog: */error_database.po
Languages: fa, hu, pt, ru, sv, tr

source: The simplest way to solve this error is to remove types for this variable or this function's arguments. Otherwise, you can manually specify the value type after the colon. We recommend specifying the type whenever possible to reap the typing system's benefits.
pt: A maneira mais simples de resolver esse erro é remover os tipos dessa variável ou os argumentos dessa função. Caso contrário, pode especificar manualmente o tipo do valor depois do sinal de dois pontos. Recomendamos especificar o tipo sempre que for possível para colher os benefícios do sistema de digitação.
ru: Самый простой способ устранить эту ошибку — удалить типы для этой переменной или аргументов этой функции. В противном случае вы можете вручную указать тип значения после двоеточия. Мы рекомендуем указывать тип всякий раз, когда это возможно, чтобы воспользоваться преимуществами системы типизации.
sv: Det enklaste sättet att lösa det här felet är att ta bort typer för denna variabel eller denna funktions argument. Annars kan du manuellt ange värdetypen efter kolon. Vi rekommenderar att du specificerar typen när det är möjligt för att dra nytta av maskinskrivningssystemets fördelar.
tr: Bu hatayı çözmenin en kolay yolu, bu değişkenden ya da fonksiyonun girdi değişkenlerinden tipleri kaldırmak. Aksi durumda, iki nokta üstüsteden sonra tip değerini elle girerek tanımlamalısın. Tip sisteminin nimetlerinden yararlanmak için, mümkün olduğu kadar tipleri belirtmeni tavsiye ediyoruz.

source: There is an issue with the return value of your function. There are two main cases here: 1. Your function is a void function, thus it should not return a value. This includes functions with the '-> void' syntax and class constructors ('_init()'). 2. You specified a return type for your function, but you are not returning a value in all possible branches (if, elif, and else blocks) or at the end.
pt: Tem um problema com o valor de retorno da sua função. Há dois casos principais aqui: 1. A sua função é uma função vazia, logo não deve retornar um valor. Isso inclui funções com a sintaxe '-> void' e construtores de classe ('_init()'). 2. Especificou um tipo de retorno na sua função, mas não retorna nenhum valor em todas as ramificações possíveis (blocos if, elif, e else) ou no final.
ru: Возникла проблема с возвращаемым значением вашей функции. Здесь есть два основных случая: 1. Ваша функция является пустой функцией, поэтому она не должна возвращать значение. Сюда входят функции с синтаксисом «-> void» и конструкторы классов («_init()»). 2. Вы указали тип возвращаемого значения для своей функции, но не возвращаете значение во всех возможных ветвях (блоки if, elif и else) или в конце блока этой функции.
sv: Det finns ett problem med returvärdet för din funktion. Det finns två huvudfall här: 1. Din funktion är en void funktion, så den bör inte returnera ett värde. Detta inkluderar funktioner med '-> void'-syntaxen och klasskonstruktörer ('_init()'). 2. Du angav en returtyp för din funktion, men du returnerar inte ett värde i alla möjliga grenar (if-, elif- och annat-block) eller i slutet.
tr: Fonksiyonunun dönüş değerinde bir sorun var. Burada iki durum söz konusu: 1. Fonksiyonun bir boş (void) fonksiyondur, ve herhangi bir değer döndürmemelidir. Bu tip fonksiyonlar, '-> void' söz yazımı ile tanımlanan fonksiyonlar ile sınıf yapıcılardır ('_init()'). 2. Fonksiyonun için bir dönüş tipi tanımladın, ama gerekli tüm kollardan (if, elif, ve else kalıpları) yada en sonda bir değer geri döndürmüyorsun.

source: When your function is 'void', you should never return a value. You can use the 'return' keyword to end the function early, but you should never write anything after that. When you use a return type, you must always return something at the end of the function or in every branch (if, elif, and else block) of the function.
pt: Quando a sua função está vazia (void), nunca deve retornar um valor. Pode usar a palavra-chave 'return' para encerrar a função mais cedo, mas nunca deve escrever nada depois disso. Quando usa um tipo de retorno, precisa sempre retornar algo no final da função ou em toda ramificação (blocos if, elif, e else) da função.
ru: Когда ваша функция имеет значение «void», вы никогда не должны возвращать значение. Вы можете использовать ключевое слово «return», для досрочного завершения функции, но вы никогда не должны ничего писать после этого ключевого слова. Когда вы используете возвращаемый тип, вы всегда должны возвращать что-то в конце функции или в каждой ветви (блоки if, elif и else) функции.
sv: När din funktion är "void", bör du aldrig returnera ett värde. Du kan använda nyckelordet 'retur' för att avsluta funktionen tidigt, men du ska aldrig skriva något efter det. När du använder en returtyp måste du alltid returnera något i slutet av funktionen eller i varje gren (if, elif och annat block) av funktionen.
tr: fonksiyonun 'void' ise, geriye bir değer döndürmemelisin. 'return' anahtar kelimesini, fonksiyonu erken sonlandırmak için kullanabilirsin, ama bunun arkasına hiç bir şey yazmamalısın. Bir dönüş tipi kullanıyorsan, ya fonksiyon bitiminde ya da fonksiyonun her bir kolunda (if, elif, and else) aynı şekilde dönüş yapmalısın.

source: The computer reached the end of the line of code, but the line had a syntax error. The most common case is when you forget to close a string: you have opening quotes, but you forget to add a matching closing quote.
tr: Bilgisayar, kodun son satırına ulaştı, ama bu satırda yazım hatası var. En yaygın durum, yukarıda bir yerlerde bir dizeyi kapatmayı unutmandır: başlangıç tırnak işaretini koyarsın, ama karşılık gelen kapanış tırnağını unutursun.

source: Double-check that you are not missing a quote character or that the quote character you used to start the string is the same as the one you used to close the string.
tr: Tırnak işareti karakterini unutmadığını, ya da başlayan ve kapatanın aynı olduğunu iki defa kontrol et. (tek, çift ve ters tırnak işaretleri).

source: The sub-variable you are trying to access does not exist.
tr: Kullanmaya çalıştığın alt-değişken tanımlı değil.

source: You probably have a typo in the name of the sub-variable that you are trying to access. Ensure that you don't have a capital letter where you should have a lowercase letter and vice versa.
tr: Muhtemelen, kullanmaya çalıştığın alt-değişkenin isminde bir yazım hatası yaptın. Küçük harf kullanman gereken yerde büyük harf kullanmadığına, ya da tam tersi, emin ol.
