Repository: GDQuest/learn-gdscript-translations
Catalog: */error_database.po
Languages: fa, hu, pt, ru, sv, tr

source: The way to solve this kind of error is highly contextual. The error message should tell you which character or element it's missing. If the error says "expected," then you're likely missing something in one of the [b]previous[/b] code lines. It could be a punctuation mark, a parenthesis, or something else. If it says "unterminated," you are missing some character at the end of an expression, like a closing bracket. In this case, it most likely comes from the line with the error.
fa: شیوه‌ی چاره‌گشایی اینگونه خطا‌ها بسیار وابسته به بافتار است. پیام خطا باید به شما بگوید که کدام نویسه یا درایه از جا افتاده است. اگر خطا می‌گوید «,expected» (مورد انتظار) به این معنا است که شما چیزی از خط‌های کد [b]پیشین[/b] را از جا انداخته‌اید. می‌تواند یک نشانه‌ی نقطه‌گذاری، کمانک یا چیز دیگری باشد. اگر می‌گوید «,unterminated» (نافرجام) به این معنا است که شما نویسه‌ای مانند کمانک را در پایان یک گزاره از جا انداخته‌اید. در این حالت به احتمال بسیار از خط دارای خطا می‌آید.
pt: A maneira de resolver esse tipo de erro é altamente contextual. A mensagem de erro deve dizer-lhe qual caractere ou elemento falta. Se o erro disser "esperado," então é bem provável que falta algo nas linhas de código [b]anteriores[/b]. Pode ser um sinal de pontuação, um parênteses, ou qualquer coisa assim. Se disser "indeterminado", então está faltando algum caractere no final de uma expressão, como um colchete de fechamento. Nesse caso, é bem provável que esteja na linha do próprio erro.
ru: Способ устранения такого рода ошибок в значительной степени зависит от контекста. В сообщении об ошибке должно быть указано, какой символ или элемент отсутствует. Если в сообщении об ошибке написано «ожидается» ("expected"), скорее всего, вы что-то упустили в одной из [b]предыдущих[/b] строк кода. Это может быть знак препинания, скобка или что-то еще. Если в сообщении написано «незавершенный» ("unterminated"), значит вам не хватает какого-то символа в конце выражения, например, закрывающей скобки. В данном случае проблема скорее всего исходит из строки с ошибкой.
sv: Sättet att lösa denna typ av fel är mycket kontextuellt. Felmeddelandet bör tala om för dig vilket tecken eller element det saknas. Om felet säger "expected" så missar du sannolikt något i någon av de [b]föregående[/b] kodraderna. Det kan vara ett skiljetecken, en parentes eller något annat. Om det står "unterminated" saknar du något tecken i slutet av ett uttryck, som en avslutande parentes. I det här fallet kommer det troligen från linjen med felet.
tr: Böyle bir hatanın çözümü büyük oranda içeriğe bağlıdır. Hata mesajı sana, hangi karakter yada öğenin eksik olduğunu söylüyor olmalıdır. Eğer hata "expected" (beklenen) diyorsa, [b]önceki[/b] satırların birinde bir şeyleri atlamış olmalısın. Bir noktalama işareti, bir parantez, ya da bşka bir şey. Eğer "unterminated" (sonlandırılmadı) diyorsa, bir ifadenin sonunda olması gereken bir karakteri unutmuşsundur (mesela kapalı parantez) Bu durumda, sorun genelde hata mesajında verilen satırdadır.

source: This error tells you that you are missing a parenthesis (or sometimes a comma or a path). Three keywords in GDScript work like function calls and require parentheses: [code]yield()[/code], [code]preload()[/code], and [code]assert()[/code].
fa: این خطا به شما می‌گوید که یک کمانک (یا گاهی یک ویرگول (,) یا مسیر) را از جا انداخته‌اید. سه کلیدواژه در جی.دی.اسکریپت مانند فراخوان‌های تابع کار کرده و به کمانک نیازمندند: [code]yield()[/code]، [code]preload()[/code] و [code]assert()[/code].
pt: Esse erro diz-lhe que falta um parêntesis (ou às vezes uma vírgula ou um caminho de algum arquivo). Três palavras-chave no GDScript funcionam como chamadas de função e precisam de parênteses: [code]yield()[/code], [code]preload()[/code] e [code]assert()[/code].
ru: Данная ошибка говорит вам о том, что у вас отсутствует скобка (или иногда запятая или путь). Три ключевых слова в GDScript работают как вызовы функций и требуют круглых скобок: [code]yield()[/code], [code]preload()[/code] и [code]assert()[/code].
sv: Det här felet talar om för dig att du saknar en parentes (eller ibland ett kommatecken eller en sökväg). Tre nyckelord i GDScript fungerar som funktionsanrop och kräver parenteser: [code]yield()[/code], [code]preload()[/code] och [code]assert()[/code].
tr: Bu hata, bir parantez (ya da virgül veya bir yol) eksik yazdığını söyler. GDScript'te üç tane kelime fonksiyon çağırısı gibi çalışır ve paranteze ihtiyaç duyar: [code]yield()[/code], [code]preload()[/code], ve [code]assert()[/code].

source: This error tells you you are missing some parenthesis, a comma, or some value in your export hint.
fa: این خطا به شما می‌گوید که شما چند کمانک، ویرگول یا ارزش را در راهنمایی برون‌برد خود از جا انداختید.
pt: Esse erro diz-lhe que falta algum parêntese, uma vírgula ou algum valor na sua dica de exportação.
ru: Данная ошибка говорит вам о том, что в вашем обозначении экспорта отсутствуют какие-то круглые скобки, запятая или какое-то значение.
sv: För att åtgärda felet vill du lägga till den saknade öppningsparentesen, den avslutande parentesen eller kommatecken.
tr: Bu hata, bir kaç parantezi, bir virgülü, ye da dışa aktarım (export) ipucundaki bi değeri unuttuğunu söyler.

source: This error happens in several cases: 1. You wrote an identifier (variable or function name) in the wrong place. 2. You wrote a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], and you did not follow it by a name. 3. You wrote a function definition but forgot the parentheses before the colon.
fa: این خطا در چند حالت رخ می‌دهد: ۱. شما یک شناسه (نام متغیر یا تابع) را در جای نادرست نوشتید. ۲. شما یک کلیدواژه مانند [code]var[/code]، [code]func[/code]، [code]for[/code] یا [code]signal[/code] نوشتید و روبه‌روی آن نامی ننوشتید. ۳.شما یک تعریف تابع نوشتید ولی فراموش کردید که پیش از ویرگول (,) کمانک بگذارید.
pt: Esse erro acontece em muitos casos: 1. Escreveu um identificador (variável ou nome de um função) no lugar errado. 2. Escreveu uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code] e em seguida não pôs um nome. 3. Escreveu uma definição de função mas esqueceu-se do parêntese antes do sinal de dois pontos.
ru: Данная ошибка возникает в нескольких случаях: 1. Вы написали идентификатор (имя переменной или функции) в неправильном месте. 2. Вы написали ключевое слово типа [code]var[/code], [code]func[/code], [code]for[/code] или [code]signal[/code], но за ним не последовало имя. 3. Вы написали определение функции, но забыли поставить круглые скобки перед двоеточием.
sv: Detta fel inträffar i flera fall: 1. Du skrev en identifierare (variabel eller funktionsnamn) på fel ställe. 2. Du skrev ett nyckelord som [code]var[/code], [code]func[/code], [code]for[/code], eller [code]signal[/code], och du följde det inte med ett namn. 3. Du skrev en funktionsdefinition men glömde parenteserna före kolon.
tr: Bu hata bir kaç farklı durumda oluşabilir: 1. Bir tanımlayıcıyı (değişken yada fonksiyon ismi) yanlış yerde kullandın. 2. [code]var[/code], [code]func[/code], [code]for[/code], ya da [code]signal[/code] gibi bir anahtar kelime yazdın, ama bunun devamına bir isim eklemedin. 3. Bir fonksiyon tanımı yazdın ama iki nokta üstüste'den önce parantezleri eklemedin.

source: If the error tells you it expected something, you likely forgot to write a name after a keyword like [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], making your code invalid. Or you forgot parentheses in a function definition. You can address the error by adding the missing name or parentheses. If the error says you have something unexpected, you are likely missing a keyword like [code]var[/code], [code]func[/code], [code]for[/code], etc. Another possibility is that you need to write a colon at the end of a function definition, [code]for[/code] loop, or a line starting with [code]if[/code], [code]elif[/code], or [code]else[/code].
fa: اگر خطا به شما می‌گوید که انتظار چیزی را داشت، احتمالا فراموش کردید پس از کلیدواژه‌هایی همچون [code]var[/code]، [code]func[/code]، [code]for[/code] یا [code]signal[/code] یک نام بنویسید، که کدتان را نامعتبر می‌کند. یا فراموش کردید پس از تعریف تابعی کمانک بگذارید. می‌توانید با افزودن نام یا کمانک‌های ازجاانداخته به این خطا رسیدگی کنید. اگر خطا به شما می‌گوید که چیز بیرون از انتظاری دارید، احتمالا کلیدواژه‌ای همچون [code]var[/code]، [code]func[/code]، [code]for[/code] و... را از جا انداخته‌اید. یا اینکه نیاز دارید پس از تعریف یک تابع، چرخه‌ی [code]for[/code] یا خطی آغازشده با [code]if[/code]، [code]elif[/code] یا [code]else[/code] یک دونقطه (:) بنویسید.
pt: Se o erro te disser que espera algo, provavelmente esqueceu-se de escrever um nome depois de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], or [code]signal[/code], fazendo assim o seu código inválido. Ou esqueceu-de de um parêntese numa definição de função. Pode resolver esse erro adicionando o nome ou parêntese que falta. Se o erro disser que tem algo inesperado, provavelmente esqueceu-se de uma palavra-chave como [code]var[/code], [code]func[/code], [code]for[/code], etc. Outra possibilidade é que precisa escrever o sinal de dois pontos no final da definição da função, estrutura de repetição [code]for[/code], ou numa linha começando com [code]if[/code], [code]elif[/code], ou [code]else[/code].
ru: Если ошибка говорит вам о том, что чего-то ожидала, то вы, скорее всего, забыли написать имя после ключевого слова, такого как [code]var[/code], [code]func[/code], [code]for[/code] или [code]signal[/code], что делает ваш код нерабочим. Или вы забыли круглые скобки в определении функции. Вы можете устранить ошибку, добавив отсутствующее имя или круглые скобки. Если ошибка говорит вам о том, что чего-то не ожидала, вам, вероятно, не хватает ключевого слова, такого как [code]var[/code], [code]func[/code], [code]for[/code] и т.д. Другая причина может быть в том, что вам нужно написать двоеточие в конце определения функции, цикла [code]for[/code] или строки, начинающейся с [code]if[/code], [code]elif[/code] или [code]else[/code].
sv: Om felet talar om för dig att det förväntade dig något, glömde du förmodligen att skriva ett namn efter ett nyckelord som [code]var[/code], [code]func[/code], [code]for[/code] eller [code] ]signal[/code], vilket gör din kod ogiltig. Eller så glömde du parenteser i en funktionsdefinition. Du kan åtgärda felet genom att lägga till det saknade namnet eller parenteserna. Om felet säger att du har något oväntat, saknar du troligen ett nyckelord som [code]var[/code], [code]func[/code], [code]for[/code], etc. En annan möjlighet är att du behöver skriva ett kolon i slutet av en funktionsdefinition, [code]for[/code] loop, eller en rad som börjar med [code]if[/code], [code]elif[/code] , eller [code]annan[/code].
tr: Eğer bir hata sana bir şey beklediğini (expected) söylüyorsa, [code]var[/code], [code]func[/code], [code]for[/code], ya da [code]signal[/code] gibi bir anahtar kelimeden sonra bir isim yazmayı unuttuğun için kod geçersiz hale gelmiştir. Ya da fonksiyon tanımlarken parantezleri unutmuşsundur. Eksik olan ismi yada parantezleri ekleyerek hatayı giderebilirsin. Eğer hata sana beklenmedik bir şey yaptığını söylerse (unexpected), [code]var[/code], [code]func[/code], [code]for[/code] vb. anahtar bir kelimeyi unutmuşsundur. Bir diğer olasılık ise, şunları yazarken en sonda iki nokta üstüste'yi eklemen gerekmesidir: fonksiyon tanımlarken, ya da [code]for[/code] döngüsü, [code]if[/code], [code]elif[/code], ve ya [code]else[/code] ile başlayan satırlarda.

source: This error tells you that you are missing a type somewhere. A type can be [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], and many identifiers representing a data structure. Most of the time, this error occurs when you wrote a colon after a variable name but did not follow it with a type name. It also occurs when you write an arrow ([code]->[/code]) after the parentheses of a function definition but do not follow it with a type name.
fa: این خطا به شما می‌گوید که یک گونه را از جا انداخته‌اید. یک گونه می‌تواند [code]int[/code]، [code]float[/code]، [code]String[/code]، [code]Array[/code]، [code]Vector2[/code] و شناسه‌های بسیاری که یک ساختار داده را نمایش می‌دهند باشد. بیشتر زمان‌ها، این خطا هنگامی رخ می‌دهد که شما یک دونقطه پس از نام متغیر نوشته‌اید ولی آن را با یک نام گونه دنبال نکردید. همچنین زمانی که پس از کمانک‌های تعریف تابعی، یک پیکان ([code]->[/code]) می‌نویسید ولی آن را با یک نام گونه دنبال نمی‌کنید نیز رخ می‌دهد.
pt: Esse erro diz-lhe que falta um tipo em algum lugar. Um tipo pode ser [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] e muitos identificadores que representam uma estrutura de dados. Na maioria das vezes, esse erro acontece quando escreve o sinal de dois pontos depois de um nome de uma variável que não possui o nome do tipo dela logo em seguida. Também acontece quando escreve uma seta ([code]->[/code]) depois de um parêntese de uma definição de função que não foi seguido pelo nome do tipo.
ru: Данная ошибка говорит вам о том, что у вас где-то отсутствует тип. Тип может быть [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] и множество идентификаторов, представляющих структуру данных. В большинстве случаев данная ошибка возникает, когда вы написали двоеточие после имени переменной, но не указали за ним имя типа. Такое также происходит, когда вы пишете стрелку ([code]->[/code]) после круглых скобок определения функции, но не указываете за ней имя типа.
sv: Det här felet talar om för dig att du saknar en typ någonstans. En typ kan vara [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code] och många identifierare som representerar en datastruktur. För det mesta uppstår detta fel när du skrev ett kolon efter ett variabelnamn men inte följde det med ett typnamn. Det förekommer också när du skriver en pil ([code]->[/code]) efter parenteserna för en funktionsdefinition men inte följer den med ett typnamn.
tr: Bu hata, bir yerlerde bir tip tanımını unuttuğunu söyler. Bir tip, [code]int[/code], [code]float[/code], [code]String[/code], [code]Array[/code], [code]Vector2[/code], ve bunlar gibi veri yapılarını temsil eden daha pek çok tanımlayıcı olabilir. Çoğunlukla, bu hatayı aldığında, bir değişken isminden sonra iki nokta üstüste yazmış, ama bunun devamında bir tip ismi belirtmemişsindir. Bu durum ayrıca, fonksiyon tanımlerken parantezden sonra bir ok ([code]->[/code]) yazmış ama bunu bir tip ismi ile bitirmemişsindir (fonksiyonun dönüş tipi).

source: The variable, function name, or class name you are trying to use does not exist. You most often get this error when you make typos. Maybe you swapped two letters, forgot a letter... sometimes, it's hard to spot. The other cause for this error is that you didn't define the variable, function, or class you're trying to access.
fa: نام متغیر، تابع یا کلاسی که شما در کوشش بکارگیری آن‌اید وجود ندارد. بیشتر زمان‌ها این خطا را بخاطر اشتباه‌های نوشتاری خواهید گرفت. شاید دو وات (حرف) را جای یکدیگر نوشتید یا یکی را فراموش کردید... گاهی، یافتن آن سخت است. دلیل دیگر این خطا این است که متغیر، تابع یا کلاسی که در کوشش دسترسی به آن‌اید را تعریف نکرده‌اید.
pt: A variável, nome de função, ou nome de classe que tenta usar não existe. Geralmente recebe esse erro quando comete erros na digitação de alguma palavra. Talvez trocou duas letras de lugar, esqueceu uma letra... às vezes é difícil de identificar. A outra causa para ter recebido esse erro é que não definiu a variável, função, ou classe que tenta aceder.
ru: Переменная, имя функции или имя класса, которые вы пытаетесь использовать, не существуют. Чаще всего вы получаете эту ошибку, когда делаете опечатки. Может быть, вы поменяли местами две буквы, забыли букву... иногда это трудно заметить. Другая причина этой ошибки в том, что вы не определили переменную, функцию или класс, к которым пытаетесь получить доступ.
sv: Variabeln, funktionsnamnet eller klassnamnet du försöker använda finns inte. Du får oftast detta fel när du gör stavfel. Kanske har du bytt två bokstäver, glömt en bokstav... ibland är det svårt att upptäcka. Den andra orsaken till detta fel är att du inte definierade variabeln, funktionen eller klassen du försöker komma åt.
tr: Kullanmaya çalıştığın değişken, fonksiyon ismi, ve ya sınıf ismi tanımlı değil. Bu hatayı aldığında genellikle yazım hatası yapmışsındır. Belki iki harfin yeri değişti, yada bir harfi unuttun... bunu farketmek çoğunlukla zordur. Bu hatanın bir diğer sebebi de, erişmeye çalıştığın değişkeni, fonksiyonu, ya da sınıfı tanımlamamış olmandır.

source: To solve this error, triple-check that there is no typo in the line. If you can, try to go to the variable or function definition, double-click the name, copy it, and paste it where you see the error. If you don't see any typo, then you need to ensure that you defined the variable, function, or class you are referring to.
fa: برای حل کردن این خطا، دوباره از نبود اشتباه نوشتاری در خط مطمئن شوید. اگر می‌توانید،‌ برای رفتن به تعریف تابع یا متغیر بکوشید، نام را دوباره بررسی کرده، روگرفت کنید، و آن را در جایی که خطا را می‌بینید، بچسبانید. اگر هیچ اشتباه نوشتاری نمی‌بینید، باید مطمئن شوید که متغیر، تابع یا کلاسی که بازبرد می‌کنید را تعریف کرده‌اید.
pt: Para resolver esse erro, verifique várias vezes que não há erros de digitação na linha de código. Se puder, tente ir à definição da variável ou função, reveja o nome, copie ele e cole onde estiver dando o erro. Se não achar nenhum erro de digitação, garanta que definiu a variável, a função ou a classe que tenta referenciar.
ru: Чтобы устранить эту ошибку, трижды проверьте, нет ли в строке опечатки. Если можете, попробуйте перейти к определению переменной или функции, дважды щелкните имя, скопируйте его и вставьте туда, где вы видите ошибку. Если вы не видите никаких опечаток, то вам необходимо убедиться, что вы определили переменную, функцию или класс, на которые ссылаетесь.
sv: För att lösa detta fel, trippelkontrollera att det inte finns något stavfel i raden. Om du kan, försök att gå till variabeln eller funktionsdefinitionen, dubbelklicka på namnet, kopiera det och klistra in det där du ser felet. Om du inte ser något stavfel måste du se till att du har definierat variabeln, funktionen eller klassen du hänvisar till.
tr: Bu hatayı çözmek için, tüm satırları yazım hataları için üç kere kontrol etmelisin. Münkünse, ilgili değişken yada fonksiyon tanımına git, ismine çift tıkla, kopyala, ve hatayı daha iyi görebileceğin boş bir alana yapıştır. Eğer bir yazım hatası göremiyorsan, ilgili değişkeni, fonksiyonu, ya da sınıfı tanımladığından emin olmalısın.

source: You can only use keywords like [code]break[/code] or [code]continue[/code] in a loop. Outside a loop, they are invalid. The [code]continue[/code] keyword means "jump to the next iteration of the loop." And the [code]break[/code] keyword means "end the loop right now and jump to the first line of code after the loop block.
fa: درون یک چرخه تنها می‌توانید کلیدواژه‌هایی مانند [code]break[/code] یا [code]continue[/code] را به‌کار ببرید. بیرون از چرخه، نامعتبرند. کلیدواژه‌ی [code]continue[/code] به معنای «پرش به تکرار بعدی چرخه» و کلیدواژه‌ی [code]break[/code] به معنای «در لحظه پایان دادن چرخه و پرش به نخستین خط کد پس از گروه کدی چرخه» می‌باشد.
pt: Só pode usar palavras-chave como: [code]break[/code] ou [code]continue[/code] numa estrutura de repetição. Fora de uma estrutura de repetição, elas são inválidas. A palavra-chave [code]continue[/code] significa "vá para a próxima iteração da repetição." e a palavra_chave [code]break[/code] significa "finalize a repetição agora mesmo e vá para a primeira linha de código depois do bloco dessa estrutura de repetição".
ru: Такие ключевые слова как [code]break[/code] или [code]continue[/code] можно использовать только в цикле. Вне цикла они недопустимы. Ключевое слово [code]continue[/code] означает «перейти к следующей итерации цикла». А ключевое слово [code]break[/code] означает «закончить цикл прямо сейчас и перейти к первой строке кода после блока цикла».
sv: Du kan bara använda nyckelord som [code]break[/code] eller [code]continue[/code] i en loop. Utanför en slinga är de ogiltiga. Nyckelordet [code]continue[/code] betyder "hoppa till nästa iteration av loopen." Och nyckelordet [code]break[/code] betyder "avsluta loopen just nu och hoppa till den första raden med kod efter loopblocket.
tr: [code]break[/code] ve ya [code]continue[/code] gibi bazı anahtar kelimeleri sadece bir döngünün içinde kulanabilirsin. Bunlar döngü dıında geçersizdir. [code]continue[/code] anahtar kelimesi "döngünün sonraki yinelemesine sıçra" anlamına gelir. Ve [code]break[/code] anahtar kelimesi "döngüyü hemen şimdi bitir ve döngü gövdesinin bittiği ilk satıra zıpla" anlamındadır.

source: If you wrote one of these keywords outside a loop, you need to remove it. If you are trying to use it inside a loop, your indentation is most likely at fault. You may need to insert one or more leading tab characters to the keyword.
fa: اگر یکی از این کلیدواژه‌ها را بیرون از یک چرخه نوشتید، باید آن را بزدایید. اگر دارید می‌کوشید آن را در یک چرخه به‌کار بگیرید، پس به احتمال فراوان تورفتگی‌های شما دارای مشکل‌اند. شاید نیاز به جایگذاری یک یا چند نویسه‌ی تَب (tab) در کلیدواژه داشته باشید.
pt: Se escreveu uma dessas palavras-chave fora de uma estrutura de repetição, precisa remove-la. Se tenta usa-las dentro de uma estrutura de repetição, a sua indentação provavelmente está errada. Precisa pôr um ou mais caractere de tabulação na palavra-chave.
ru: Если вы написали одно из этих ключевых слов вне цикла, вам нужно удалить это слово. Если вы пытаетесь использовать ключевое слово внутри цикла, скорее всего виноват ваш отступ. Возможно, вам потребуется вставить один или несколько начальных символов табуляции перед ключевым словом.
sv: Om du skrev något av dessa nyckelord utanför en loop måste du ta bort det. Om du försöker använda den inuti en slinga är det troligtvis fel på din indragning. Du kan behöva infoga ett eller flera inledande tabbtecken i sökordet.
tr: Eğer bu anahtar kelimelerden birini döngü dışında yazmışsan, hemen kaldırman gerekir. Eğer zaten döngü içinde kullandıysan, bu durumda kodun girinti miktarı hatalıdır. Kelimenin olduğu satır başına bir yada iki tane daha sekme karakteri eklemelisin.
