Repository: GDQuest/learn-gdscript-translations
Catalog: */error_database.po
Languages: fa, hu, pt, ru, sv, tr

source: When the computer talks about a constant expression, it expects a fixed value, a fixed calculation, or the name of an existing constant. In other words, it wants something that can never change. This is why the computer will reject function calls and variables where it needs a constant expression.
fa: هنگامی که رایانه درباره‌ی یک گزاره‌ی ثابت سخن می‌گوید، انتظار یک ارزش ایستا، یک برآورد ایستا یا نام یک ثابت موجود را دارد. به زبانی دیگر، چیزی می‌خواهد که هرگز نتوانید دگرگون کنید. دلیل نپذیرفتن فراخوان‌های تابع و متغیرهایی که نیاز به یک گزاره‌ی ثابت دارند به دست رایانه همین است.
pt: Quando o computador fala sobre uma expressão constante, ele espera um valor fixo, um cálculo fixo ou o nome de uma constante existente. Em outras palavras, ele quer alguma coisa que nunca pode mudar. É por isso que o computador irá rejeitar chamadas de funções e variáveis onde precisam de uma expressão constante.
ru: Когда компьютер говорит о постоянном выражении, он ожидает фиксированное значение, фиксированное вычисление или имя существующей константы. Другими словами, он хочет чего-то, что никогда не сможет измениться. Вот почему компьютер будет отклонять вызовы функций и переменных там, где ему требуется постоянное выражение.
sv: När datorn talar om ett konstant uttryck förväntar den sig ett fast värde, en fast beräkning eller namnet på en befintlig konstant. Den vill med andra ord något som aldrig kan förändras. Det är därför datorn kommer att avvisa funktionsanrop och variabler där den behöver ett konstant uttryck.
tr: Bilgisayar sana sabit bir ifadeden bahsediyorsa (constant), senden sabitlenmiş bir değer, sabit bir hesaplama, ya da ar olan bir sabitin ismini istiyor demektir. Diğer bir deyişle, hiç değişmeyecek bir şey istiyor demektir. Bilgisayarın, sabit ifadeler beklediği fonksiyon çağrıları yada değişkenleri geri çevirme sebebi bundandır.

source: You need to replace function calls or variables with a constant value like a whole number, decimal number, string, vector, a predefined array, etc. You can also use arithmetic operators like multiplications (*), additions (+), and so on.
fa: شما نیاز دارید تا فراخوان تابع‌ها یا متغیرها را با یک ارزش ثابت مانند یک عدد صحیح، عدد اعشاری، رشته، بُردار، آرایه‌ی از پیش تعریف‌شده و... جایگزین کنید. همچنین می‌توانید عملگرهای حسابی مانند ضرب (*)، جمع (+) و... را به‌کار بگیرید.
pt: Precisa substituir chamadas de funções ou variáveis com um valor constante como um número inteiro, um número decimal, string (cadeia de caractere), vetor, um array (uma matriz) predefinido, etc. Também pode usar operadores aritméticos como multiplicações (*), adições (+) e assim por diante.
ru: Вам нужно заменить вызовы функций или переменные постоянным значением, например целым числом, десятичной дробью, строкой, вектором, предопределенным массивом и т.д. Вы также можете использовать арифметические операторы, такие как умножение (*), сложение (+) и так далее.
sv: Du måste ersätta funktionsanrop eller variabler med ett konstant värde som ett heltal, decimaltal, sträng, vektor, en fördefinierad matris, etc. Du kan också använda aritmetiska operatorer som multiplikationer (*), tillägg (+) och så vidare.
tr: Fonksiyon çağrısı ya da değişkenleri şunlar gibi sabit değerlerle değiştirmelisin: bir tam sayı, ondalıklı sayı, dize, vektör, ön tanımlı dizi, vb. Bunlarla çarpma(*), toplama(+) ve benzeri aritmetik işlemleri de kullanabilirsin.

source: When defining a new class, you need to follow a specific pattern. You must write the name in plain text, starting with a letter. We typically write class names in PascalCase: with a capital letter at the start of every word that composes the class name.
fa: هنگام تعریف یک کلاس نو، باید یک الگوی مشخص را دنبال کنید. باید نام را در متن اصلی آغازشده با یک وات (حرف) بنویسید. ما بیشتر زمان‌ها نام کلاس‌ها را با پاسکال‌کِیس می‌نویسیم: با یک وات بزرگ در آغاز هر واژه‌ای که نام کلاس را می‌سازد.
pt: Quando definir uma nova classe, precisa seguir um padrão específico. Precisa escrever o nome dela com texto puro, começando com uma letra. Tipicamente escrevemos nome de classes em PascalCase: Com uma letra em maiúscula no começo de cada palavra que compõe o nome da classe.
ru: При определении нового класса вам необходимо следовать определенному шаблону. Вы должны написать имя обычным текстом, начиная с буквы. Обычно мы пишем имена классов стилем написания составных слов «PascalCase»: с заглавной буквы в начале каждого слова, составляющего имя класса.
sv: När du definierar en ny klass måste du följa ett specifikt mönster. Du måste skriva namnet i klartext, börja med en bokstav. Vi skriver vanligtvis klassnamn i PascalCase: med en stor bokstav i början av varje ord som utgör klassnamnet.
tr: Yeni bir sınıf tanımlarken, belirli bir kalıbı takip etmelisin. Bir harf ile başlayan düz metin bir isim yazmalısın (ingilizce harflerle) Sınıf isimlerinde, özgün olarak PascalCase kullanırız: sınıf ismini oluşturan her kelime, ilk harfi büyük olacak şekilde birleşir.

source: To fix this error, replace whatever you put after the 'extends' or 'class_name' keyword by a name without spaces and starting with a capital letter. You can optionally use numbers in the name, but not in the first position.
fa: برای درست کردن این خطا، هر چیزی که پس از کلید‌واژه‌ی «extends» یا «class_name» گذاشتید را با یک نام بی‌فاصله و آغازشده با یک وات (حرف) بزرگ جایگزین کنید. اگر بخواهید می‌توانید در نام شماره هم بگذارید، ولی نه بعنوان نخستین نویسه.
pt: Para resolver esse erro, substitua tudo aquilo que pôs depois das palavras-chave 'extends' ou 'class_name' por um nome sem espaços entre eles e começando com uma letra em maiúscula. Tem a opção de usar números no nome, mas não na primeira posição (não pode começar com números).
ru: Чтобы исправить эту ошибку, замените все, что вы поместили после ключевых слов «extends» или «class_name» именем без пробелов и начинающимся с заглавной буквы. По желанию вы можете дополнительно использовать цифры в имени, но не в первой позиции.
sv: För att åtgärda det här felet, ersätt det du lägger efter nyckelordet 'extends' eller 'class_name' med ett namn utan mellanslag och som börjar med en stor bokstav. Du kan använda siffror i namnet, men inte i första positionen.
tr: Bu hatayı düzeltmek için, 'extends' ya da 'class_name' anahtar kelimelerinden sonra her ne yazdıysan, ilk harfi büyük olan ve boşluk içermeyen bir isimle değiştirmelisin. İsteğe bağlı olarak ismin içinde numralar kullanabilirsin, ama kesinlikle ilk başta olmasınlar (bir harf ile başlamalı).

source: You are trying to define a function or variable that already exists; You can't do that. Perhaps the function or variable already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
fa: اگر در کوشش تعریف یک تابع یا متغیر از پیش موجودید؛ نمی‌توانید بینجامید. شاید تابع یا متغیر هم‌اکنون در پرونده‌ی کد کنونی هست، شاید هم در کلاس سرپرستی که این کد جی.دی.اسکریپت از آن ارث می‌برد، حاضر باشد.
pt: Tenta definir uma função ou variável que já existe. Não pode fazer isso. Talvez a função ou variável já exista no ficheiro de código atual, mas também pode estar na classe pai que esse código de GDScript estende.
ru: Вы пытаетесь определить функцию или переменную, которая уже существует. Вы не можете этого сделать. Возможно, функция или переменная уже существует в текущем файле кода, но она также может находиться и в родительском классе, который расширяет этот код GDScript.
sv: Du försöker definiera en funktion eller variabel som redan finns; Det kan du inte göra. Kanske finns funktionen eller variabeln redan i den aktuella kodfilen, men det kan också vara i en överordnad klass som denna GDScript-kod utökas.
tr: Zaten var olan bir fonksiyon yada değişkeni tanımlamaya çalışıyorsun. Bunu yapamazsın. Bu kod dosyasında bulunan fonksiyon ya da değişken, belki de bu GDScript kodunun içe aktarıp genişlettiği (extends) ana sınıfın içerisinde de tanımlanmıştır.

source: In the app, your code extends some built-in Godot code that's not visible to you. When that happens, you need to either rename your function or variable to one that will not collide with an existing one or remove this line of code.
fa: درون برنامه، کد شما از چند کد درون‌ساخته‌ی گودوت ارث می‌برد که شما آنها را نمی‌بینید. هنگام رخ دادن آن، باید تابع یا متغیر خود را به نامی که با دیگر نام‌های موجود برخورد نداشته باشد بازنامگذارید، یا این خط را از کد بزدایید.
pt: Na app, o seu código estende alguns códigos que já vêm integrado na Godot que não visíveis para si. Quando isso acontece, precisa: ou renomear a sua função ou variável que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.
ru: В приложении ваш код расширяет некоторый встроенный код Godot, который вам не виден. Когда такое произойдет, вам нужно либо переименовать свою функцию или переменную так, чтобы она не конфликтовала с уже существующей, либо удалить эту строку кода.
sv: I appen utökar din kod en del inbyggd Godot-kod som inte är synlig för dig. När det händer måste du antingen byta namn på din funktion eller variabel till en som inte kommer att kollidera med en befintlig eller ta bort den här kodraden.
tr: Uygulama içinde, senin yazdığın kod, senin göremediğin ama Godot içinde gömülü gelen kodları içe aktarıp genişletir (extends). Bu olduğunda, yazdığın fonksiyon yada değişken ismini, var olanlarla çakışmayacak şekilde değiştirmeli, veya bu kod satırını tamamen silmelisin.

source: You are trying to define a signal that already exists; You can't do that. Perhaps the signal already exists in the current code file, but it may also be in a parent class that this GDScript code extends.
fa: اگر در کوشش تعریف یک سیگنال از پیش موجودید: نمی‌توانید بینجامید. شاید سیگنال هم‌اکنون در پرونده‌ی کد کنونی هست، شاید هم در کلاس سرپرستی که این کد جی.دی.اسکریپت از آن ارث می‌برد، حاضر باشد.
pt: Tenta definir um sinal que já existe; Não pode fazer isso. Talvez esse sinal já exista no ficheiro do código atual, mas também pode estar na classe pai que esse código de GDScript estende.
ru: Вы пытаетесь определить сигнал, который уже существует; Вы не можете этого сделать. Возможно, сигнал уже существует в текущем файле кода, но он также может находиться в родительском классе, который расширяет этот код GDScript.
sv: Du försöker definiera en signal som redan finns; Det kan du inte göra. Kanske finns signalen redan i den aktuella kodfilen, men det kan också vara i en överordnad klass som denna GDScript-kod utökas.
tr: Zaten var olan bir sinyali (signal) yeniden tanımlamaya çalışıyorsun. Bunu yapamazsın. Yazdığın kod dosyasındaki bu sinyal, belki de bu GDScript kodunun içe aktarıp genişlettiği (extends) ana sınıfta da vardır.

source: In the app, your code extends some built-in Godot code that's not visible to you. When that happens, you need to either rename your signal to one that will not collide with an existing one or remove this line of code.
fa: درون برنامه، کد شما از چند کد درون‌ساخته‌ی گودوت ارث می‌برد که شما آنها را نمی‌بینید. هنگام رخ دادن آن، باید سیگنال خود را به نامی که با دیگر نام‌های موجود برخورد نداشته باشد بازنامگذارید، یا این خط را از کد بزدایید.
pt: No app, o seu código estende alguns códigos que já vêm integrado na Godot que não visíveis para si. Quando isso acontece, precisa: ou renomear o seu sinal que não seja igual a um nome que já exista nesses códigos integrados ou remover essa linha de código.
ru: В приложении ваш код расширяет некоторый встроенный код Godot, который вам не виден. Когда такое произойдет, вам нужно либо переименовать свой сигнал так, чтобы он не конфликтовал с уже существующим, либо удалить эту строку кода.
sv: I appen utökar din kod en del inbyggd Godot-kod som inte är synlig för dig. När det händer måste du antingen byta namn på din signal till en som inte kommer att kollidera med en befintlig eller ta bort den här kodraden.
tr: Uygulama içinde, senin yazdığın kod, senin göremediğin ama Godot içinde gömülü gelen kodları içe aktarıp genişletir (extends). Bu olduğunda, yazdığın fonksiyon yada değişken ismini, var olanlarla çakışmayacak şekilde değiştirmeli, ya da bu kod satırını tamamen silmelisin.

source: The function you're trying to define exists in a parent class, so your definition overrides the parent class's function. When you override a parent class's function, the new function must match the parent. The new function should have the same number and type of parameters as the parent class. For example, if the parent has two arguments, you need your new function also to have two arguments. If you use type hints in your function definitions, the argument types must match the parent class.
fa: تابعی که در کوشش تعریف آن‌اید در یک کلاس سرپرست هست، پس تعریف شما تابع کلاس سرپرست را بازنویسی می‌کند. هنگامی که تابع کلاس سرپرستی را بازمی‌نویسید، تابع نو باید با سرپرست مطابقت داشته باشد. تابع نو باید گونه‌ی یکسان و شمار یکسانی از پارامترهای کلاس سرپرست را دارا باشد. برای نمونه، اگر سرپرست دو آرگومان دارد، تابع نو شما نیز باید دو آرگومان داشته باشد. اگر راهنمایی گونه در تعریف تابع‌هایتان به‌کار می‌برید، گونه‌های آرگومان‌ها باید با کلاس سرپرست مطابقت داشته باشند.
pt: A função que tenta definir já existe numa classe pai, então a sua definição sobrescreve a função da classe pai. Quando sobrescreve uma função da classe pai, a nova função precisa corresponder a da classe pai. A nova função deve ter a mesma quantidade e tipo de parâmetros que a classe pai. Por exemplo, se a classe pai possuir dois argumentos, precisa garantir que a nova função também tenha dois argumentos. Se usar a dica de tipo nas suas definições de funções, os tipos de argumentos devem corresponder a da classe pai.
ru: Функция, которую вы пытаетесь определить, существует в родительском классе, поэтому ваше определение переопределяет функцию родительского класса. Когда вы переопределяете функцию родительского класса, новая функция должна соответствовать родительской. Новая функция должна иметь то же количество и тип параметров, что и родительский класс. Например, если родительский элемент имеет два аргумента, вам нужно, чтобы ваша новая функция также имела два аргумента. Если вы используете обозначения типов переменных в определениях функций, типы аргументов должны соответствовать родительскому классу.
sv: Funktionen du försöker definiera finns i en överordnad klass, så din definition åsidosätter den överordnade klassens funktion. När du åsidosätter en överordnad klasss funktion måste den nya funktionen matcha den överordnade. Den nya funktionen ska ha samma antal och typ av parametrar som den överordnade klassen. Till exempel, om föräldern har två argument, behöver du att din nya funktion också har två argument. Om du använder typtips i dina funktionsdefinitioner måste argumenttyperna matcha den överordnade klassen.
tr: Tanımlayama çalıştığın fonksiyon, ana sınıf içinde zaten tanımlı durumda, yani senin tanımlaman, ana sınıftaki fonksiyonun üzerine yazıyor. Ana sınıfın bir fonksiyonunun üzerine yazacaksan, yeni fonksiyonu ana sınıftaki ile eşdeğer olmalıdır. Yeni fonksiyonun paramatrelerinin sayısı ve tipleri, ana sınıfın fonksiyonu ile aynı olmalıdır. Örneğin, ana sınıfta iki tane girilen değer varsa, senin fonksiyonun da iki girilen değişken kullanmalıdır. Fonksiyon tanımında tip belirteçleri kullanıyorsan, girdi değişkenleri ana sınıftakilerle aynı tipte olmalıdır.

source: All the values in your code have a specific type. That type can be a whole number (int), a decimal number (float), text (String), and so on. There are tons of possible types, and you can even define your own! When you make any operation, the computer compares the types you are using. Some types are compatible, and some are not. For example, you cannot directly add a whole number to a text string. You first need to convert the number into text. You'll need to read the error message to see what is not matching because there are many possible cases.
fa: همه‌ی ارزش‌های درون کد شما دارای گونه‌ای ویژه‌اند. آن گونه می‌تواند یک شماره‌ی صحیح (int)، شماره‌ی اعشاری (float)، نوشتار (string) و... باشد. گونه‌های شدنی بسیاری هستند، حتا می‌توانید گونه‌های خودتان هم تعریف کنید! هنگامی که هرگونه عملیاتی را انجام می‌دهید، رایانه گونه‌هایی که به‌کار می‌برید را مقایسه می‌کند. برخی گونه‌ها سازگارند و برخی ناسازگار. برای نمونه، نمی‌توانید یک شماره‌ی صحیح را به یک رشته‌ی نوشتاری بیفزایید. نخست باید شماره را به نوشتار تبدیل کنید. باید برای دیدن چیزی که مطابقت ندارد پیام خطا را بخوانید، چون حالت‌های شدنی بسیاری هست.
pt: Todos os valores no seu código possuem um tipo específico. Esse tipo pode ser um número inteiro (int), um número decimal (float), um texto (string) e assim por diante. Há vários tipos possíveis e pode até mesmo definir os seus próprios tipos! Quando faz qualquer operação, o computador compara os tipos que usa. Alguns tipos são compatíveis e outros não. Por exemplo, não pode adicionar diretamente um número inteiro a uma cadeia de caractere (string). Precisa primeiro converter o número em texto. Vai precisar ler a mensagem de erro para ver o que não está compatível porque existe muitos casos possíveis.
ru: Все значения в вашем коде имеют определенный тип. Этот тип может быть целым числом (int), десятичной дробью (float), текстом (String) и так далее. Существует множество возможных типов, и вы можете даже определить свой собственный! Когда вы выполняете какую-либо операцию, компьютер сравнивает используемые вами типы. Некоторые типы совместимы, а некоторые — нет. Например, вы не можете напрямую добавить целое число в текстовую строку. Сначала вам нужно преобразовать число в текст. Вам нужно будет прочитать сообщение об ошибке, чтобы увидеть какие именно типы не соответствует друг другу, так как возможных случаев множество.
sv: Alla värden i din kod har en specifik typ. Den typen kan vara ett heltal (int), ett decimaltal (float), text (String) och så vidare. Det finns massor av möjliga typer, och du kan till och med definiera din egen! När du gör någon åtgärd jämför datorn de typer du använder. Vissa typer är kompatibla och andra inte. Du kan till exempel inte lägga till ett heltal direkt i en textsträng. Du måste först konvertera numret till text. Du måste läsa felmeddelandet för att se vad som inte matchar eftersom det finns många möjliga fall.
tr: Kodundaki bütün değerler, belirli bir tipe sahiptir. Bunlar bir tam sayı (int), bir ondalık sayı (float), bir dize (String), ve benzeri olabilirler. Mümkün olan tonlarca farklı tip var, ve hatta kendine ait bir tip tanımlayabilirsin. Bir işlem yaptığında, bilgisayar kullandığın bu tipleri karşılaştırır. Bazı tipler uyumludur, bazıları uyumsuz. Örnek olarak, bir tam sayı ile bir dizeyi doğrudan toplayamazsın. İlk önce sayıyı bir dizeye çevirmen gerekir. Bu konuda o kadar çok olasılık var ki, nelerin uyuşmadığını görmek için hata mesajını okuman gerekiyor.

source: If the error mentions the assigned value type not matching the variable, the problem is on the right side of the equal sign (=). If the error talks about the return type not matching the function, then it is the value after the return keyword that is problematic. If the computer talks about an invalid operand, then the issue is that the operation does not exist for the type you're trying to use. For example, while you can add two 2D vectors, you can't add a whole number or text to a 2D vector.
pt: Se o erro mencionar que o tipo do valor não é compatível com a variável, o problema está no lado direito do sinal de igual (=). Se o erro disser que o tipo de retorno não é compatível com a função, então é o valor depois da palavra-chave 'return' que causa o problema. Se o computador disser sobre um operador inválido, então o problema é que a operação para aquele tipo que tenta usar não existe. Por exemplo, pode somar dois vetores 2D, mas não pode somar um número inteiro ou um texto e um vetor 2D.
ru: Если в ошибке упоминается тип присваиваемого значения, не соответствующий переменной, проблема находится справа от знака равенства (=). Если ошибка говорит о том, что возвращаемый тип не соответствует функции, то проблема в значении после ключевого слова return. Если компьютер говорит о недопустимом операнде, то проблема в том, что операции не существует для типа, который вы пытаетесь использовать. Например, хотя вы и можете сложить два 2D-вектора, вы не можете прибавить целое число или текст к 2D-вектору.
sv: Om felet nämner att den tilldelade värdetypen inte matchar variabeln, finns problemet på höger sida om likhetstecknet (=). Om felet talar om att returtypen inte matchar funktionen så är det värdet efter returnyckelordet som är problematiskt. Om datorn talar om en ogiltig operand är problemet att operationen inte finns för den typ du försöker använda. Till exempel, medan du kan lägga till två 2D-vektorer, kan du inte lägga till ett heltal eller text till en 2D-vektor.
tr: Eğer hata, atamaya çalıştığın değerin, değişken ile uyuşmadığını söylüyorsa, sorun eşitlik (=) işaretinin sağ tarafındadır. Eğer hata, geri dönüş tipinin fonksiyon ile uyuşmadığını söylerse, bu durumda sorun "return" anahtar kelimesinden sonra yazılan değerdedir. Eğer bilgisayar, geçersiz bir işlenen (operand) var diyorsa, böyle bir işlemin kullanmaya çalıştığın tip için tanımlı olmadığı anlamındadır. Örneğin, iki tane 2D vektörü birbirine ekleyebilirken, bir 2D vektörü ile bir sayı ya da yazıyı toplayamazsın.

source: GDScript supports type inference. The computer will automatically recognize the type of value you are working with. In some cases, though, it can't figure it out. When that happens, you need to specify the type yourself or remove type inference altogether for this variable.
pt: GDScript suporta inferência de tipo. O computador vai reconhecer automaticamente o tipo de valor que usa. Porém, em alguns casos ele não vai conseguir descobrir o tipo. Quando isso acontecer, mesmo precisa especificar o tipo ou remover completamente a inferência de tipo para essa variável.
ru: GDScript поддерживает вывод типов. Компьютер автоматически распознает тип значения, с которым вы работаете. Однако в некоторых случаях он не может определить тип. Когда так произойдет, вам нужно указать тип самостоятельно или вообще удалить вывод типа для этой переменной.
sv: GDScript stöder typinferens. Datorn känner automatiskt igen vilken typ av värde du arbetar med. I vissa fall kan den dock inte räkna ut det. När det händer måste du specificera typen själv eller ta bort typinferens helt för denna variabel.
tr: GDScript, tip çıkarımı yapabilir. Bilgisayar, üzerinde çalıştığın değer tipini kendiliğinden tanıyabilir. Yine de bazı durumlarda bunu başaramaz. Bu olduğunda, ilgili tip tanımını kendin yapabilir veya bu değişken için tip çıkarımını tümüyle kaldırabilirsin.
