Repository: GDQuest/learn-gdscript-translations
Catalog: */glossary_database.po
Languages: fa, hu, ko, pl, sv

source: member function
fa: تابع عضو
hu: tagfüggvény
ko: 멤버 함수
pl: funkcja składowa
sv: medlemsfunktion

source: member functions
fa: تابع‌های عضو
hu: tagfüggvények
ko: 멤버 함수들
pl: funkcje składowe
sv: medlemsfunktioner

source: Member functions are functions attached to a specific value type, like arrays, strings, or dictionaries. We also call them methods.
fa: تابع‌های عضو تابع‌هایی‌اند که به یک گونهٔ ارزش معین پیوست خورده‌اند، مانند آرایه‌ها، رشته‌ها یا دیکشنری‌ها. به آنها روش یا مِتُد نیز گفته می‌شود.
sv: Medlemsfunktioner är funktioner kopplade till en specifik värdetyp, som arrayer, strängar eller ordböcker. Vi kallar dem också metoder.

source: For example, arrays have member functions like [code]array.append()[/code].
fa: برای نمونه، آرایه‌ها تابع‌های عضوی مانند [code]array.append()[/code] دارند.
sv: Till exempel har arrayer medlemsfunktioner som [code]array.append()[/code].

source: You can only call the function on an array, using the access operator ([code].[/code]) to access it, as shown above.
fa: تابع را تنها می‌توان روی آرایه‌ها و با به‌کارگیری عملگر دسترسی ([code].[/code]) برای دسترسی به آن، همانگونه که در بالا می‌بینید فراخواند.
sv: Du kan bara anropa funktionen på en array genom att använda åtkomstoperatören ([code].[/code]) för att komma åt den, som visas ovan.

source: member variable
fa: متغیر عضو
hu: tagváltozó
ko: 멤버 변수
pl: zmienna składowa
sv: medlemsvariabel

source: member variables
fa: متغیرهای عضو
hu: tagváltozók
ko: 멤버 변수들
pl: zmienne składowe
sv: medlemsvariabler

source: Member variables are variables attached to a specific value type, like a vector's [code]x[/code] and [code]y[/code] sub-variables. We also call them [i]properties[/i] or [i]fields[/i] of the vector.
fa: متغیرهای عضو متغیرهایی‌اند که به یک گونهٔ ارزش معین پیوست خورده‌اند، مانند زیرمتغیرهای [code]x[/code] و [code]y[/code] بردارها. به آنها [i]ویژگی[/i] یا [i]میدان[/i] بردار نیز گفته می‌شود.
sv: Medlemsvariabler är variabler kopplade till en specifik värdetyp, som en vektors [code]x[/code] och [code]y[/code] undervariabler. Vi kallar dem också för vektorns [i]egenskaper[/i] eller [i]fält[/i].

source: To access a member variable, you must first write the value's name followed by the access operator ([code].[/code]). For example, [code]position.x[/code].
fa: برای دسترسی به متغیرهای عضو، باید نخست نام ارزش را نوشته و آن را با عملگر دسترسی([code].[/code]) دنبال کنید. برای نمونه، [code]position.x[/code].
sv: För att komma åt en medlemsvariabel måste du först skriva värdets namn följt av åtkomstoperatören ([code].[/code]). Till exempel [code]position.x[/code].

source: parameter
fa: پارامتر
hu: paraméter
ko: 매개변수
pl: parametr

source: parameters
fa: پارامترها
hu: paraméterek
ko: 매개변수들
pl: parametry
sv: parametrar

source: A parameter is a variable you create as part of a function definition.
fa: پارامترها متغیری‌اند که آن را بعنوان پاره‌ای از تعریف تابع‌ها می‌سازید.
sv: En parameter är en variabel som du skapar som en del av en funktionsdefinition.

source: It allows you to reuse the function more by having values that vary in the function's body.
fa: به شما اجازه می‌دهند تا تابع را بخاطر داشتن ارزش‌هایی که در بدن تابع تفاوت دارند، چندین بار به کار ببرید.
sv: Det låter dig återanvända funktionen mer genom att ha värden som varierar i funktionens kropp.

source: radian
fa: رادیان
hu: radián
ko: 라디안

source: radians
fa: رادیان‌ها
hu: radián
ko: 라디안
pl: radiany
sv: radianer

source: A radian is a unit of measurement of angles based on the circle's circumference.
fa: رادیان یکای سنجش زاویه‌ها بر پایهٔ محیط دایره است.
sv: En radian är en måttenhet för vinklar baserad på cirkelns omkrets.

source: We tend to use degrees more in our daily lives, but in computer programming, and especially in games, radians are common.
fa: ما در زندگی روزانه بیشتر درجه را به کار می‌بریم، ولی در برنامه‌نویسی رایانه‌ای، به‌ویژه در بازی‌ها، رادیان‌ها رواج یافته‌اند.
sv: Vi tenderar att använda grader mer i vårt dagliga liv, men i datorprogrammering, och speciellt i spel, är radianer vanliga.

source: An angle of [code]2 * PI[/code] radians corresponds to 360 degrees. And an angle of [code]PI[/code] radians corresponds to 180 degrees.
fa: [code]2 * PI[/code] رادیان برابر با ۳۶۰ درجه و [code]PI[/code] رادیان برابر با ۱۸۰ درجه است.
sv: En vinkel på [code]2 * PI[/code] radianer motsvarar 360 grader. Och en vinkel på [code]PI[/code] radianer motsvarar 180 grader.

source: type
fa: گونه
hu: típus
ko: 유형
pl: typ
sv: typ

source: types
fa: گونه‌ها
hu: típusok
ko: 유형들
pl: typy
sv: typer

source: In computer programming, a type is the class of a value. For example, whole numbers like [code]3[/code], [code]11[/code], and [code]255462[/code] are all of type [code]int[/code] (short for integer).
fa: در برنامه‌نویسی رایانه‌ای،‌ گونه‌ها ردهٔ ارزش‌ها اند. برای نمونه،‌ شماره‌های صحیح مانند [code]3[/code]، [code]11[/code] و [code]255462[/code] همه از گونهٔ [code]int[/code] (کوتاه‌شدهٔ integer به معنای شمارهٔ صحیح) اند.
sv: I datorprogrammering är en typ klassen för ett värde. Till exempel är heltal som [code]3[/code], [code]11[/code] och [code]255462[/code] alla av typen [code]int[/code] (förkortning av heltal) .

source: The computer uses types to determine which operations are valid between two values and when they're undefined.
fa: رایانه گونه‌ها را به کار می‌گیرد تا مشخص کند کدام عملیات‌ها میان دو ارزش معتبر بوده و کدام‌ها تعریف‌نشده‌اند.
sv: Datorn använder typer för att avgöra vilka operationer som är giltiga mellan två värden och när de är odefinierade.

source: iteration
fa: تکرار
hu: iteráció
ko: 반복
pl: iteracja

source: iterations
fa: تکرارها
hu: iteráció
ko: 반복들
pl: iteracje
sv: iterationer

source: In computer code, an iteration is one repetition of some process or code. We typically use the term with loops, where one iteration is one run of the loop's code.
fa: در کدنویسی رایانه‌ای، تکرارها بازانجامش برخی فرایند‌ها یا کداند. بیشتر واژهٔ چرخه را به کار رفته می‌شود، که هر تکرار یک بار اجرای کد چرخه است.
sv: I datorkod är en iteration en upprepning av någon process eller kod. Vi använder vanligtvis termen med loopar, där en iteration är en körning av loopens kod.

source: When talking of algorithms, an iteration can mean a full pass of the algorithm on a data set.
fa: در پهنهٔ الگوریتم‌ها، تکرار می‌تواند معنای یک گذشت کامل الگوریتم روی دادگان را بدهد.
sv: När man pratar om algoritmer kan en iteration betyda en full passning av algoritmen på en datamängd.

source: vector
fa: بُردار
hu: vektor
ko: 벡터
pl: wektor
sv: vektor

source: vectors
fa: بُردارها
hu: vektorok
ko: 벡터들
pl: wektory
sv: vektorer

source: In math, a vector is a list of numbers. In games, we often use 2D and 3D vectors: respectively, lists of two and three numbers.
fa: در ریاضیات، بردارها فهرستی از شماره‌ها اند. در بازی‌ها، بیشتر زمان‌ها بردارهای دوبعدی و سه‌بعدی، به ترتیب، برای فهرست‌های دو و سه‌تایی شماره‌ها به کار می‌روند.
sv: I matematik är en vektor en lista med tal. I spel använder vi ofta 2D- och 3D-vektorer: listor med två respektive tre nummer.

source: We use that to represent a direction and magnitude or intensity in space. For example, you can use a vector to represent the direction and speed at which a character or a vehicle moves.
fa: ما این شماره‌ها را برای نمایاندن یک سو و بزرگی یا شدت در فضا به کار می‌بریم. برای نمونه، می‌توانید بُرداری را برای نمایاندن تندی و سویی که ترابَر یا شخصیتی به آن می‌رود به کار ببرید.
sv: Vi använder det för att representera en riktning och storlek eller intensitet i rymden. Du kan till exempel använda en vektor för att representera riktningen och hastigheten med vilken en karaktär eller ett fordon rör sig.

source: Vectors can seem daunting at first because they are pretty abstract, but as you will see, they'll simplify code tremendously.
fa: بردارها بخاطر انتزاعی بودنشان می‌توانند تا اندازه‌ای دلهره‌آور به نظر برسند، ولی همانگونه که خواهید دید، کد را بسیار ساده خواهند ساخت.
sv: Vektorer kan verka skrämmande till en början eftersom de är ganska abstrakta, men som du kommer att se kommer de att förenkla koden oerhört.

source: argument
fa: آرگومان
hu: argumentum
ko: 인수

source: arguments
fa: آرگومان‌ها
hu: argumentumok
ko: 인수들
pl: argumenty
sv: argument

source: array
fa: آرایه
hu: tömb
ko: 배열
pl: tablica

source: arrays
fa: آرایه‌ها
hu: tömbök
ko: 배열들
pl: tablice
sv: matriser

source: An array is a list of values. In GDScript, arrays can contain [i]any[/i] types of value.
fa: آرایه‌ها فهرستی از ارزش‌ها هستند. در جی.دی.اسکریپت، آرایه‌ها می‌توانند [i]هر[/i] گونه ارزش را درون خود داشته باشند.
sv: En array är en lista med värden. I GDScript kan arrayer innehålla [i]alla[/i] värdetyper.

source: To create an array, you write comma-separated values in square brackets: [code]var three_numbers = [1, 2, 3][/code]
fa: برای ساختن آرایه‌ها، ارزش‌های جداشده با کاما (ویرگول انگلیسی) را درون دو قلاب می‌نویسیم: [code]var three_numbers = [1, 2, 3][/code]
sv: För att skapa en array skriver du kommaseparerade värden inom hakparenteser: [code]var three_numbers = [1, 2, 3][/code]

source: In games, we use arrays all the time to store lists of characters in a party, lists of items in inventory, lists of spells the player unlocked, and so on. They're everywhere.
fa: در بازی‌ها، آرایه‌ها برای انبار کردن فهرست شخصیت‌های درون گروه، فهرست آیتم‌های درون اینوِنتوری، فهرست جادوهایی که بازیکن به دست آورده و... بسیار به کار می‌روند. آنها همه جا هستند.
sv: I spel använder vi arrayer hela tiden för att lagra listor över karaktärer i ett parti, listor över föremål i inventeringen, listor över besvärjelser som spelaren låst upp och så vidare. De finns överallt.

source: Arrays are a fundamental value type in computer programming. You'll find arrays in pretty much any programming language.
fa: آرایه‌ها گونهٔ ارزشی بنیادی در برنامه‌نویسی رایانه‌ای هستند. آرایه‌ها را در هر زبان برنامه‌نویسی‌ای خواهید یافت.
sv: Arrayer är en grundläggande värdetyp i datorprogrammering. Du hittar arrayer i nästan alla programmeringsspråk.

source: assign
fa: واگذاری
hu: hozzárendelés
ko: 할당
pl: przypisanie
sv: tilldela

source: Assigning a value to a variable means that you store a value inside the variable. You do this with the equal sign ([code]=[/code]).
fa: واگذاری یک ارزش به یک متغیر یعنی ارزشی را درون آن متغیر انبار می‌کنید. این کار را با نشانهٔ برابر ([code]=[/code]) می‌کنیم.
hu: Az érték hozzárendelése egy változóhoz azt jelent, hogy abban a változóban tárolod az értéket. Ezt az [code]=[/code] jellel lehet megtenni.
ko: 변수에 값을 할당한다는 것은 변수 안에 값을 저장한다는 의미입니다. 등호([code]=[/code])를 사용하여 이 작업을 수행합니다.
pl: Przypisanie wartości do zmiennej oznacza, że do wnętrza zmiennej [i]wkładasz[/i] daną wartość. Robisz to wykorzystując znak równości ([code]=[/code]).
sv: Att tilldela ett värde till en variabel innebär att du lagrar ett värde inuti variabeln. Detta gör du med likhetstecknet ([code]=[/code]).

source: dictionary
fa: دیکشنری
hu: könyvtár
ko: 사전형
pl: słownik (dictionary)
sv: ordbok(dictionary)

source: dictionaries
fa: دیکشنری‌ها
hu: könyvtárak
ko: 사전형들
pl: słowniki (dictionaries)
sv: ordböcker

source: A dictionary is a data structure that maps values with key-value pairs. When you give the dictionary a key, it finds and gives you back the corresponding value.
fa: دیکشنری‌ها ساختار داده‌ای هستند که ارزش‌ها را با کلیدها جفت می‌کنند. هنگامی که به دیکشنری‌ای کلیدی بدهید، ارزش جفتیده با آن کلید را می‌یابد و می‌دهد.
sv: En ordbok är en datastruktur som mappar värden med nyckel-värdepar. När du ger ordboken en nyckel hittar den och ger dig tillbaka motsvarande värde.

source: In GDScript, keys can be many things. We often use text strings or numbers, but you're not limited to that. A [code]Vector2[/code] can also be a valid key, which is handy to map a grid cell to a unit or an item in a grid-based game.
fa: در جی.دی.اسکریپت، کلیدها می‌توانند چیزهای بسیاری باشند. ما بیشتر زمان‌ها رشته‌های نوشتاری یا شماره‌ها را به کار می‌بریم، ولی به آن محدود نیستید.[code]Vector2[/code]ها هم می‌توانند کلید معتبری باشند، که هنگام نهادن یاخته‌های توری در یک یگان یا آیتم در بازی‌های توری‌بنیاد پرکاربرد هستند.
sv: I GDScript kan nycklar vara många saker. Vi använder ofta textsträngar eller siffror, men du är inte begränsad till det. En [code]Vector2[/code] kan också vara en giltig nyckel, vilket är praktiskt för att mappa en rutnätscell till en enhet eller ett objekt i ett rutnätsbaserat spel.

source: You will often use dictionaries to associate bits of data in your games. For example, we could use them to associate an equipment's name with its weapon stats in a database.
fa: دیکشنری‌ها را برای پیوند دادن تکه‌های داده درون بازی‌هایتان بسیار به کار خواهید برد. برای نمونه، می‌توانیم آنها را برای پیوند دادن نام شمشیری به آمارهایش در یک دادگان به کار ببریم.
sv: Du kommer ofta att använda ordböcker för att associera bitar av data i dina spel. Till exempel kan vi använda dem för att associera en utrustnings namn med dess vapenstatistik i en databas.

source: Like arrays, they are a fundamental data type that you will see in many programming languages and use a lot.
fa: مانند آرایه‌ها، گونهٔ داده‌ای بنیادی‌اند که آنها را در زبان‌های برنامه‌نویسی بسیاری خواهید دید و به کار خواهید برد.
sv: Liksom arrayer är de en grundläggande datatyp som du kommer att se i många programmeringsspråk och använda mycket.

source: for loop
fa: چرخهٔ for
hu: for ciklus
ko: for loop 반복
pl: pętla for

source: for loops
fa: چرخه‌های for
hu: for ciklusok
ko: for loops 반복
pl: pętle for
sv: for loopar

source: A for loop instructs the computer to repeat a set of instructions once for each value in an array.
fa: چرخه‌های for یا «چرخه‌های برایِ» به رایانه می‌گویند که دسته‌ای از فرمان‌ها را یک بار برای هر ارزش درون یک آرایه تکرار کند.
sv: En for-loop instruerar datorn att upprepa en uppsättning instruktioner en gång för varje värde i en array.

source: In each loop iteration, the compiler extracts one value from the array and gives you access to it in the loop's body.
fa: در هر تکرار چرخه، کامپایلر یک ارزش را از آرایه استخراج کرده و به شما در بدن چرخه به آن دسترسی می‌دهد.
sv: I varje loopiteration extraherar kompilatorn ett värde från arrayen och ger dig tillgång till det i loopens kropp.

source: For loops run code a limited amount of times: one per value in the array. It is different from while loops that keep repeating code until a condition is met.
fa: چرخه‌های برایِ بارهای محدودی کد را اجرا می‌کنند: یک بار برای هر ارزش درون آرایه. با چرخه‌های while یا هنگامی‌که، که کد را تا زمانی که شرطی برقرار باشد اجرا می‌کنند، متفاوت‌اند.
sv: För loopar kör kod ett begränsat antal gånger: en per värde i arrayen. Det skiljer sig från while-loopar som fortsätter att upprepa koden tills ett villkor är uppfyllt.

source: We recommend favoring for loops when you can. They're safer and easier to use than while loops.
fa: تا جایی که برای‌تان شدنی‌ست ما چرخه‌های برایِ را پیشنهاد می‌کنیم. به‌کارگیری آنها از چرخه‌های هنگامی‌که آسان‌تر و امن‌تر است.
sv: Vi rekommenderar att favorisera för loopar när du kan. De är säkrare och enklare att använda än while-slingor.

source: function
fa: تابع
hu: függvény
ko: 함수
pl: funkcja
sv: funktion

source: functions
fa: تابع‌ها
hu: függvények
ko: 함수들
pl: funkcje
sv: funktioner

source: A function is a group of code instructions you give a name. When you define a function, you can call it any time to run all the instructions it contains.
fa: تابع‌ها گروهی از فرمان‌های کدی هستند که به آن نامی می‌دهید. هنگامی که تابعی را تعریف می‌کنید، می‌توانید هر زمانی که می‌خواهید برای اجرا کردن همهٔ فرمان‌هایی که در خود دارد آن را فراخوانید.
sv: En funktion är en grupp kodinstruktioner som du ger ett namn. När du definierar en funktion kan du anropa den när som helst för att köra alla instruktioner som den innehåller.

source: You can modify a function's behavior with parameters. Parameters are variable names that you write in the function definition. You can then use them in the function's body to make your code adapt to different cases.
fa: می‌توانید رفتار تابع‌ها را با پارامترها دگرگون کنید. پارامترها نام متغیرهایی‌اند که آنها را در تعریف تابع‌ها می‌نویسید. می‌توانید آنها را درون بدن تابع به کار ببرید تا کدتان بسته به موقعیت‌های گوناگون سازوار شود.
sv: Du kan ändra en funktions beteende med parametrar. Parametrar är variabelnamn som du skriver i funktionsdefinitionen. Du kan sedan använda dem i funktionens body för att få din kod att anpassa sig till olika fall.

source: Also, functions can optionally return a value to the code calling it.
fa: همچنین، تابع‌ها می‌توانند ارزشی را به کدی که آن را فراخوانده است بهینه‌وار برگردانند.
sv: Funktioner kan också valfritt returnera ett värde till koden som anropar det.

source: increment
fa: فزایش
hu: növekedés
ko: 증가
pl: inkrementacja
sv: ökning

source: increments
fa: فزایش‌ها
hu: növekedések
ko: 증분
pl: inkrementacje
sv: steg

source: An increment is the amount by which a value changes in your code.
fa: فزایش‌ها مقداری‌اند که بر پایهٔ آنها ارزشی درون کدتان دگرگون می‌شود.
hu: A növekedés az az érték, amellyel változik az érték a kódban.
ko: 증분은 코드에서 값이 변경되는 양입니다.
pl: Inkrementacja (przyrost) to wielkość, o którą zmienia się dana wartość w kodzie.
sv: Ett inkrement är det belopp med vilket ett värde ändras i din kod.

source: instruction
fa: دستورالعمل
hu: művelet
ko: 지침
pl: instrukcja
sv: instruktion

source: instructions
fa: دستورالعمل‌ها
hu: utasítások
ko: 지침
pl: instrukcje
sv: instruktioner

source: In computer programming, instructions are a single operation the computer recognizes and can execute.
fa: در برنامه‌نویسی رایانه‌ای، دستورالعمل‌ها یک عملیات هستند که رایانه آنها را تشخیص داده و می‌تواند اجرا کند.
sv: I datorprogrammering är instruktioner en enda operation som datorn känner igen och kan utföra.

source: For example, a function call, an addition, or assigning a value to a variable.
fa: برای نمونه، فراخوانی تابع، جمع یا واگذاری ارزشی در متغیر گونه‌ای دستورالعمل است.
sv: Till exempel ett funktionsanrop, ett tillägg eller tilldelning av ett värde till en variabel.

source: variable
fa: متغیر
hu: változó
ko: 변수
pl: zmienna
sv: variabel

source: variables
fa: متغیرها
hu: változók
ko: 변수들
pl: zmienne
sv: variabler

source: Variables are a tool to give a name to values you want to store in your code and change over time.
fa: متغیرها ابزاری هستند که می‌گذارند به ارزش‌ها و مقدارهایی که می‌خواهید در کُدتان ذخیره کرده و در طول زمان تغییر دهید نام بدهید.
sv: Variabler är ett verktyg för att ge ett namn till värden du vill lagra i din kod och ändra över tiden.

source: For example, a character's health: when the character takes a hit, you want it to go down. When healing, you want the health to go back up.
fa: برای نمونه، جان شخصیت: هنگامی که شخصیت ضربه می‌خورد می‌خواهید که به ارزش کمتری تبدیل شود. هنگام درمان شدن، می‌خواهید که جان به ارزش پیشین خود برگردد.
sv: Till exempel en karaktärs hälsa: när karaktären får en träff vill du att den ska gå ner. När man läker vill man att hälsan ska gå upp igen.

source: You can create a variable named [code]health[/code] to represent the health.
fa: می‌توانید متغیری با نام [code]health[/code] بسازید تا جان شخصیت را نمایش دهد.
sv: Du kan skapa en variabel som heter [code]health[/code] för att representera hälsan.

source: Then, every time you write the keyword [code]health[/code] in your code, the computer will fetch the corresponding value in its memory for you.
fa: سپس، هربار که کلیدواژهٔ [code]health[/code] را در کدتان بنویسید، رایانه ارزش مربوط در حافظهٔ خود را برایتان خواهد آورد.
sv: Sedan, varje gång du skriver nyckelordet [code]health[/code] i din kod, kommer datorn att hämta motsvarande värde i sitt minne åt dig.

source: Variables work a bit like product labels in a supermarket. They are names that you attach to some value. Any time, you can take the label and stick it onto a new product or, in that case, a new value.
fa: متغیرها کمی مانند برچسب کالاها در سوپرمارکت‌ها کار می‌کنند. نام‌هایی هستند که به آنها ارزشی پیوست می‌دهید. هر زمانی که بخواهید می‌توانید برچسب را کنده و به کالای دیگری بچسبانید، یا در این زمینه، ارزش و مقداری نو به آن دهید.
sv: Variabler fungerar lite som produktetiketter i en stormarknad. Det är namn som man tillmäter något värde. Du kan när som helst ta etiketten och fästa den på en ny produkt eller i så fall ett nytt värde.

source: while loop
fa: چرخهٔ while
hu: while ciklus
ko: while loop 반복
pl: pętla while

source: while loops
fa: چرخه‌های while
hu: while ciklusok
ko: while loops 반복
pl: pętle while
sv: while loopar

source: A while loop instructs the computer to keep running code based on a condition. While the condition is true, the loop keeps running.
fa: چرخهٔ while یا چرخهٔ هنگامی‌که به رایانه دستور می‌دهد تا کد را بر پایهٔ یک شرط، ادامه‌وار اجرا کند. هنگامی که شرط درست (true) باشد چرخه به اجرای خود ادامه خواهد داد.
sv: En while-loop instruerar datorn att fortsätta köra kod baserat på ett tillstånd. Medan villkoret är sant, fortsätter slingan att köras.

source: When coding while loops, you must be careful: they will keep running infinitely and freeze your game if you get the condition wrong.
fa: هنگام کدنویسی چرخه‌های هنگامی‌که باید مواظب باشید: اگر شرط را به‌نادرستی دریافت کنید بی‌محدودیت اجرا شده و باعث یخ‌زدگی بازی‌تان خواهند شد.
sv: När du kodar while-loopar måste du vara försiktig: de fortsätter att köras i det oändliga och fryser ditt spel om du får fel tillstånd.

source: That's why we recommend using the safer for loop whenever you can.
fa: از این روی، پیشنهاد می‌کنیم هر زمان که می‌توانید از چرخهٔ امن‌تر for یا همان «چرخهٔ برایِ» بهره ببرید.
sv: Det är därför vi rekommenderar att du använder safer for loop när du kan.

source: However, there are still essential cases in which we use while loops, like processing files, processing computer code, or for powerful algorithms.
fa: با این همه، هنوز موردهای ضروری و بایسته‌ای هستند که چرخه‌های هنگامی‌که را به کار می‌بریم. مانند پردازش پرونده‌ها، پردازش کد رایانه یا الگوریتم‌های توانمند.
sv: Men det finns fortfarande viktiga fall där vi använder while-loopar, som att bearbeta filer, bearbeta datorkod eller för kraftfulla algoritmer.

source: body
fa: بدنه
hu: törzs
ko: 바디
pl: ciało
sv: kropp

source: We talk about a loop or a function's body to refer to the lines of code that are part of the loop or function.
fa: چنانچه دربارهٔ بدنهٔ چرخه یا تابعی بگوییم، منظور خط‌های کدی‌ست که بخشی از چرخه یا تابع هستند.
hu: Ciklus-, vagy függvénytörzsről akkor beszélünk, ha az azokat alkotó kódsorokról van szó.
ko: 우리는 루프나 함수의 일부인 코드 라인을 참조하기 위해 루프나 함수의 본문에 대해 이야기합니다.
pl: Mówiąc o pętli lub ciele funkcji odnosimy się do wierszy kodu, które są częścią danej pętli lub funkcji (jej treścią).
sv: Vi talar om en loop eller en funktions kropp för att hänvisa till de kodrader som är en del av loopen eller funktionen.

source: return
fa: برگشت
hu: visszatérés
ko: 리턴
pl: zwróć (return)
sv: returnera

source: Returning a value is the process of sending a value to the place where you call a function.
fa: برگرداندن ارزش فرایندی‌ست که در آن ارزش به جایی که در آن تابعی را فرامی‌خوانید فرستاده می‌شود.
sv: Att returnera ett värde är processen att skicka ett värde till den plats där du anropar en funktion.

source: It happens when a function uses the [code]return[/code] keyword followed by a value, for example: [code]return -1[/code].
fa: هنگامی رخ می‌دهد که تابعی کلیدواژهٔ [code]return[/code] را به کار ببرد و در ادامه‌اش یک ارزش یا مقدار بگذارد. برای نمونه: [code]return -1[/code].
sv: Det händer när en funktion använder nyckelordet [code]return[/code] följt av ett värde, till exempel: [code]return -1[/code].

source: library
fa: کتابخانه
hu: könyvtár
ko: 라이브러리
pl: biblioteka
sv: bibliotek

source: libraries
fa: کتابخانه‌ها
hu: könyvtárak
ko: 라이브러리즈
pl: biblioteki
sv: bibliotek
