Repository: GDQuest/learn-gdscript-translations
Catalog: */glossary_database.po
Languages: fa, hu, ko, pl, sv

source: A collection of valuable and reusable code bundled together by other programmers to save you time. All programmers use code libraries.
fa: مجموعه‌ای از کدهای ارزشمند و چندبارمصرف که در کنار هم به دست دیگر برنامه‌نویسان جمع شده تا در زمان شما صرفه‌جویی شود. همهٔ برنامه‌نویسان از کتابخانه‌ها بهره می‌برند.
hu: Értékes és többször használható kódgyűjtemények, melyeket más programozók gyúrtak egybe, hogy neked időt takarítsanak meg. Minden programozó használ könyvtárakat.
ko: 시간을 절약하기 위해 다른 프로그래머가 함께 묶은 가치 있고 재사용 가능한 코드 모음입니다. 모든 프로그래머는 코드 라이브러리를 사용합니다.
pl: Zbiór cennego kodu wielokrotnego użytku stworzonego wspólnymi siłami przez innych programistów w celu zaoszczędzenia twojego czasu. Wszyscy programiści używają bibliotek.
sv: En samling värdefull och återanvändbar kod som buntas ihop av andra programmerare för att spara tid. Alla programmerare använder kodbibliotek.

source: sprite
fa: اسپرایت
ko: 스프라이트
sv: sprite(bild)

source: sprites
fa: اسپرایت‌ها
hu: sprite-ok
ko: 스프라이츠
pl: sprite'y
sv: sprites(bilder)

source: In computer graphics, a sprite is an image you display on the screen. We generally use this word to talk about moving images, like a character, a monster, or an item falling on the ground.
fa: در گرافیک رایانه‌ای، اسپرایت تصویری‌ست که روی صفحه نمایش داده می‌شود. ما بیشتر از این واژه برای حرف زدن دربارهٔ تصویرهای در حال جنبش بهره می‌بریم. مانند شخصیت‌ها، هیولاه یا آیتمی که دارد روی زمین می‌افتد.
hu: A számítógépes grafikában a sprite egy kép, amit megjelenítesz a képernyőn. Általában olyan képekre használjuk, amik mozognak, például egy karakter, egy szörny vagy egy tárgy, ami leeseik a földre.
ko: 컴퓨터 그래픽에서 스프라이트는 화면에 표시하는 이미지입니다. 우리는 일반적으로 이 단어를 캐릭터, 괴물 또는 땅에 떨어지는 물건과 같은 움직이는 이미지에 대해 이야기할 때 사용합니다.
pl: W grafice komputerowej sprite jest to obraz, który wyświetlasz na ekranie. Zwykle używamy tego słowa, gdy mówimy o ruchomych obrazach, takich jak postacie, potwory lub przedmioty spadające na ziemię.
sv: I datorgrafik är en sprite en bild du visar på skärmen. Vi använder vanligtvis detta ord för att prata om rörliga bilder, som en karaktär, ett monster eller ett föremål som faller på marken.

source: Member functions are functions attached to a specific value type, like arrays, strings, or dictionaries. We also call them methods. For example, arrays have member functions like [code]array.append()[/code]. You can only call the function on an array, using the access operator ([code].[/code]) to access it, as shown above.
hu: A tagfüggvény olyan függvény, ami egy specifikus változó típushoz van kötve, például tömb, string, vagy könyvtár. Metódusnak is hívják. Példa egy tömb tagfüggvényre: [code]array.append()[/code]. Csak akkor lehet hívni a függvényt a tömbön, ha [code].[/code]-tal hozzákapcsoljuk, ahogy fent is látható.
ko: 멤버 함수는 배열, 문자열 또는 사전과 같은 특정 값 유형에 연결된 함수입니다. 우리는 그것들을 메소드라고 부르기도 합니다. 예를 들어, 배열에는 [code]array.append()[/code]와 같은 멤버 함수가 있습니다. 위에 표시된 것처럼 액세스 연산자([code].[/code])를 사용하여 배열에 대한 함수만 호출하여 액세스할 수 있습니다.
pl: Funkcje składowe są to funkcje dołączone do określonego typu wartości, jak tablice, ciągi lub słowniki. Nazywamy je również metodami. Przykładowo tablice mają funkcje składowe, takie jak [code]array.append()[/code]. Funkcje można wywołać tylko w tablicy, używając operatora dostępu ([code].[/code]), aby uzyskać do nich dostęp tak, jak to pokazano powyżej.

source: Member variables are variables attached to a specific value type, like a vector's [code]x[/code] and [code]y[/code] sub-variables. We also call them [i]properties[/i] or [i]fields[/i] of the vector. To access a member variable, you must first write the value's name followed by the access operator ([code].[/code]). For example, [code]position.x[/code].
hu: A tagváltozó olyan változó, ami egy adott változó típushoz van kötve, mint például a vektor [code]x[/code] és [code]y[/code] részváltozói. A vektor [i]tulajdonságainak[/i] vagy [i]mezőinek[/i] is hívjuk őket. Ahhoz, hogy elérd a tagváltozókat, először ki kell írni a változót nevét, majd egy [code].[/code]-ot. Például: [code]position.x[/code].
ko: 멤버 변수는 벡터의 [code]x[/code] 및 [code]y[/code] 하위 변수와 같은 특정 값 유형에 연결된 변수입니다. 벡터의 [i]속성[/i] 또는 [i]필드[/i]라고도 합니다. 멤버 변수에 액세스하려면 먼저 값의 이름과 액세스 연산자([code].[/code])를 차례로 작성해야 합니다. 예: [code]position.x[/code].
pl: Zmienne składowe to zmienne dołączone do określonego typu wartości, takie jak podzmienne wektora [code]x[/code] i [code]y[/code] . Nazywamy je również [i]właściwościami[/i] lub [i]polami[/i] wektora. Aby uzyskać dostęp do zmiennej składowej, należy najpierw wpisać nazwę wartości, po której następuje operator dostępu ([code].[/code]). Przykładowo: [code]position.x[/code].

source: A parameter is a variable you create as part of a function definition. It allows you to reuse the function more by having values that vary in the function's body.
hu: A paraméter egy olyan változó, amit függvény deklarálásakor hozol létre. Ez lehetővé teszi, hogy többször is felhasználd a függvényt, azoknak változóknak köszönhetően, melyeknek az értéke változhat a függvénytörzsben.
ko: 파라미터는 함수 정의의 일부로 생성하는 변수입니다. 함수 본문에서 다양한 값을 가짐으로써 함수를 더 많이 재사용할 수 있습니다.
pl: Parametr to zmienna, którą tworzysz jako część definicji funkcji. Pozwala ona na częstsze ponowne wykorzystanie tej samej funkcji dzięki podawaniu wartościom, które zmieniają się wewnątrz funkcji.

source: A radian is a unit of measurement of angles based on the circle's circumference. We tend to use degrees more in our daily lives, but in computer programming, and especially in games, radians are common. An angle of [code]2 * PI[/code] radians corresponds to 360 degrees. And an angle of [code]PI[/code] radians corresponds to 180 degrees.
hu: A radián egy mértékegység a szögeg mérésére, ami a kör kerületét veszi alapul. A hétköznapi életben általában fokot használunk, de a programozásban, és különösen a játék programozásban, a radián elég gyakori. A radián [code]2 * PI[/code] az 360 fok. A [code]PI[/code] pedig 180 foknak felel meg.
ko: 라디안은 원의 둘레를 기준으로 한 각도 측정 단위입니다. 우리는 일상 생활에서 도를 더 많이 사용하는 경향이 있지만 컴퓨터 프로그래밍, 특히 게임에서는 라디안이 일반적입니다. [code]2 * PI[/code] 라디안의 각도는 360도에 해당합니다. 그리고 [code]PI[/code] 라디안의 각도는 180도에 해당합니다.
pl: Radian to jednostka miary kątów oparta na obwodzie koła. W codziennym życiu do mierzenia kątów częściej używamy stopni, jednak w programowaniu komputerowym, a zwłaszcza w grach, to właśnie radiany są powszechnie wykorzystywane. Kąt [code]2 * PI[/code] radianów odpowiada 360 stopniom. Kąt [code]PI[/code] radianów odpowiada 180 stopniom.

source: In computer programming, a type is the class of a value. For example, whole numbers like [code]3[/code], [code]11[/code], and [code]255462[/code] are all of type [code]int[/code] (short for integer). The computer uses types to determine which operations are valid between two values and when they're undefined.
hu: A programozásban a típus az egy változónak a fajtája. például, az egész számok, mint a [code]3[/code], [code]11[/code], és [code]255462[/code] mind [code]int[/code] (vagy integer) típusúak. A számítógép a típusokat használja, hogy eldöntse milyen műveleteket hajthat végre két változó közt és azok mikor értelmezhetetlenek.
ko: 컴퓨터 프로그래밍에서 타입은 값의 클래스입니다. 예를 들어 [code]3[/code], [code]11[/code] 및 [code]255462[/code]와 같은 정수는 모두 [code]int[/code] 타입입니다(정수 약어). . 컴퓨터는 유형을 사용하여 두 값 간에 유효한 작업과 정의되지 않은 경우를 결정합니다.
pl: W programowaniu komputerowym typ jest klasą wartości. Na przykład liczby całkowite, takie jak [code]3[/code], [code]11[/code], czy [code]255462[/code] odpowiadają typowi [code]int[/code] (to skrót od integer, co w języku angielskim oznacza liczbę całkowitą). Komputer używa typów do określenia, które z operacji są prawidłowe pomiędzy dwiema wartościami i kiedy są niezdefiniowane.

source: In computer code, an iteration is one repetition of some process or code. We typically use the term with loops, where one iteration is one run of the loop's code. When talking of algorithms, an iteration can mean a full pass of the algorithm on a data set.
hu: A programozásban az iteráció, egy adott folyamatnak vagy kódnak az egyszeri végrehajtása. Általában ciklusoknál használjuk, ahol egy iteráció, a ciklus kódjának egyszeri lefutását jelenti. Ha algoritmusokról beszélünk, akkor az iteráció jelentheti az algoritmus teljes lefutását az adathalmazon.
ko: 컴퓨터 코드에서 반복은 일부 프로세스 또는 코드의 1회 반복입니다. 우리는 일반적으로 루프와 함께 용어를 사용합니다. 여기서 한 번의 반복은 루프의 코드를 한 번 실행하는 것입니다. 알고리즘에 대해 이야기할 때 반복은 데이터 세트에 대한 알고리즘의 전체 패스를 의미할 수 있습니다.
pl: W kodzie komputerowym iteracja jest jednym powtórzeniem jakiegoś procesu lub kodu. Tego terminu używamy zazwyczaj z pętlami, gdzie jedna iteracja jest jednym przejściem kodu znajdującego się wewnątrz pętli. Mówiąc o algorytmach, iteracja może oznaczać pełne przejście algorytmu po zbiorze danych.

source: In math, a vector is a list of numbers. In games, we often use 2D and 3D vectors: respectively, lists of two and three numbers. We use that to represent a direction and magnitude or intensity in space. For example, you can use a vector to represent the direction and speed at which a character or a vehicle moves. Vectors can seem daunting at first because they are pretty abstract, but as you will see, they'll simplify code tremendously.
hu: A matematikában a vektor egy számokból álló lista. Játékokban gyakran használunk 2 vagy 3 dimenzós vektorokat: ezek 2 vagy 3 számos listákat jelentenek Arra használjuk, hogy irányt és méretet adjunk meg, vagy intenzitást a térben. Például használhatod a vektorokat arra, hogy megadd egy karakter vagy jármű irányát és sebességét. A vektorok talán bonyolultnak tűnnek elsőre, mert elég absztraktak, de amint látni fogod, jelentősen leegyszerűsítik a kódot.
ko: 수학에서 벡터는 숫자 목록입니다. 게임에서 우리는 종종 2D 및 3D 벡터를 사용합니다. 각각 두 개와 세 개의 숫자 목록입니다. 우리는 그것을 사용하여 공간의 방향과 크기 또는 강도를 나타냅니다. 예를 들어 벡터를 사용하여 캐릭터나 차량이 이동하는 방향과 속도를 나타낼 수 있습니다. 벡터는 매우 추상적이기 때문에 처음에는 위압적으로 보일 수 있지만, 보시다시피 코드를 엄청나게 단순화할 것입니다.
pl: W matematyce wektory są listą liczb. W grach często używamy wektorów 2D i 3D: odpowiednio one listom dwu- i trzyliczbowym. Liczb tych używamy tego do reprezentowania kierunku i wielkości lub intensywności w przestrzeni. Dla przykładu: możesz użyć wektora do reprezentowania kierunku i prędkości, z jaką porusza się postać lub pojazd. Wektory mogą początkowo wydawać się dość skomplikowaną jednostką, ponieważ są dość abstrakcyjne, jednak szybko zobaczysz, że znacznie uproszczają kod.

source: An argument is a value that you pass to a function when calling the function. For example, in the call [code]rotate(0.5)[/code], the value [code]0.5[/code] in the parentheses is an argument. A function can receive no arguments, one argument, or multiple arguments. Arguments can be mandatory or optional. When a function takes multiple arguments, you separate the values with commas, like in this function call: [code]jump(50, 100)[/code] When [i]calling[/i] a function, we name the values passed in parentheses [i]arguments[/i]. When writing a function definition, however, we talk about function [i]parameters[/i]. In the following example, the names [code]x[/code] and [code]y[/code] are [i]parameters[/i].
hu: Az argumentum egy olyan változó, amit a függvénynek adsz át, amikor hívod azt. Például, a [code]rotate(0.5)[/code] függvényben, a [code]0.5[/code] az argumentum. Egy függvénynek lehet 0, 1 vagy több argumentuma is. Az argumentum lehet kötelező, vagy opcionális. Ha egy függvény több argumentumot is fogad, akkor az értékeket ","-vel választjuk el, ahogy itt is látható: [code]jump(50, 100)[/code] Amikor [i]hívjuk[/i] a függvényt, a zárójelben lévő értékeket [i]argumentumnak[/i] nevezzük. Azonban amikor definiáljuk azt, akkor függvény [i]paraméterekről[/i] beszélünk. A következő példában az [code]x[/code] és [code]y[/code] egy-egy [i]paraméter[/i].

source: An array is a list of values. In GDScript, arrays can contain [i]any[/i] types of value. To create an array, you write comma-separated values in square brackets: [code]var three_numbers = [1, 2, 3][/code] In games, we use arrays all the time to store lists of characters in a party, lists of items in inventory, lists of spells the player unlocked, and so on. They're everywhere. Arrays are a fundamental value type in computer programming. You'll find arrays in pretty much any programming language.
hu: A tömb egy változókat tartalmazó lista. A GDScriptben [i]bármilyen[/i] típusú értéket tartalmazhatnak. Tömb létrehozásához, az adatokat szögletes zárójelben add meg, ","-vel elválasztva: [code]var three_numbers = [1, 2, 3][/code] A játékokban állandóan használjuk a tömböket: karakterek egy csapatban, tárgyak az eszköztáradban, feloldott varázslatok, stb. Mindenhol ott vannak. A tömbök alapvető fontosságúak a programozásban. Gyakorlatilag minden programnyelvben találkozhatsz velük.
ko: 배열은 값의 목록입니다. GDScript에서 배열은 [i]모든[/i] 유형의 값을 포함할 수 있습니다. 배열을 생성하려면 대괄호 안에 쉼표로 구분된 값을 작성합니다. [code]var three_numbers = [1, 2, 3][/code] 게임에서 우리는 항상 배열을 사용하여 파티의 캐릭터 목록, 인벤토리의 항목 목록, 플레이어가 잠금 해제한 주문 목록 등을 저장합니다. 그들은 어디에나 있습니다. 배열은 컴퓨터 프로그래밍의 기본 값 유형입니다. 거의 모든 프로그래밍 언어에서 배열을 찾을 수 있습니다.
pl: Tablica jest to lista wartości. W języku GDScript tablice mogą zawierać [i]dowolne[/i] typy wartości. Aby utworzyć tablicę, wpisujesz wartości oddzielone przecinkami w nawiasach kwadratowych: : [code]var three_numbers = [1, 2, 3][/code] W grach przez cały czas używamy tablic do przechowywania listy postaci w drużynie, listy przedmiotów w ekwipunku, listy zaklęć odblokowanych przez gracza i tak dalej. Są wszędzie. Tablice są podstawowym typem wartości w programowaniu komputerowym. Znajdziesz je w prawie każdym języku programowania.

source: A dictionary is a data structure that maps values with key-value pairs. When you give the dictionary a key, it finds and gives you back the corresponding value. In GDScript, keys can be many things. We often use text strings or numbers, but you're not limited to that. A [code]Vector2[/code] can also be a valid key, which is handy to map a grid cell to a unit or an item in a grid-based game. You will often use dictionaries to associate bits of data in your games. For example, we could use them to associate an equipment's name with its weapon stats in a database. Like arrays, they are a fundamental data type that you will see in many programming languages and use a lot.
hu: A könyvtár egy olyan adatstruktúra, ami az értékeket, kulcs-érték párokká alakítja. Ha megadsz aegy kulcsot a könyvtárban, az a hozzá tartozó értéket fogja visszaadni. A GDScriptben sokféle kulcs lehet. Leggyajrabban szavakat vagy számokat használunk, de nem kell ehhez ragaszkodni. Egy [code]Vector2[/code] is lehet érvényes kulcs, ami jól jön, ha egy mezőt kell egy egységhez vagy egy tárgyhoz rendelni, egy mezőkre osztott játékban. Gyakran használhatsz könyvtárakat, hogy összekapcsolj adatokat a játékodban. Például, használhatjuk arra, hogy összekapcsoljuk egy fegyver nevét, a hozzá tartozó értékekkel. A tömbökhöz hasonlóan, ezek is alapvető adat típusok, amelyekkel a legtöbb programnyelvben találkozhatsz, és gyakran fogsz használni.
ko: 사전형은 값을 키-값 쌍으로 매핑하는 데이터 구조입니다. 사전형에 키를 제공하면 해당 값을 찾아 다시 제공합니다. GDScript에서 키는 여러 가지가 될 수 있습니다. 우리는 종종 텍스트 문자열이나 숫자를 사용하지만 이에 국한되지 않습니다. [code]Vector2[/code]는 그리드 셀을 그리드 기반 게임의 유닛이나 항목에 매핑하는 데 편리한 유효한 키일 수도 있습니다. 게임에서 데이터 비트를 연결하기 위해 사전을 자주 사용합니다. 예를 들어 장비 이름을 데이터베이스의 무기 통계와 연결하는 데 사용할 수 있습니다. 배열과 마찬가지로 많은 프로그래밍 언어에서 볼 수 있고 많이 사용하는 기본 데이터 유형입니다.
pl: Słownik (dictionary) to struktura danych, która mapuje wartości w pary klucz-wartość. Kiedy nadasz słownikowi klucz, znajdzie on i zwróci ci odpowiadającą mu wartość. W języku GDScript klucze mogą być wieloma rzeczami. Często używać będziemy ciągów tekstowych lub liczb, ale nie musimy się do tego ograniczać. Prawidłowym kluczem może być [code]Vector2[/code], który jest przydatny do mapowania komórek siatki dla obiektów lub przedmiotów w grach opartych na siatce (tzw. grid-based games). Często będziesz używać słowników do kojarzenia bitów danych w swoich grach. Przykładowo: możemy ich użyć do powiązania nazwy sprzętu ze statystykami broni w bazie danych. Podobnie jak tablice, słowniki są podstawowym typem danych, który zobaczysz w wielu językach programowania i będziesz go często używał.

source: A for loop instructs the computer to repeat a set of instructions once for each value in an array. In each loop iteration, the compiler extracts one value from the array and gives you access to it in the loop's body. For loops run code a limited amount of times: one per value in the array. It is different from while loops that keep repeating code until a condition is met. We recommend favoring for loops when you can. They're safer and easier to use than while loops.
hu: A for ciklus utasítja a számítógépet, hogy ismételjen egy utasításkészletet, annyiszor, ahány elem van a tömbben. A ciklus minden egyes iterációjában, a compiler "kivesz" egy elemet a tömbből és elérhetővé teszi számodra a ciklus törzsében. A for ciklus csak meghatározott alkalommal hajtódik végre: ahány elemű a tömb. Nem úgy, mint a while ciklus, ami addig ismétlődik, amíg nem teljesül egy feltétel. Azt ajánljuk, hogy, ha teheted, akkor a for ciklusokat részesítsd előnyben. Biztonságosabbak, és egyszerűbb a használatuk, mint a while ciklusoké..
ko: for loop는 배열의 각 값에 대해 한 번씩 일련의 명령을 반복하도록 컴퓨터에 지시합니다. 각 loop반복에서 컴파일러는 배열에서 하나의 값을 추출하고 loop 본문에서 해당 값에 액세스할 수 있도록 합니다. For loop는 제한된 횟수만큼 코드를 실행합니다. 배열의 값당 하나씩. 조건이 충족될 때까지 코드를 계속 반복하는 while loop와 다릅니다. 가능하면 for loop를 사용하는 것이 좋습니다. while loop보다 더 안전하고 사용하기 쉽습니다.
pl: Pętla for instruuje komputer do powtarzania zestaw instrukcji po jednym razie dla każdej z wartości w tablicy. W każdej iteracji pętli kompilator wyodrębnia jedną wartość z tablicy i daje do niej dostęp wartościom w ciele pętli. W przypadku pętli uruchamiamy kod ograniczoną liczbę razy: jeden raz na wartość w tablicy. To odróżnia pętle for od pętli while, która powtarza kod, dopóki jej warunek nie zostanie spełniony. Zalecamy preferowanie pętli for, kiedy tylko jest to możliwe. Są bezpieczniejsze i łatwiejsze w użyciu od pętli while.

source: A function is a group of code instructions you give a name. When you define a function, you can call it any time to run all the instructions it contains. You can modify a function's behavior with parameters. Parameters are variable names that you write in the function definition. You can then use them in the function's body to make your code adapt to different cases. Also, functions can optionally return a value to the code calling it.
hu: A függvény az utasítások egy névvel ellátott csoportját jelenti. Ha létrhozol egy függvényt, azt akármikor hívhatod, hogy a benne lévő utasításokat végrehajtsd. Paraméterekkel módosíthatod a függvény működését. A paraméterek olyan változók, amelyek a függvény létrehozásánál adhatsz meg. Ezután használhatod őket a függvény törzsében, hogy a kódod alkalmazkodjon a különböző helyzetekhez. Továbbá, a függvények visszatérhetnek egy értékkel abba a kódba, ahonnan hívva lettek.
ko: 함수는 이름을 지정하는 코드 명령 그룹입니다. 함수를 정의할 때 함수에 포함된 모든 명령을 실행하기 위해 언제든지 호출할 수 있습니다. 매개변수를 사용하여 함수의 동작을 수정할 수 있습니다. 매개변수는 함수 정의에 작성하는 변수 이름입니다. 그런 다음 함수의 본문에서 이를 사용하여 코드를 다양한 경우에 적용할 수 있습니다. 또한 함수는 선택적으로 이를 호출하는 코드에 값을 반환할 수 있습니다.
pl: Funkcja jest to grupa instrukcji kodu, której nadajesz nazwę. Kiedy definiujesz funkcję, w późniejszym czasie możesz ją wywołać w dowolnym momencie, aby uruchomić wszystkie zawarte w niej instrukcje. Możesz modyfikować zachowanie funkcji za pomocą parametrów. Parametry to nazwy zmiennych, które wpisujesz w definicji funkcji. Możesz następnie użyć ich w ciele funkcji, aby dostosować swój kod do różnych przypadków. Ponadto funkcje mogą opcjonalnie zwracać wartość do kodu, który ją wywołuje.

source: In computer programming, instructions are a single operation the computer recognizes and can execute. For example, a function call, an addition, or assigning a value to a variable.
hu: A programozásban a művelet a legegyszerűbb kifejezés, amit a számítógép felismer és végrehajt Példál, egy függvény hívása, összeadás, vagy érték hozzárendelése egy változóhoz.
ko: 컴퓨터 프로그래밍에서 명령어는 컴퓨터가 인식하고 실행할 수 있는 단일 작업입니다. 예를 들어, 함수 호출, 추가 또는 변수에 값 할당.
pl: W programowaniu komputerowym instrukcje są pojedynczymi operacjami, które komputer rozpoznaje i może wykonać. Będzie to na przykład wywołanie funkcji, czy dodanie lub przypisanie wartości do zmiennej.

source: Variables are a tool to give a name to values you want to store in your code and change over time. For example, a character's health: when the character takes a hit, you want it to go down. When healing, you want the health to go back up. You can create a variable named [code]health[/code] to represent the health. Then, every time you write the keyword [code]health[/code] in your code, the computer will fetch the corresponding value in its memory for you. Variables work a bit like product labels in a supermarket. They are names that you attach to some value. Any time, you can take the label and stick it onto a new product or, in that case, a new value.
hu: A változók arra vannak, hogy nevet adhass az értékeknek, amelyeket használni vagy módosítani szeretnél a kódodban. Például, egy karakter életereje: ha sebzés éri a karaktert, lejjeb akarod vinni. Ha gyógyul, akkor pedig feljebb. Készíthetsz egy [code]health[/code] nevű változót, hogy ez reprezentálja az életerőt. Ezután, mindig amikor a [code]health[/code]-re hivatkozol a kódodban, a számítógép a hozzá tartozó értéket fogja elővenni. A változók hasonlóak, mint az címkék a szupermarketekben. Nevek, amelyekhez valamilyen értéket rendelsz. Bármikor megfoghatod a címkét és átteheted egy másik termékre, vagy, mint a fenti példában, új értéket adhatsz meg.
ko: 변수는 코드에 저장하고 시간이 지남에 따라 변경하려는 값에 이름을 지정하는 도구입니다. 예를 들어, 캐릭터의 건강: 캐릭터가 명중을 당했을 때, 당신은 그것이 떨어지기를 원합니다. 치유되면 건강이 회복되기를 원합니다. 상태를 나타내는 [code]health[/code]라는 변수를 생성할 수 있습니다. 그러면 코드에 키워드 [code]health[/code]를 작성할 때마다 컴퓨터가 메모리에서 해당 값을 가져옵니다. 변수는 슈퍼마켓의 제품 라벨처럼 작동합니다. 그것들은 당신이 어떤 가치에 붙이는 이름입니다. 언제든지 라벨을 가져와 새 제품이나 새 제품에 붙일 수 있습니다.
pl: Zmienne są narzędziem służącym do nadawania wartościom nazw, które chcemy przechowywać w kodzie i zmieniać w czasie. Dla przykłady weźmy zdrowie postaci: gdy postać otrzyma cios, będziemy chcieli, aby jego wartość spadła. Podczas leczenia natomiast, aby znowu wróciło do normy. Dla tego celu możemy utworzyć zmienną o nazwie [code]health[/code], która reprezentować będzie zdrowie. Dzięki temu za każdym razem, gdy w kodzie wpisane zostanie słowo kluczowe [code]health[/code], komputer pobierze odpowiednią wartość ze swojej pamięci. Zmienne działają trochę jak etykiety produktów w supermarkecie. Są to nazwy, które przypisujesz do jakiejś wartości. W każdej chwili możesz wziąć etykietę i nakleić ją na nowy produkt lub, w naszym przypadku, nową wartość.
