Repository: GDQuest/learn-gdscript-translations
Catalog: */glossary_database.po
Languages: fa, hu, ko, pl, sv

source: A while loop instructs the computer to keep running code based on a condition. While the condition is true, the loop keeps running. When coding while loops, you must be careful: they will keep running infinitely and freeze your game if you get the condition wrong. That's why we recommend using the safer for loop whenever you can. However, there are still essential cases in which we use while loops, like processing files, processing computer code, or for powerful algorithms.
hu: A while ciklus arra utasítja a számítógépet, hogy feltételtől függően folymatosan hajtsa végre az utasításokat. Amíg a feltétel igaz, addig fut a ciklus. While ciklus használatánál oda kell figyelni: ha rossz feltételt adsz meg, akkor soha nem állnak meg és lefagyaszthatják a játékod. Ezért ajánljik, hogy , ha csak teheted, használd a biztonságos for ciklust. Azonban, vannak olyan esetek, amikor mégis a while ciklust használjuk, például fájlműveletek, kódfeldolgozás, vagy komplexebb algoritmusok.
ko: while loop는 조건에 따라 코드를 계속 실행하도록 컴퓨터에 지시합니다. 조건이 true인 동안 loop는 계속 실행됩니다. while loop를 코딩할 때 주의해야 합니다. 조건이 잘못되면 무한히 계속 실행되고 게임이 중지됩니다. 그렇기 때문에 가능한 한 더 안전한 for loop를 사용하는 것이 좋습니다. 그러나 파일 처리, 컴퓨터 코드 처리 또는 강력한 알고리즘과 같이 while loop를 사용하는 필수 경우가 여전히 있습니다.
pl: Pętla while instruuje komputer to wykonywania kod w kółko w oparciu o podany warunek. Dopóki warunek będzie spełniony, pętla będzie działać. Podczas używania pętli while musisz być bardzo ostrożny: pętle te mogą działać w nieskończoność i zfreezować grę, jeśli podany w nich warunek nie będzie prawidłowy. Jest to powód, dla którego zalecamy używanie bezpieczniejszej pętli for kiedy tylko jest to możliwe. Nadal jednak znajdą się istotne przypadki, w których wymagane będzie użycie pętli while, jak przetwarzanie plików, przetwarzanie kodu komputerowego czy dla co potężniejszych algorytmów.

source: Returning a value is the process of sending a value to the place where you call a function. It happens when a function uses the [code]return[/code] keyword followed by a value, for example: [code]return -1[/code].
hu: Érték visszatéréséről akkor beszélünk, ha azt arra a helyre küldjük, ahonnan hívva lett a függvény. Ezt a [code]return[/code] kulcsszóval majd az azt követő értékkel tehetjük meg. Például: [code]return -1[/code].
ko: 값을 반환하는 것은 함수를 호출한 곳으로 값을 보내는 과정입니다. 함수가 [code]return[/code] 키워드 뒤에 값을 사용할 때 발생합니다(예: [code]return -1[/code]).
pl: Zwracanie wartości to proces wysyłania wartości do miejsca, w którym wywołana została funkcja. Dzieje się to w przypadku wykorzystywania przez funkcję słowa kluczowego [code]return[/code], po którym następuje wartość, na przykład: [code]return -1[/code].
