Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-24-access-array-indices.po
Languages: tr, zh_hans

source: You learned to loop over all the values in an array using the [code]for[/code] keyword.
tr: [code]for[/code] anahtar kelimesini kullanarak bir dizideki tüm değerler üzerinde döngü yapmayı öğrendin.
zh_hans: 您学会了使用 [code]for[/code] 关键字循环遍历数组中的所有值。

source: But what if you need to access the third item in the player's inventory? The tenth item? There's a dedicated notation to access one element in an array by index. To do so, you use square brackets with a number inside the brackets.
tr: Peki ya oyuncunun envanterindeki üçüncü öğeye erişmeniz gerekiyorsa? Ya onuncu eşyaya? Bir dizideki bir elemana, yer numarasına (dizin, indeks) göre erişmek için özel bir gösterim vardır. Bunu yapmak için köşeli parantezler ve parantezlerin içinde bir sayı kullanırsın.
zh_hans: 但是，如果您需要访问玩家库存中的第三个项目怎么办？ 第十项？ 有一种专门的符号可以通过索引访问数组中的一个元素。 为此，您使用方括号，括号内有一个数字。

source: Index zero is the [i]first[/i] element in the array.
tr: Sıfır (0) dizini, dizideki [i]ilk[/i] elemandır.
zh_hans: 索引零是数组中的 [i]first[/i] 元素。

source: Index one is the [i]second[/i] element in the array, and so on. You would access the [i]fourth[/i] element in the [code]inventory[/code] array like so.
tr: Birinci dizin dizideki [i]ikinci[/i] elemandır ve bu böyle devam eder. [code]inventory[/code] dizisindeki [i]dördüncü[/i] elemana şu şekilde erişirdin.
zh_hans: 索引一是数组中的 [i]second[/i] 元素，依此类推。 您可以像这样访问 [code]inventory[/code] 数组中的 [i]fourth[/i] 元素。

source: How would you access the [i]third[/i] item in the [code]inventory[/code] array?
tr: [code]inventory[/code] dizisinin [i]üçüncü[/i] öğesine nasıl erişirsin?
zh_hans: 您将如何访问 [code]inventory[/code] 数组中的 [i]third[/i] 项？

source: Indices start at zero, so the index of the [i]third[/i] item is [code]2[/code]. That's why you need to write [code]inventory[2][/code].
tr: Dizinler sıfırdan başlar, bu nedenle [i]üçüncü[/i] öğenin indeksi [code]2[/code]'dir. Bu nedenle [code]inventory[2][/code] yazman gerekir.
zh_hans: 索引从零开始，因此[i]third[/i] 项的索引是[code]2[/code]。 这就是为什么你需要编写 [code]inventory[2][/code]。

source: Accessing the last values with negative indices
tr: Sondaki değerlere negatif dizinler ile erişim
zh_hans: 使用负索引访问最后一个值

source: What if you want to access the last or second-before-last item in the [code]inventory[/code]? In that case, you can use negative indices. If you write [code]-1[/code] in the brackets, you will get the last item in the array. You will get the second-to-last item if you write [code]-2[/code].
tr: Peki ya [code]inventory[/code] (envanter) dizisideki son veya sondan bir önceki öğeye erişmek istiyorsan? Bu durumda, negatif dizinler kullanabilirsin. Parantez içine [code]-1[/code] yazarsan, dizideki son öğeyi alırsın. [code] -2[/code] yazarsan, sondan ikinci öğeyi elde edersin.
zh_hans: 如果您想访问 [code]inventory[/code] 中的最后一个或倒数第二个项目怎么办？ 在这种情况下，您可以使用负索引。 如果你在括号中写 [code]-1[/code]，你将得到数组中的最后一项。 如果您编写 [code]-2[/code]，您将获得倒数第二个项目。

source: That's very convenient when you need to quickly access elements from the end of the list.
tr: Listenin öğelerine sondan başlayıp hızlı bir şekilde erişmen gerektiğinde bu çok kullanışlıdır.
zh_hans: 当您需要从列表末尾快速访问元素时，这非常方便。

source: How would you access the third-to-last item in the inventory array?
tr: inventory dizisindeki sondan üçüncü öğeye nasıl erişirsin?
zh_hans: 您将如何访问库存数组中倒数第三个项目？

source: When using negative indices, [code]-1[/code] means the [i]last[/i] element in the array. Index [code]-2[/code] will be the second-to-last, thus [code]-3[/code] will be the third-to-last. It can be little confusing as it seems to work differently from positive indices. However, it's because there's no difference between index [code]0[/code] and [code]-0[/code]: they both point to the first item in the array.
tr: Negatif dizinler kullanıldığında, [code]-1[/code] dizideki [i]son[/i] eleman anlamına gelir. [code]-2[/code] dizini sondan ikinci, dolayısıyla [code]-3[/code]'de sondan üçüncü olacaktır. Pozitif dizinlerden farklı çalışıyormuş gibi göründüğü için biraz kafa karıştırıcı olabilir. Ancak, bunun nedeni [code]0[/code] ve [code]-0[/code] dizinleri arasında bir fark olmamasıdır: ikisi de sıfırdır yani her ikisi de dizideki ilk öğeye işaret eder.
zh_hans: 当使用负索引时，[code]-1[/code] 表示数组中的 [i]last[/i] 元素。 索引 [code]-2[/code] 将是倒数第二个，因此 [code]-3[/code] 将是倒数第三个。 它可能有点令人困惑，因为它似乎与正指数的工作方式不同。 但是，这是因为索引 [code]0[/code] 和 [code]-0[/code] 之间没有区别：它们都指向数组中的第一项。

source: You can't access non-existent indices
tr: Var olmayan dizinlere erişemezsin
zh_hans: 您无法访问不存在的索引

source: There's a catch with this syntax: if you try to access an index that does not exist, you will get an error. You have to be careful always to access existing elements in the array. There are a couple of ways you can check for valid indices. One of them is checking the array's size.
tr: Bu sözdiziminde bir tuzak vardır: var olmayan bir dizine erişmeye çalışırsan hata alırsını. Dizideki mevcut öğelere erişme konusunda her zaman dikkatli olmalısın. Geçerli dizinleri kontrol etmenin birkaç yolu vardır. Bunlardan biri dizi boyutunu kontrol etmektir.
zh_hans: 这种语法有一个问题：如果你试图访问一个不存在的索引，你会得到一个错误。 您必须始终小心访问数组中的现有元素。 有几种方法可以检查有效索引。 其中之一是检查数组的大小。

source: [b]Checking the size of the array[/b] Arrays come with a member function named [code]size()[/code]. You can call it on the array anytime to know its [i]current[/i] size.
tr: [b]Dizi boyutunu kontrol etme[/b] Diziler, [code]size()[/code] (boyut) adlı bir üye fonksiyon ile birlikte gelir. Bu fonksiyonu dizinin [i]mevcut[/i] boyutunu öğrenmek için istediğin zaman çağırabilirsin.
zh_hans: [b]检查数组的大小[/b] 数组带有一个名为 [code]size()[/code] 的成员函数。 您可以随时在数组上调用它以了解其 [i]current[/i] 大小。

source: The maximum index you can access in an array is [code]array.size() - 1[/code]: it's the last item in the array.
tr: Bir dizide erişebileceğin en büyük dizin numarası [code]dizi.size() - 1[/code]: yani dizideki son öğedir. (Dizi 5 elemanlı ise, son öğe 4 dizin numaralıdır).
zh_hans: 您可以在数组中访问的最大索引是 [code]array.size() - 1[/code]：它是数组中的最后一项。

source: In the following practices, you will use array indices to realign train tracks and grab the correct item in an inventory.
tr: Sıradaki alıştırmalarda, tren raylarını yeniden hizalamak ve bir envanterdeki doğru öğeyi almak için dizinleri kullanacaksın.
zh_hans: 在以下实践中，您将使用数组索引来重新排列火车轨道并在库存中获取正确的项目。

source: Using the right items
tr: Doğru öğeleri kullanmak
zh_hans: 使用正确的物品

source: In our game, the player has an inventory that works as an array under the hood. They want to equip a sword and a shield to buff their characters. Like before, we need you to find them in the array. You need to access elements in the [code]inventory[/code] array by index to do so. Call the [code]use_item()[/code] function with the item as an argument to use an item. For example, you can use the first item by calling [code]use_item(inventory[0])[/code].
tr: Oyunumuzda, oyuncunun aslında bir dizi olarak çalışan bir envanteri (inventory) vardır. Karakterini güçlendirmek için bir kılıç ve bir kalkan kuşanmak istiyor. Daha önce olduğu gibi, onları dizi içinde bulman gerekiyor. Bunu yapmak için [code]inventory[/code] dizisindeki öğelere dizinine göre erişmen gerekir. Bir öğeyi kullanmak için [code]use_item()[/code] fonksiyonunu, öğeyi girilen değişken olarak kullanıp çağır. Örneğin, fonksiyonu [code]use_item(inventory[0])[/code] şeklinde çağırarak ilk öğeyi kullanabilirsin.
zh_hans: 在我们的游戏中，玩家有一个在引擎盖下作为数组工作的库存。 他们想装备一把剑和一个盾牌来增强他们的角色。 像以前一样，我们需要您在数组中找到它们。 您需要通过索引访问 [code]inventory[/code] 数组中的元素才能这样做。 使用项目作为参数调用 [code]use_item()[/code] 函数以使用项目。 例如，您可以通过调用 [code]use_item(inventory[0])[/code] 来使用第一项。

source: Find the right items to use in the player's inventory.
tr: Oyuncunun envanterinde kullanılacak doğru öğeleri bul.
zh_hans: 在玩家的库存中找到要使用的正确物品。

source: Realigning the train tracks
tr: Tren raylarını yeniden hizalamak
zh_hans: 重新调整火车轨道

source: We have train tracks broken down into little chunks in our game. We use them to make modular tracks and draw circuits of all shapes and sizes. However, several chunks are misaligned. You need to find them in the [code]tracks[/code] array and pass them to the [code]align()[/code] function. To do so, you need to access the array by index. This time, though, you need to access them with [i]negative indices[/i].
tr: Oyunumuzda küçük parçalara ayrılmış tren raylarımız var. Bunları kolay takılan (modüler) raylar yapmak ve her şekil ve boyutta yollar çizmek için kullanıyoruz. Ancak, birkaç parça yanlış hizalanmış. Bunları [code]tracks[/code] (raylar) dizisinde bulman ve [code]align()[/code] (hizala) fonksiyonuna aktarman gerekir. Bunu yapmak için öğelere dizinlerine göre erişmen gerekir. Ancak bu kez, bunlara [i]negatif dizin numaraları[/i] ile erişmen gerekir.
zh_hans: 我们在游戏中将火车轨道分解成小块。 我们使用它们来制作模块化轨道并绘制各种形状和大小的电路。 但是，有几个块未对齐。 您需要在 [code]tracks[/code] 数组中找到它们并将它们传递给 [code]align()[/code] 函数。 为此，您需要按索引访问数组。 不过，这一次，您需要使用 [i] 负索引 [/i] 来访问它们。

source: Some chunks of our train tracks are misaligned, and the train can't pass. Find the faulty pieces and realign them.
tr: Tren raylarımızın bazı parçaları yanlış hizalanmış ve tren geçemiyor. Hatalı parçaları bul ve yeniden hizala.
zh_hans: 我们的一些火车轨道错位了，火车无法通过。 找到有缺陷的部分并重新调整它们。

source: Accessing values in arrays
tr: Dizilerdeki değerlere erişmek
zh_hans: 访问数组中的值
