Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-2-your-first-error.po
Languages: hu, it, ko, nl, pl, sk, sv, th, zh_hant

source: When you program, you are bound to run into errors. Tons of them.
ko: 프로그래밍을 할 때, 오류를 만나게 되는 것은 피할 수 없습니다. 아주 많이요.
pl: Kiedy programujesz, na pewno napotkasz błędy. Mnóstwo błędów.
sk: Pri programovaní sa nevyhnete chybám. Spúste chýb.

source: But you shouldn't worry! On the computer, [b]errors are a good thing[/b].
hu: De ne aggódj! A számítógépen, [b]a hibák jó dolgok[/b].
ko: 하지만 걱정하지 마세요! 컴퓨터에서 [b]오류는 좋은 것[/b]입니다.
pl: Ale nie martw się! Na komputerze [b]błędy są czymś dobrym[/b].
sk: Žiaden strach! Na počítačoch [b]sú chyby na niečo dobré[/b].
sv: Men du behöver inte oroa dig! Felmeddelanden är [b]bra[/b].

source: You will encounter errors, and [i]that's okay[/i]: every programmer does. Especially professionals.
hu: Találkozni fogsz hibákkal, és ez [i]rendben van[/i]: minden programozó találkozik velük. Főleg a profik.
ko: 오류를 만나게 될 것이고, [i]괜찮습니다[/i]: 모든 프로그래머가 그렇습니다. 특히 전문가들이 그렇습니다.
pl: Napotykanie błędów jest normalne, i [i]to w porządku[/i]: każdy programista tak ma. Zwłaszcza profesjonaliści.
sk: Narazíte na chyby a [i]to nevadí[/i]: stáva sa to každému programátorovi. Najmä profíkom.
sv: Du kommer få felmeddelanden och [i]det är helt okej[/i]: alla programmerare får den. Speciellt proffs.

source: At school, maybe you learned that mistakes are a bad thing. When you code something, it's not the case: [b]errors help you write correct programs[/b] because they show you what is wrong in your programs.
hu: Az iskolában, talán azt tanultad, hogy a hibák rossz dolgok. Ha programozol, nem ez a helyzet: [b]a hibák segítenek jobbá tenni a programod[/b].
ko: 학교에서는 실수가 나쁜 것이라고 배웠을지도 모릅니다. 하지만 코딩할 때는 그렇지 않습니다: [b]오류는 올바른 프로그램을 작성하는 데 도움을 줍니다[/b] 왜냐하면 오류는 프로그램에서 무엇이 잘못되었는지를 보여주기 때문입니다.
pl: W szkole mogłeś się uczyć, że pomyłki są złe. W programowaniu jest inaczej: [b]błędy pomagają ci pisać poprawne programy[/b], ponieważ pokazują, co jest nie tak w twoim kodzie.
sk: V škole vás možno učili, že chyby sú niečo zlé. To však neplatí, keď programujete: [b]chyby vám pomôžu napísať programy správne[/b] pretože vám ukazujú, čo je v nich zle.
sv: I skolan har du kanske lärt dig att fel är dåliga. När du programmerar är det inte sant: [b]felmeddelandena hjälper dig skriva korrekta program[/b].

source: A code error looks like this. It's a message that tells you some bit of your code doesn't work.
hu: Így néz ki egy hiba a kódban. Ez egy üzenet, ami közli, hogy a kódod valamelyik része nem működik.
it: Un errore si presenta così. È un messaggio che ti avvisa che parte del tuo codice non va bene.
ko: 코드 오류는 이렇게 생겼습니다. 당신의 코드 중 일부가 바르게 작동하지 않는다는 메시지입니다.
nl: Een foutmelding ziet er als volgt uit. Het is een bericht dat je vertelt dat een deel van je code niet werkt.
pl: Błąd w kodzie wygląda tak. Jest to wiadomość, która mówi, że część kodu nie działa.
sk: Chyba kódu vyzerá takto. Ide o správu, ktorá vám vraví, že nejaká časť vášho kódu nefunguje.
sv: Ett felmeddelande kan se ut såhär. Det är ett meddelande som berättar att någon del av din kod inte fungerar.
th: โค้ดที่ผิดพลาดมีลักษณะเป็นแบบนี้ มันเป็นข้อความที่จะบอกคุณว่าโค้ดบางส่วนของคุณใช้งานไม่ได้นะ
zh_hant: 程式碼錯誤看起來像這樣。這是個告訴你程式碼哪裡無法運作的訊息。

source: Making errors friendlier
hu: A hibák megszelídítése
it: Rendere gli errori meno spaventosi
ko: 오류와 친해지자
nl: Foutmeldingen vriendelijker maken
pl: Zaprzyjaźnianie się z błędami
sk: Zoznámenie s chybami
sv: Trevligare felmeddelanden
th: ทำให้ข้อผิดพลาดนี้เป็นมิตรมากขึ้น
zh_hant: 讓錯誤友善點

source: Error messages can look a bit cryptic. This is because they're designed by programmers, for trained programmers.
hu: A hibaüzenetek rejtélyesnek tűnhetnek. Ez azért van mert programozók készítették őket, gyakorlott programozóknak.
ko: 오류 메시지는 때론 비밀스러운 암호문처럼 보일 수 있습니다. 이는 프로그래머가 숙련된 프로그래머를 위해 설계했기 때문입니다.
pl: Komunikaty o błędach mogą wyglądać nieco tajemniczo. Dzieje się tak, ponieważ zostały zaprojektowane przez kolegów programistów dla przeszkolonych programistów.
sk: Chybové správy môžu vyzerať trochu ako šifry. To preto, že ich navrhli programátori pre školených programátorov.
sv: Felmeddelanden kan verka ganska kryptiska. Det här beror på att de är gjorda av programmerare, för utbildade programmerare.

source: We added an error translator in this app that will help you get started.
hu: Adtunk egy hibaüzenet fordítót az alkalmazáshoz, hogy segítsen az elindulásban.
ko: 당신의 시작을 돕기 위해 오류 번역기를 만들었습니다.
pl: Dlatego do naszej aplikacji dodaliśmy tłumacza błędów, który pomoże ci zacząć przygodę z nimi.
sk: Do tejto aplikácie sme pridali prekladač chýb, ktorý vám pomôže začať.
sv: Vi lade till en feltolk i den här appen för att hjälpa dig komma igång.

source: It shows you why an error happens and what the message means. It also gives you some tips on how to fix it.
hu: Megmutatja, hogy miért történt a hiba és mit jelent az üzenet. Ezenkívül néhány tippet is ad a javításhoz..
ko: 이 번역기는 오류가 왜 발생했는지, 메시지가 무엇을 뜻하는지를 보여줍니다. 고치는 방법에 대한 팁도 함께 표시됩니다.
pl: Tłumacz pokaże ci, dlaczego wystąpił dany błąd i co oznacza widniejący przy nim komunikat. Ponadto zawierać będzie kilka wskazówek, jak ów błąd można naprawić.
sk: Ukáže vám, čo chybu spôsobuje a čo daná správa znamená. Tiež vám dá pár tipov ako chybu opraviť.
sv: Den visar dig varför felet hände och och vad felmeddelandet betyder. Den ger dig också tips på hur du kan fixa felet.

source: Error messages are designed on purpose by fellow programmers who came before you. They anticipated you might have specific issues and wanted to help you fix them.
ko: 오류 메시지는 여러분보다 앞서 온 동료 프로그래머가 의도적으로 디자인한 것입니다. 그들은 여러분에게 특정 문제가 있을 것으로 예상하고 여러분이 문제를 해결하도록 돕고자 했습니다.
pl: Komunikaty o błędach zostały celowo zaprojektowane przez programistów, którzy byli przed tobą. Przewidzieli, że możesz napotkać konkretne problemy i chcieli pomóc ci je rozwiązać.
sk: Chybové správy sú navrhnuté účelovo kolegami programátormi, vašimi predchodcami. Predpokladali, že budete mať konkrétne problémy a chceli vám pomôcť ich vyriešiť.

source: You shouldn't think of errors as failures. They are like mentors helping you from the past. Importantly, errors won't break your computer. At least not with GDScript because it's a pretty safe language.
ko: 오류를 실패로 생각해서는 안 됩니다. 오류는 과거로부터 여러분을 도와주는 멘토와 같은 존재입니다. 중요한 것은 오류로 인해 컴퓨터가 고장 나지 않는다는 것입니다. 적어도 GDScript는 매우 안전한 언어이기 때문입니다.
pl: Nie powinieneś traktować błędów jako porażek. Są one raczej jak mentorzy z przeszłości, którzy cię wspierają. Co ważne, błędy nie uszkodzą twojego komputera — przynajmniej nie w przypadku GDScript, ponieważ to dość bezpieczny język.
sk: O chybách by ste nemali uvažovať ako o zlyhaní. Sú ako mentori, ktorí vám pomáhajú z minulosti. Dôležité je, že chyby vám nepokazia počítač. Prinajmenšom nie cez GDScript, pretože ten je skutočne bezpečný.

source: Ultimately, you want to fix all the errors in your program. Understanding what is causing the errors, with the help of error messages, is key to fixing them.
ko: 궁극적으로 프로그램의 모든 오류를 수정하고 싶을 것입니다. 오류 메시지를 통해 오류의 원인을 파악하는 것이 오류를 수정하는 핵심입니다.
pl: Ostatecznie chcesz naprawić wszystkie błędy w swoim programie. Kluczem do tego jest zrozumienie, co je powoduje — a w tym pomagają właśnie komunikaty o błędach.
sk: Napokon, chcete opraviť všetky chyby vo vašom programe. Pochopenie čo ich spôsobuje, s pomocou chybových správ, je kľúčom k ich opravám.

source: Are error messages a good or a bad thing in code?
it: Nel codice, i messaggi di errore sono una cosa buona o cattiva?
ko: 코드 속에서 발생한 오류는 좋은가, 나쁜가?
nl: Zijn foutmeldingen in code goed of slecht?
pl: Czy komunikaty błędów to dobra czy zła rzecz w kodzie?
sk: Sú chybové správy v kóde dobré alebo zlé?

source: Yes, error messages are here to help you!
ko: 오류는 당신을 도와주러 온 친구입니다!
pl: Tak, komunikaty o błędach są po to, żeby ci pomóc!
sk: Áno, chybové správy sú tu preto, aby vám pomohli!

source: Pay attention to them, and do your best to read and understand them. With experience, you'll learn to make your code work more reliably thanks to error messages.
hu: Figyelj oda rájuk, és próbáld meg a lehető legjobban megérteni őket. Kis gyakorlás után megtanulod, hoygan tedd jobbá a kódod, a hibaüzeneteknek köszönhetően.
ko: 주의깊게 내용을 읽어보고 최대한 이해해보세요. 오류와 함께한 경험이 쌓일수록 당신이 작성한 코드는 더욱 믿음직해질 것입니다.
pl: Zwracaj na nie uwagę i staraj się je czytać oraz rozumieć. Z czasem nauczysz się pisać kod działający bardziej niezawodnie właśnie dzięki komunikatom o błędach.
sk: Venujte im pozornosť a snažte sa ich čo najlepšie prečítať a pochopiť. Skúsenosťami sa naučíte tvoriť kód, ktorý bude pracovať spoľahlivejšie vďaka chybovým správam.
sv: Var uppmärksam på dem och gör ditt bästa för att läsa dem och förstå dem. När du blir mer erfaren, lär du dig att koden blir pålitligare tack vare felmeddelanden.

source: They're bad: error messages are always bad.
ko: 나쁘다: 오류는 언제나 나쁜 것이다.
nl: Ze zijn slecht: foutmeldingen zijn altijd slecht.
pl: Są złe: komunikaty o błędach zawsze są złe.
sk: Sú zlé: chybové správy sú vždy zlé.

source: They're good: they're here to help.
hu: Jók: azért vannak, hogy segítsenek.
it: Buona: sono qui per aiutarti.
ko: 좋다: 오류는 도움의 손길이다.
nl: Ze zijn goed: ze zijn er om te helpen.
pl: Są dobrze. Są po to, aby ci pomóc.
sk: Sú dobré: sú tu aby nám pomohli.
sv: De är bra: de finns för att hjälpa.
th: พวกมันดี พวกมันพร้อมให้ความช่วยเหลือ
zh_hant: 好事：他們是來幫忙的。

source: Okay, let's see an error in action. Once again, click the [i]Practice[/i] button below to face your first real error.
hu: Oké, lássunk egy hibaüzenetet működés közben. Kattints ismét a [i]Gyakorlat[/i] gombra, hogy lásd az első igazi hibaüzeneted.
it: Va bene, vediamo un errore in azione. Premi nuovamente il tasto [i]Fai pratica[/i] per affrontare il tuo primo vero errore.
ko: 이제 실제 환경에서 오류를 관찰해봅시다. 다시 한 번 [i]실습[/i] 버튼을 눌러 첫 오류를 마주하세요.
nl: Ok√©, laten we een foutmelding in actie zien. Klik nogmaals op de knop [i]Oefenen[/i] hieronder om je eerste echte foutmelding te zien.
pl: Dobra, czas zobaczyć nasze błędy w akcji. Ponownie kliknij znajdujący się poniżej przycisk [i]Ćwiczenie[/i], aby zmierzyć się z pierwszym prawdziwym błędem.
sk: Dobre, pozrime sa na chybu v akcii. Opäť raz kliknite na tlačidlo [i]Practice[/i] dole, aby ste sa zoznámili s prvou skutočnou chybou.
sv: OK, dags att se på ett riktigt felmeddelande live. Klicka på [i]Öva[/i]knappen nedanför för att se ditt första riktiga fel.
th: เอาหล่ะ งั้นมาดูข้อผิดพลาดกันอีกครั้งเถอะ คลิกที่ปุ่ม [i]แบบฝึกหัด[/i] ด้านล่างเพื่อเผชิญกับข้อผิดพลาดของจริงครั้งแรกของคุณ
zh_hant: 好，來實際演練一次錯誤看看。在一次地，請按下[i]練習[/i]按鈕來面對你的第一個真正的錯誤。

source: Fix Your First Error
hu: Javítsd ki az első hibád
it: Risolvi Il Tuo Primo Errore
ko: 첫 오류를 수정하자
nl: De eerste fout oplossen
pl: Napraw swój pierwszy błąd
sk: Opravte svoju prvú chybu
sv: Fixa ditt första fel
th: แก้ไขข้อผิดพลาดแรกของคุณ
zh_hant: 修正你的第一個錯誤

source: This code is incorrect and will cause an error when you try to run it.
hu: Ez a kód hibás, és hibaüzenetet fog dobni, ha futtatni próbálod.
ko: 이 코드는 잘못 작성되어있어서 실행하면 오류를 일으킵니다.
pl: Ten kod jest nieprawidłowy i spowoduje błąd podczas próby jego uruchomienia.
sk: Tento kód je nesprávny a keď ho skúsite spustiť spôsobí chybu.
sv: Den här koden är felaktig och kommer ge ett felmeddelande när du kör den.

source: The code defines an empty function named [code]this_code_is_wrong[/code].
hu: A kód létrehoz egy üres függvényt, [code]this_code_is_wrong[/code] néven.
ko: 이 코드는 [code]this_code_is_wrong[/code]이라는 빈 함수를 정의합니다.
pl: Kod definiuje pustą funkcję o nazwie [code]this_code_is_wrong[/code].
sk: Kód definuje prázdnu funkciu s názvom [code]this_code_is_wrong[/code].
sv: Koden består av en tom funktion som heter [code]this_code_is_wrong[/code].

source: To work, the function should use the [code]return[/code] keyword. But this keyword is currently inside a comment, which the computer ignores.
hu: Ahhoz, hogy működjön, a függvényt a [code]return[/code] kulcsszóval kell lezárni. Ez a kulcsszó jelenleg ki van kommentálva, ezért a számítógép ignorálja.
ko: 작동하기 위해선 함수 안에 [code]return[/code]이라는 키워드가 들어가야 합니다만, 해당 키워드는 현재 주석 처리되어있어 컴퓨터가 무시하는 상태입니다.
pl: Aby funkcja zadziałała, funkcja powinna używać słowa kluczowego [code]return[/code]. Słowo to jednak aktualnie znajduje się w komentarzu, który komputer ignoruje.
sk: Aby fungovala, mala by funkcia použiť kľúčové slovo [code]return[/code]. Lenže toto kľúčové slovo je teraz vnútri komentára, ktorý počítač ignoruje.
sv: För att fungera borde funktionen använda [code]return[/code] kommandot. Men just nu finns kommandot i en kommentar, som datorn ignorerar.

source: Test the current code by pressing the [i]Run[/i] button.
hu: Teszteld az aktuális kódot, nyomd meg a [i]Futtatás[/i] gombot.
ko: [i]실행[/i] 단추를 눌러 현재 코드를 실행해보세요.
pl: Przetestuj bieżący kod, naciskając przycisk [i]Uruchom[/i].
sk: Otestujte aktuálny kód stlačením tlačidla [i]Run[/i].
sv: Testa koden genom att trycka [i]Kör[/i]knappen.

source: Then, remove the comment sign (#) to make the code valid.
hu: Ezután, távolítsd el a komment jelet (#) hogy érvényes legyen a kód.
ko: 다음엔 주석 표시(#)를 지워 코드를 고친 후 다시 실행해보세요.
pl: Następnie usuń znak komentarza (#), aby komputer przestał ignorować linijkę ze słowem kluczowym.
sk: Potom odstráňte znak komentára (#), aby kód fungoval.
sv: Ta sedan bort kommentartecknet (#) för att korrigera koden.

source: Be careful not to remove the spacing before [code]return[/code]! Otherwise, that'll cause another error. You may try that too, if you feel like it.
hu: Vigyázz, nehogy töröld a bekezdést a [code]return[/code] előtt! Ha így tennél, akkor egy másik hibaüzenetet kapnál. Kipróbálhatod azt is, ha akarod.
ko: [code]return[/code] 앞에 있는 공간을 지우지 않게 조심하세요! 또 다른 에러가 발생합니다. 보고 싶으시면 한 번 지워보세요.
pl: Uważaj, aby nie usunąć odstępów (tabulacji) przed [code]return[/code]! W przeciwnym razie spowoduje to kolejny błąd. Jeśli jednak masz taką ochotę, możesz to zrobić i również to przetestować.
sk: Dajte pozor, aby ste neodstránili medzery pred [code]return[/code]! Inak to spôsobí ďalšiu chybu. Ale keď chcete, môžete si to tiež vyskúšať.
sv: Var noga med att inte ta bort tomrummet före [code]return[/code]! Annars kommer det att orsaka ett annat felmeddelande. Du kan testa det också, om du vill.

source: There's an error in this code. We need you to fix it!
hu: Van egy hiba ebbena kódban. Szükségünk van rád, hogy kijavítsd!
it: C'è un errore in questo codice. Prova a risolverlo!
ko: 이 코드 속에 오류가 있습니다. 당신의 손길이 필요해요!
nl: Er zit een fout in deze code. We hebben jou nodig om het te herstellen!
pl: W tym kodzie jest błąd. Potrzebujemy cię do jego naprawy!
sk: V tomto kóde je chyba. Potrebujeme, aby ste ju opravili!
sv: Det finns ett fel i den här koden. Du måste fixa det!
th: มีข้อผิดพลาดในโค้ดนี้ เราต้องการให้คุณแก้ไข!
zh_hant: 程式碼裡有錯誤。我們需要你修復它！

source: Your First Error
hu: Az első hibaüzeneted
it: Il Tuo Primo Errore
ko: 첫 오류를 만나다
nl: Je eerste foutmelding
pl: Twój pierwszy błąd
sk: Vaša prvá chyba
sv: Ditt första felmeddelande
th: ข้อผิดพลาดครั้งแรกของคุณ
zh_hant: 你的第一個錯誤

source: When you program, you are bound to run into errors. Tons of them. But you shouldn't worry! On the computer, [b]errors are a good thing[/b]. You will encounter errors, and [i]that's okay[/i]: every programmer does. Especially professionals. At school, maybe you learned that mistakes are a bad thing. When you code something, it's not the case: [b]errors help you write correct programs[/b] because they show you what is wrong in your programs.
it: Mentre programmi, ti capiterà di trovare degli errori. Molti errori. Ma niente paura! Quando programmi, [b]gli errori sono una cosa buona[/b]. Troverai degli errori, e [i]va bene così[/i]: succede a tutti i programmatori. Soprattutto ai migliori. A scuola, forse ti hanno insegnato che gli errori sono qualcosa di negativo. Quando scrivi codice non è affatto così: [b]gli errori ti aiutano a scrivere i tuoi programmi in maniera corretta[/b] perché ti mostrano cosa c'è di sbagliato nei tuoi programmi.
nl: Tijdens het programmeren kom je foutmeldingen tegen. Een heleboel. Maar je hoeft je geen zorgen te maken! Op de computer [b]zijn foutmeldingen een goede zaak[/b]. Je zult foutmeldingen tegenkomen, en [i]dat is niet erg[/i]: dat doet elke programmeur. Vooral professionals. Op school heb je misschien geleerd dat fouten iets slechts zijn. Wanneer je iets programmeert, is dat niet het geval: [b]foutmeldingen helpen je om correcte programma's te schrijven[/b] omdat ze je laten zien wat er mis is aan je programma's.

source: Error messages can look a bit cryptic. This is because they're designed by programmers, for trained programmers. We added an error translator in this app that will help you get started. It shows you why an error happens and what the message means. It also gives you some tips on how to fix it.
it: I messaggi d'errore potrebbero sembrare un po' criptici. Questo perché sono pensati da programmatori, per programmatori allenati. Abbiamo aggiunto un traduttore di errori in questa app per farti iniziare a prendere dimestichezza con gli errori. Ti mostra perché c'è un errore ed il suo significato. Inoltre fornisce suggerimenti su come risolverlo.
nl: Foutmeldingen kunnen er een beetje cryptisch uitzien. Dit komt doordat ze zijn ontworpen door programmeurs, voor getrainde programmeurs. We hebben in deze app een foutmeldingvertaler toegevoegd die je op weg helpt. Het laat je zien waarom een fout optreedt en wat de melding betekent. Het geeft je ook wat tips over hoe je het op kunt lossen.
th: ข้อความที่แสดงข้อผิดพลาดอาจดูคลุมเครือนิดหน่อย เนื่องจากมันได้รับการออกแบบโดยเหล่าโปรแกรมเมอร์ สำหรับเหล่าโปรแกรมเมอร์ที่ผ่านการฝึกฝนอบรมมาแล้ว เราได้เพิ่มตัวแปลข้อผิดพลาดในแอปนี้ซึ่งจะช่วยสำหรับการเริ่มต้นของคุณได้ มันจะแสดงให้คุณเห็นว่าเพราะอะไรถึงเกิดข้อผิดพลาดและข้อความนั้นๆหมายถึงอะไร นอกจากนี้ยังให้คำแนะนำเกี่ยวกับวิธีการแก้ไขอีกด้วย
zh_hant: 錯誤訊息看起來可能有點像加密謎題。這是因為那是由程式設計師，設計給受過訓練的程式設計師看的。 我們在應用程式中新增了「錯誤翻譯機」來幫助你踏出第一步。 它會告訴你錯誤為何產生以及訊息的意思。它也會給你一些修復錯誤的秘訣。

source: Error messages are designed on purpose by fellow programmers who came before you. They anticipated you might have specific issues and wanted to help you fix them. You shouldn't think of errors as failures. They are like mentors helping you from the past. Importantly, errors won't break your computer. At least not with GDScript because it's a pretty safe language. Ultimately, you want to fix all the errors in your program. Understanding what is causing the errors, with the help of error messages, is key to fixing them.
it: I messaggi d'errore sono stati progettati apposta da altri programmatori prima di te. Avevano previsto che avresti potuto avere dei problemi specifici. Non dovresti vedere gli errori come fallimenti. Sono insegnamenti che ti aiutano a programmare meglio. Non preoccuparti, gli errori non possono creare problemi al tuo computer. Quantomeno non con GDScript, che è un linguaggio piuttosto sicuro. In definitiva, vuoi risolvere tutti gli errori del programma. La comprensione della causa degli errori, con l'aiuto dei messaggi di errore, è fondamentale per risolverli.
nl: Foutmeldingen zijn met opzet ontworpen door collega-programmeurs die je voor gingen. Zij voorzagen dat je specifieke problemen zou kunnen hebben en wilden je helpen deze op te lossen. Je moet foutmeldingen niet zien als mislukkingen. Het zijn net mentoren die je helpen vanuit het verleden. Bovendien maken foutmeldingen je computer niet stuk. Tenminste niet met GDScript, want het is een behoorlijk veilige taal. Uiteindelijk wil je alle fouten in je programma verhelpen. Begrijpen wat de fouten veroorzaakt, met behulp van foutmeldingen, is de sleutel tot het oplossen ervan.

source: Yes, error messages are here to help you! Pay attention to them, and do your best to read and understand them. With experience, you'll learn to make your code work more reliably thanks to error messages.
it: Sì, gli errori sono qui per aiutarti! Prestaci attenzione e fai del tuo meglio per leggerli e capirli. Col tempo, imparerai a scrivere del codice più affidabile grazie ai messaggi d'errore.
nl: Ja, foutmeldingen zijn er om je te helpen! Besteed er aandacht aan en doe je best om ze te lezen en te begrijpen. Met ervaring zul je leren om je code betrouwbaarder te maken dankzij foutmeldingen.

source: This code is incorrect and will cause an error when you try to run it. The code defines an empty function named [code]this_code_is_wrong[/code]. To work, the function should use the [code]return[/code] keyword. But this keyword is currently inside a comment, which the computer ignores. Test the current code by pressing the [i]Run[/i] button. Then, remove the comment sign (#) to make the code valid. Be careful not to remove the spacing before [code]return[/code]! Otherwise, that'll cause another error. You may try that too, if you feel like it.
it: Questo codice non è corretto e causerà un errore se provi ad eseguirlo. Il codice che vedi definisce una funzione vuota chiamata [code]this_code_is_wrong[/code]. Per fare in modo che funzioni, al suo interno dovrebbe essere usata la parola chiave [code]return[/code]. Però questa parola chiave è al momento in un commento, che il computer ignora. Prova questo codice premendo il tasto [i]Esegui[/i]. Dopodiché cancella il segno che indica l'inizio di un commento (#) per rendere valido quel codice. Sii attento a non cancellare gli spazi prima del [code]return[/code]! Altrimenti causerai un errore. Se vuoi scoprire quale, potresti anche provarci.
nl: Deze code is onjuist en zal een fout veroorzaken wanneer je hem probeert uit te voeren. De code definieert een lege functie met de naam [code]this_code_is_wrong[/code]. Om te werken zou de functie het sleutelwoord [code]return[/code] moeten gebruiken. Maar dit sleutelwoord staat momenteel in commentaar, dat de computer negeert. Test de huidige code door op de knop [i]Uitvoeren[/i] te drukken. Verwijder vervolgens het commentaarteken (#) om de code geldig te maken. Wees voorzichtig dat je de spatie voor [code]return[/code] niet verwijdert! Anders veroorzaakt dat een andere fout. Je kunt dat ook proberen, als je daar zin in hebt.
th: โค้ดนี้ไม่ถูกต้องและมันจะทำให้เกิดข้อผิดพลาดเมื่อคุณพยายามเรียกใช้ โค้ดกำหนดฟังก์ชันว่างที่มีชื่อว่า [code]this_code_is_wrong[/code]. ในการทำงาน ฟังก์ชันควรใช้คำสงวน [code]return[/code] แต่ขณะนี้คำสงวนนี้อยู่ในคำอธิบายซึ่งคอมพิวเตอร์จะไม่สนใจ ทดสอบโค้ดปัจจุบันโดยกดปุ่ม [i]เรียกใช้[/i] จากนั้นลบเครื่องหมายคำอธิบายออก (#) เพื่อให้โค้ดทำงานได้ถูกต้อง ระวังอย่าลบระยะห่างก่อน [code]return[/code] ออกไป! ไม่อย่างนั้น จะทำให้เกิดข้อผิดพลาดอื่นๆได้หรือคุณอาจลองดูถ้าหากว่าคุณรู้สึกชอบ
zh_hant: 這個程式碼並不正確，並會在你嘗試運行時給予錯誤。 這個程式碼定義了一個叫做[code]this_code_is_wrong[/code]的函式。 要運作，這個函式應該使用[code]return[/code]關鍵字。但是這個關鍵字現在在會被電腦忽視的註解裡面。 按下[i]運行[/i]按鈕測試現在的程式碼。 然後，移除註解標誌（#）使程式碼變得可行。 小心不要疑除掉[code]return[/code]前面的空白！否則，會導致另一種錯誤。你想要的話也可以試試看。

source: When you program, you are bound to run into errors. Tons of them. But you shouldn't worry! On the computer, [b]errors are a good thing[/b]. You will encounter errors, and [i]that's okay[/i]: every programmer does. Especially professionals. At school, maybe you learned that mistakes are a bad thing. When you code something, it's not the case: [b]errors help you write correct programs[/b].
th: เมื่อคุณเขียนโปรแกรมแล้ว คุณจะต้องพบกับข้อผิดพลาดเป็นจำนวนมาก แต่คุณไม่ต้องห่วงไปนะ! บนคอมพิวเตอร์ [b]การพบข้อผิดพลาดนี่เป็นสิ่งที่ดี[/b] การที่คุณพบข้อผิดพลาดมัน [i]ไม่เป็นอะไรหรอก[/i]: โปรแกรมเมอร์ทุกคนต้องเจอโดยเฉพาะเหล่ามืออาชีพ ที่โรงเรียน คุณอาจจะได้เรียนรู้ว่าความผิดพลาดเป็นสิ่งไม่ดี แต่เมื่อคุณเขียนโค้ดบางอย่าง มันก็ไม่เป็นเช่นนั้น: [b]ข้อผิดพลาดจะช่วยให้คุณเขียนโปรแกรมที่ถูกต้องขึ้น[/b]
zh_hant: 撰寫程式時，你極有可能遇到錯誤。很多錯誤。 但你不該擔心！在電腦上，[b]錯誤是好事[/b]。 你會遇到錯誤，[i]那沒關係[/i]：所有程式設計師都會，尤其是職業的。 在學校，你可能會學習說錯誤是壞事。在寫程式時，不是這麼一回事：[b]錯誤幫助你寫出正確的程式[/b]。
