Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-15-modulo.po
Languages: cs, de, fr, hu, it, pt_br, ru, tr, zh_hans

source: There are other ways to increase maximum health. You could use a modulo to give a bonus every even level. Learn how here!
cs: Existují i jiné způsoby, jak zvýšit maximální zdraví. Můžete použít modulo, abyste získali bonus na každé sudé úrovni. Jak na to, se dozvíte zde!
de: Es gibt andere Möglichkeiten, das maximale Leben zu erhöhen. Sie könnten ein Modulo verwenden, um bei jeder geraden Stufe einen Bonus zu geben. Erfahren Sie hier, wie das geht!
fr: Il existe d'autres façons d'augmenter la santé maximale. Vous pourriez utiliser un modulo pour donner un bonus à chaque niveau pair. Apprenez comment le faire ici !
hu: Más módja is van a maximális élet növelésének. Használhatod a modulot, hogy egy kis bónuszhoz minden második szinten. Nézd meg, hogyan!
it: Ci sono altri modi per aumentare la vita massima. Dovresti usare un modulo per dare un bonus per ogni livello pari. Impara come qui!
pt_br: Existem outras maneiras de aumentar a vida máxima. Você pode usar a operação de módulo para dar um bônus a cada nível par. Aprenda como fazer isso aqui!
ru: Есть и другие способы увеличить максимум здоровья. Вы можете использовать остаток от деления для добавления бонуса к максимуму здоровья каждый чётный уровень. Научитесь этому здесь!
tr: En yüksek sağlığı artırmanın başka yolları da vardır. Her çift seviyede bir ek artış için bir mod alma kullanabilirsin. Nasıl olduğunu buradan öğren!
zh_hans: 还有其他方法可以增加最大血量。您可以使用模数为每个偶数等级提供奖金。在这里学习如何！

source: Modulo
pt_br: Operação de Módulo
ru: Остаток от деления
tr: Mod alma
zh_hans: 模数
