Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-28-specifying-types.po
Languages: es, fr, it, ja, nl, pt, tr, zh_hans

source: When you give the language hints like that, it will [i]prevent[/i] major type errors. When you work in Godot, you will see that the computer can report issues as you write the code. It makes the benefit even greater. Type hints can also help improve the readability of your code. It can help to put more information directly in the code. As we saw, types are essential when coding, and when using type hints, the computer will add them to the engine's built-in code documentation system. There's an incredible third benefit for you: by using type hints, you will learn types much faster. It's excellent for learning. In the following practices, you will write the correct type hints to make the code error-free.
es: Cuando le das al lenguaje sugerencias de esta manera, [i]prevendrás[/i] los principales errores de tipo. Cuando trabajes en Godot, verás que la computadora puede informar de los problemas mientras escribes el código. Esto hace que el beneficio sea aún mayor. Las sugerencias de tipo también pueden ayudar a mejorar la legibilidad de tu código. Puede ayudar a poner más información directamente en el código. Como hemos visto, los tipos son esenciales a la hora de codificar, y al utilizar las sugerencias de tipo, la computadora las añadirá al sistema de documentación de código integrado en el motor. Hay un tercer beneficio increíble para ti: al utilizar las sugerencias de tipo, aprenderás los tipos mucho más rápido. Es excelente para aprender. En las siguientes prácticas, escribirás las sugerencias de tipo correctas para que el código no tenga errores.
fr: Lorsque vous donnez des suggestions au langage de cette manière, vous [i]prévenez[/i] les principales erreurs de type. Lorsque vous travaillez dans Godot, vous verrez que l'ordinateur peut signaler des problèmes au fur et à mesure que vous écrivez le code. Cela rend le bénéfice encore plus grand. Les suggestions de type peuvent également aider à améliorer la lisibilité de votre code. Cela peut vous aider à mettre plus d'informations directement dans le code. Comme nous l'avons vu, les types sont essentiels lorsque l'on code, et lors de l'utilisation de suggestions de type, l'ordinateur les ajoutera au système de documentation de code intégré au moteur. Il y a un troisième avantage incroyable pour vous : en utilisant les suggestions de type, vous apprendrez les types beaucoup plus rapidement. C'est excellent pour l'apprentissage. Dans la pratique suivante, vous écrirez les suggestions de type correctes pour faire que le code soit exempt d'erreurs.
it: Quando dai i suggerimenti di lingua in questo modo, [i]eviterai[/i] errori di tipo più importanti. Quando utilizzi Godot, vedrai che il computer può segnalarti problemi mentre scrivi il codice. Rende la programmazione più efficiente. I suggerimenti di tipo possono anche aiutare a migliorare la leggibilità del tuo codice. Può aiutare mettere più informazioni direttamente nel tuo codice. Come abbiamo visto, i tipi sono essenziali quando scrivi codice e quando usi i suggerimenti di tipo, il computer li aggiungerà al sistema integrato di documentazione del codice. C'è anche un terzo incredibile beneficio per te: usando i suggerimenti di tipo, imparerai i tipi più velocemente. Questo è un modo eccellente per imparare. Nelle seguenti pratiche, scriverai il corretto suggerimento di tipo per rendere il codice libero da errori.
ja: そのように言語のヒントを与えると、大きな型エラーを[i]防ぐ[/i]ことができます。Godotで作業すると、コードを記述するときにコンピューターが問題を報告できることがわかります。これにより、メリットはさらに大きくなります。 型ヒントは、コードの可読性を向上させるのにも役立ちます。より多くの情報をコードに直接入れると便利です。これまで見てきたように、型はコーディング時に不可欠であり、型ヒントを使用すると、コンピューターはエンジンの組み込みコード ドキュメント システムに追加します。 3 つ目の利点は、型ヒントを使うことで、型をより早く習得できることです。学習に最適です。 次の演習では、コードをエラーのないものにするために、正しい型ヒントを記述します。
nl: Als je de taal zulke hints geeft, zal het grote typefouten [i]voorkomen[/i]. Als je in Godot werkt, zul je zien dat de computer problemen kan rapporteren terwijl je de code schrijft. Dat maakt het voordeel nog groter. Typehints kunnen ook helpen om je code leesbaarder te maken. Het kan helpen om meer informatie direct in de code te zetten. Zoals we zagen, zijn types essentieel bij het coderen, en als je typehints gebruikt, voegt de computer ze toe aan het ingebouwde codedocumentatiesysteem van de engine. Er is een ongelooflijk derde voordeel voor jou: door typehints te gebruiken, leer je types veel sneller. Het is uitstekend voor het leren. In de volgende oefeningen zul je de juiste typehints schrijven om de code foutloos te maken.
pt: Quando der dicas de linguagem assim, [i]previne[/i] os principais erros de tipo. Ao trabalhar na Godot, verá que o computador pode relatar problemas enquanto escreve o código. Isso faz o benefício ainda maior. As dicas de tipo também podem ajudar a melhorar a legibilidade do seu código e ajuda a por mais informação nele. Como vimos, os tipos são essenciais ao programar e, ao usar dicas de tipo, o computador os adicionará ao sistema de documentação de código integrado do mecanismo. Há um terceiro benefício incrível para si: usando dicas de tipo, aprenderá os tipos muito mais rápido. É excelente para aprender. Nas práticas a seguir, vai escrever as dicas de tipo corretas para livrar o código de erros.
tr: Dile bu şekilde belirteçler verdiğinizde, başlıca tip hatalarını [i]önleyecektir[/i]. Godot ile çalışırken, siz daha kodu yazarken bilgisayarın sorunları bildirebildiğini göreceksiniz. Bu, bunun faydasını daha da büyük hale getirir. Tip belirteçleri, kodun okunabilirliğini artırmaya da yardımcı olabilir. Koda, doğrudan daha fazla bilgi koymanıza yardımcı olabilir. Gördüğümüz gibi tipler, kodlama yaparken çok önemli, ve tip belirteçlerini kullanırken bilgisayar bunları, motorun yerleşik kod belgelendirme sistemine ekleyecektir. Sizin için inanılmaz bir üçüncü avantaj var: tip belirteçlerini kullanarak, tipleri çok daha hızlı öğrenirsiniz. Öğrenmek için harika. Sıradaki uygulamalarda, kodu hatasız hale getirmek için doğru tip belirteçlerini yazacaksınız.
zh_hans: 当你给编程语言这些类型提示时，它能[i]防止[/i]大多数的类型错误。当你在用Godot时，计算机可以在写代码的时候实时反馈各种问题。使用类型提示就更有帮助了。 类型提示还可以帮助提高代码的可读性。能让很多信息以直观的形式放在代码里。正如我们所看到的，活用类型在写代码时是必不可少的，当使用类型提示时，计算机就能对他们用上引擎内置的实时编程文档系统。 第三个好处，对你来说是好极了的：通过使用类型提示，你能更快地学习掌握不同的类型。对学习非常有益。 在以下练习中，你需要编写正确的类型提示，让代码远离类型错误。

source: Add the correct type hints to variables
es: Añade las sugerencias de tipo correctas a las variables
fr: Ajouter les suggestions de type correctes aux variables
it: Aggiungere il corretto suggerimento di tipo alle variabili
ja: 変数に正しい型ヒントを追加する
nl: De juiste typehints aan variabelen toevoegen
pt: Adicione as dicas de tipo corretas nas variáveis
tr: Değişkenlere doğru tip belirteçlerini eklemek
zh_hans: 向变量添加正确的类型提示

source: Our variables get the correct values but not the right hints. Using your type-fu, add the correct type names in the variable definitions. You need to write the type name between the colon and the equal sign. Note: You cannot use type inference in this practice. You need to write the type name in full.
es: Nuestras variables obtienen los valores correctos pero no las sugerencias correctas. Añade los nombres de tipo correctos en las definiciones de las variables. Tienes que escribir el nombre del tipo entre los dos puntos y el signo de igualdad. Nota: No puedes utilizar la inferencia de tipos en esta práctica. Debes escribir el nombre del tipo completo.
fr: Nos variables reçoivent les bonnes valeurs mais pas les bonnes suggestions. Ajoutez les noms de type corrects dans les définitions des variables. Vous devez écrire le nom du type entre le deux-points et le signe égal. Remarque : Vous ne pouvez pas utiliser la suggestion de type dans cet exercice. Vous devez écrire le nom du type en entier.
it: Le nostra variabili ottengono i corretti valori ma non i corretti suggerimenti di tipo. Usando la tecnica di tipizzazione delle variabili, aggiungi il corretto nome di tipo nelle definizioni delle variabili. Devi scrivere il tipo del nome tra i due punti e il segno di uguaglianza. Nota: Non puoi usare l'inferenza di tipo in questa pratica. Devi scrivere interamente il nome del tipo.
ja: 変数は正しい値を取得しますが、正しいヒントは取得しません。学習した型を使用して、変数定義に正しい型名を追加します。 コロンと等号の間に型名を書く必要があります。 注: この演習では、型の推論を使用できません。型名を完全に記述する必要があります。
nl: Onze variabelen krijgen de juiste waarden maar niet de juiste hints. Gebruik je typenkunst om de juiste typenamen toe te voegen aan de definities van de variabelen. Je moet de typenaam tussen de dubbele punt en het gelijkheidsteken schrijven. Let op: Je mag geen type-inferentie gebruiken in deze oefening. Je moet de typenaam voluit schrijven.
pt: Nossas variáveis obtêm os valores corretos, mas não as dicas de tipo corretas. Adicione os nomes de tipo corretos nas definições de variáveis. Precisa escrever o nome do tipo entre os dois pontos e o sinal de igual. Nota: Não pode usar a inferência de tipo nessa prática. Precisa escrever o nome do tipo por completo.
tr: Değişkenlerimiz doğru değerleri alıyor, ancak belirteçleri doğru değil. tip-fu yeteneğinizi kullanarak, değişken tanımlarına doğru tip isimlerini ekleyin. (tam sayı "int", ondalık sayı "float", dize için "String", vektörü hatırlarsınız) Tip adını iki nokta üst üste ve eşittir işareti arasına yazmanız gerekir. (iki nokta üstüste işaretinin solunda boşluk olmasın). Not: Bu uygulamada tip çıkarımını kullanamazsınız. Tip adını tam olarak yazmanız gerekiyor.
zh_hans: 我们的变量得到了正确的值，但是类型提示是错误的。用你刚学到的类型招式大展拳脚，为变量定义添加正确的类型名。 要在冒号和等号之间写入类型名称。 注意：这个练习中使用类型推断功能被禁用了。需要你写出完整的类型名称。

source: Our variables have the wrong type hints, causing errors. Correct them to make the code run.
es: Nuestras variables tienen sugerencias de tipo incorrectas, lo que provoca errores. Corrígelas para que el código se ejecute.
fr: Nos variables ont les mauvaises suggestions de type, ce qui provoque des erreurs. Corrigez-les pour que le code s'exécute.
it: Le nostre variabili hanno i suggerimenti di tipo sbagliati e causano degli errori. Correggili per rendere il codice eseguibile.
ja: 変数の型ヒントが間違っているため、エラーが発生します。これらを修正して、コードを実行します。
nl: Onze variabelen hebben de verkeerde typehints, wat foutmeldingen veroorzaakt. Corrigeer ze om de code te laten werken.
pt: Nossas variáveis têm as dicas de tipo erradas, causando erros. Corrija elas para executar o código.
tr: Değişkenlerimizin tip belirteçleri yanlış, ve bu hatalara neden oluyor. Kodun çalışmasını sağlamak için bunları düzeltin.
zh_hans: 变量的类型提示搞错了，就会导致错误。更正它们以使代码运行。

source: Fix the values to match the type hints
es: Corrige los valores para que coincidan con las sugerencias de tipo
fr: Corriger les valeurs pour qu'elles correspondent aux suggestions de type
it: Sistema i valori per abbinare i corretti suggerimenti di tipo
ja: 型ヒントと一致するように値を修正します
nl: Corrigeer de waarden zodat ze overeenkomen met de typehints
pt: Corrija os valores para corresponder às dicas de tipo
tr: Değerleri, tip belirteçleri ile eşleşecek şekilde düzeltmek
zh_hans: 修改变量的值以匹配类型提示

source: It is the other way around in this practice: the type hints are fine, but the values are not. Your task is to fix the values after the equal sign, so they match the type hint of each variable.
es: En esta práctica es al revés: las sugerencias de tipo están bien, pero los valores no. Tu tarea es corregir los valores después del signo de igual, para que coincidan con la sugerencia de tipo de cada variable.
fr: C'est l'inverse dans cette pratique : les suggestions de type sont correctes, mais les valeurs ne le sont pas. Votre tâche consiste à corriger les valeurs après le signe égal, afin qu'elles correspondent à la suggestion de type de chaque variable.
it: In questa pratica dovrai fare la cosa opposta: i suggerimenti di tipo sono corretti, ma i valori no. Il tuo obbiettivo è quello di sistemare i valori dopo il segno di uguaglianza, così ché si abbini con il suggerimento di tipo di ogni variabile.
ja: この方法では逆で、型ヒントは問題ありませんが、変数の値に問題があります。 ここでの作業は、等号の後の値を固定して、各変数の型ヒントと一致するようにすることです。
nl: In deze oefening is het andersom: de typehints zijn in orde, maar de waarden niet. Het is jouw taak om de waarden na het gelijkheidsteken te corrigeren, zodat ze overeenkomen met de typehint van elke variabele.
pt: É o contrário nesta prática: as dicas de tipo estão certas, mas os valores não estão. A sua tarefa é corrigir os valores após o sinal de igual, para que correspondam à dica de tipo de cada variável.
tr: Bu alıştırmada, önceki alıştırmanın tam tersi geçerli: tip belirteçleri doğru yerlerinde, ancak değerler yanlış. Göreviniz, eşittir işaretinden sonraki değerleri düzeltmek, böylece değişkenin tip belirteci ile eşleşsinler.
zh_hans: 这个练习又和上次恰恰相反：类型提示好得很，但是变量的值有问题。 你的任务是修改等号后的值，使它们与每个变量的类型提示相匹配。

source: This time, it's the other way around: variables have the correct type hints but the wrong values. Change the values to make the code run.
es: Esta vez, es al revés: las variables tienen las sugerencias de tipo correctas pero los valores equivocados. Cambia los valores para que el código se ejecute.
fr: Cette fois, c'est l'inverse : les variables ont les bonnes suggestions de type mais les mauvaises valeurs. Changez les valeurs pour que le code s'exécute.
it: Questa volta è al contrario: le variabili hanno i corretti suggerimenti di tipo ma i valori sbagliati. Cambia i valori per far sì che il codice esegua.
ja: 今回はその逆で、変数の型ヒントは正しいが、値が間違っている。値を変更してコードを実行します。
nl: Deze keer is het andersom: variabelen hebben de juiste hints maar de verkeerde waarden. Verander de waarden om de code te laten werken.
pt: Dessa vez, é o contrário: as variáveis têm as dicas de tipo corretas, mas os valores errados. Altere os valores para executar o código.
tr: Bu sefer tam tersi: değişkenler tip belirteçleri doğru, ancak değerleri yanlış. Kodun çalışmasını sağlamak için değerleri değiştirin.
zh_hans: 这次的情况正好相反：变量有正确的类型提示，但错误的值。 修改值以使代码运行。

source: Specifying types with type hints
es: Especificación de tipos con sugerencias de tipo
fr: Spécification de types avec des suggestions de type
it: Specificando i tipi con i suggerimenti di tipo
ja: 型ヒントによる型の指定
nl: Types specificeren met typehints
pt: Especificando tipos com dicas de tipo
tr: Değer tiplerini, tip belirteçleri ile belirtmek
zh_hans: 用类型提示功能指定变量类型

source: Games use grids all the time, be it for grid-based gameplay or to make algorithms faster. When working with grids, you need to convert grid coordinates into positions in the game world all the time. To do so, you give each cell a size in pixels. You'll likely pick one of two types for that: [code]float[/code] or [code]Vector2[/code], because pixel positions on the screen use [code]Vector2[/code] coordinates. Either of those two values would be fine:
fr: Les jeux utilisent des grilles tout le temps, que ce soit pour un gameplay basé sur une grille ou pour rendre les algorithmes plus rapides. Lorsque vous travaillez avec des grilles, vous devez convertir les coordonnées de la grille en positions du monde du jeu tout le temps. Pour ce faire, vous donnez à chaque case une taille en pixels. Vous choisirez probablement l'un des deux types suivants pour cela : [code]float[/code] ou [code]Vector2[/code], car les positions des pixels sur l'écran utilisent des coordonnées [code]Vector2[/code]. L'une ou l'autre de ces deux valeurs ferait l'affaire :
ja: ゲームでは、グリッドベースのゲームプレイやアルゴリズムの高速化など、常にグリッドが使用されています。 グリッドを操作するときは、グリッド座標を常にゲームワールド内の位置に変換する必要があります。これを行うには、各セルにピクセル単位のサイズを指定します。 画面上のピクセル位置は [code]Vector2[/code] 座標を使用するため、[code]float[/code] または [code]Vector2[/code] の 2 つのタイプのいずれかを選択する可能性があります。 これら 2 つの値のいずれかで問題ありません。
nl: Games maken heel vaak gebruik van rasters, of het nu is voor rastergebaseerde gameplay of om algoritmes sneller te maken. Als je met rasters werkt, moet je rastercoördinaten altijd omzetten naar posities in de spelwereld. Om dat te doen, geef je elke cel een grootte in pixels. Daarvoor kies je waarschijnlijk een van de twee types: [code]float[/code] of [code]Vector2[/code], omdat pixelposities op het scherm [code]Vector2[/code] coördinaten gebruiken. Elk van deze twee waarden is prima:
tr: Oyunlar, ızgara-tabanlı bir oyun için, veya algoritmaları daha hızlı hale getirmek için, her zaman ızgaraları kullanır. Izgaralarla çalışırken her zaman, ızgara koordinatlarını oyun dünyasındaki konumlara dönüştürmeniz gerekir. Bunu yapmak için, her hücreye piksel cinsinden bir boyut verirsiniz. Bunun için muhtemelen iki tipten birini seçeceksiniz: [code]float[/code] (ondalık sayı) veya [code]Vector2[/code], çünkü ekrandaki piksel konumları [code]Vector2[/code] kullanır. Bu değerlerin ikisi de işimizi görür:
zh_hans: 游戏总会用到各种网格，无论是基于网格实现各种玩法，还是用网格让算法更快速。 使用网格时，始终得将网格坐标转换为游戏世界的坐标。 为此，需要为单元格设定好它的像素大小。 为此你可能会用到以下两种类型的一种：[code]float[/code] 或 [code]Vector2[/code]，因为屏幕上的像素位置用的也是[code]Vector2[/code]坐标。 这两种类型的值都可以：
