Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-19-creating-arrays.po
Languages: it, ja, tr, zh_hans

source: The [code]range()[/code] function we saw in the previous lesson outputs a list of numbers. For example, calling [code]range(3)[/code] produces the list of numbers [code][0, 1, 2][/code].
it: Abbiamo visto nelle lezioni precedenti che la funzione [code]range()[/code] da come risultato una lista di numeri. Per esempio, chiamare la funzione [code]range(3)[/code] produce la lista [code][0, 1, 2][/code].
ja: 前のレッスンで見た [code]range()[/code] 関数は、数値のリストを出力します。たとえば、[code]range(3)[/code] を呼び出すと、数値のリスト [code][0, 1, 2][/code] が生成されます。
tr: Önceki derste gördüğümüz [code]range()[/code] fonksiyonu, bir sayı listesi çıktısı verir. Örneğin, [code]range(3)[/code] çağrısı, [code][0, 1, 2][/code] sayı listesini üretir.
zh_hans: 我们在上一课中看到的 [code]range()[/code] 函数会输出一个数字列表。 例如，调用 [code]range(3)[/code] 会生成数字列表 [code][0, 1, 2][/code]。

source: A list of values, numbers or otherwise, has a precise name in code: we call it an [i]array[/i]. So we can say calling the [code]range()[/code] function produces an [i]array[/i] of numbers. We could directly write and use that array inside our [code]for[/code] loop instead of the [code]range()[/code] function. You can run the next function step-by-step to see how it works.
it: Un elenco di valori, numeri o altro, ha un nome preciso nel codice: lo chiamiamo [i]array[/i]. Quindi possiamo dire che chiamando la funzione [code]range()[/code] si ottiene un [i]array[/i] di numeri. Potremmo scrivere e utilizzare direttamente questo array all'interno del nostro ciclo [code]for[/code] invece della funzione [code]range()[/code]. È possibile eseguire la funzione successiva passo per passo per vedere come funziona.
ja: 値のリスト (数値など) には、コード内で正確な名前が付けられます。これを[i]配列[/i]と呼びます。したがって、[code]range()[/code]関数を呼び出すと、数値の[i]配列[/i]が生成されると言えます。 [code]range()[/code]関数の代わりに[code]for[/code]ループ内でその配列を直接記述して使用できます。次の関数を段階的に実行して、それがどのように機能するかを確認できます。
tr: Sayı ya da başka tipte değerlerden oluşan bir listenin kodlamada özel bir ismi var: buna [i]dizi[/i] diyoruz. Yani, [code]range()[/code] fonksiyonunu çağırmanın sayılardan oluşan bir [i]dizi[/i] ürettiğini söyleyebiliriz. Böyle diziyi, [code]range()[/code] fonksiyonu yerine, doğrudan [code]for[/code] döngümüzün içine yazabilir ve kullanabiliriz. Nasıl çalıştığını görmek için bir sonraki fonksiyonu adım adım çalıştırabilirsin.
zh_hans: 数值或其他值的列表在代码中有一个准确的名称：我们称之为 [i]数组(array)[/i]。因此，我们可以说调用 [code]range()[/code] 函数产生了一个由数字构成的[i]数组[/i] 。 可以直接在 [code]for[/code] 循环中编写并使用该数组，而不用再写 [code]range()[/code] 函数。你可以逐步（step）运行下面这个函数，看看它是如何工作的。

source: As you can see, the code still works the same. Notice that when we create a [code]for[/code] loop, we also create a local variable to which the loop assigns one value per iteration. Above, we named it [code]number[/code] because the array we loop over contains three numbers (0, 1, and 2). But we could name it anything we'd like!
it: Come si può vedere, il codice funziona ancora allo stesso modo. Notate che quando creiamo un ciclo [code]for[/code], creiamo anche una variabile locale alla quale il ciclo assegna un valore per ogni iterazione. Qui sopra l'abbiamo chiamata [code]numero[/code], perché l'array su cui eseguiamo il ciclo contiene tre numeri (0, 1 e 2). Ma possiamo chiamarla come vogliamo!
ja: ご覧のとおり、コードは同じように機能します。[code]for[/code] ループを作成するときは、ループが反復ごとに 1 つの値を割り当てるローカル変数も作成します。上記では、ループする配列に 3 つの数値 (0、1、2) が含まれているため、[code]number[/code] という名前を付けました。 しかし、好きな名前を付けることができます！
tr: Gördüğün gibi, kod hala aynı şekilde çalışıyor. Bir [code]for[/code] döngüsü oluşturduğumuzda, döngünün her yineleme için yeni bir değer atadığı bir yerel değişken de oluşturduğumuza dikkat et. Yukarıda, üzerinde döngü yaptığımız dizi üç sayı (0, 1 ve 2) içerdiği için bu değişkene [code]number[/code] adını verdik. Ama ona istediğimiz ismi verebilirdik!
zh_hans: 正如你所看到的，代码工作起来还是一样的。请注意，当我们创建一个 [code]for[/code] 循环时，同时也创建了一个局部变量，该循环每次迭代都会为其赋值。在上面，我们将其命名为 [code]number[/code]，因为我们循环的数组包含三个数字（0、1 和 2）。 不过，我们也可以给它取任何名字！

source: If we "unwrap" the [code]for[/code] loop above, we'd get the following code with the exact same behaviour:
it: Se "scartiamo" il ciclo [code]for[/code] di cui sopra, otterremo il seguente codice con lo stesso identico comportamento:
ja: 上記の [code]for[/code] ループを「アンラップ」すると、まったく同じ動作の次のコードが得られます。
tr: Eğer yukarıdaki [code]for[/code] döngüsünü "açarsak", tamamen aynı davranışa sahip aşağıdaki kodu elde ederiz:
zh_hans: 如果我们 "展开 "上面的 [code]for[/code] 循环，就会得到以下代码，其行为完全相同：

source: The syntax of arrays
it: La sintassi degli array
ja: 配列の構文
tr: Dizilerin sözdizimi
zh_hans: 数组的语法

source: We write arrays this way in GDScript.
it: Scriviamo gli array in questo modo in GDScript.
ja: GDScriptではこのように配列を記述します。
tr: GDScript'te, dizileri bu şekilde yazıyoruz.
zh_hans: 我们在 GDScript 中以这种方式编写数组。

source: You start with an opening square bracket. Then, you write comma-separated values that compose the array. Finally, you need a closing square bracket to complete the array. Here are a couple of valid arrays. Notice how you can mix values, and how they don't need to follow one another.
it: Inizi aprendo una parentesi quadra. Poi, scrivi i valori che compongono l'array separati da una virgola. In fine, inserisci la parentesi quadra di chiusura per completare 'array. Ecco una serie di array validi. Nota bene che puoi usare diversi tipi di valori e questi non devono conformarsi l'uno agli altri.
ja: 左角括弧で開始します。次に、配列を構成するコンマ区切り値を記述します。最後に、配列を完成させるには、閉じ角括弧が必要です。 有効な配列をいくつか紹介します。値を混在させる方法と、値を互いに追従させる必要がないことに注目してください。
tr: Açılan köşeli parantez ile başlarsın. Ardından, diziyi oluşturan değerleri, virgülle ayırıp yazarsın. Son olarak, diziyi tamamlamak için bir kapanan köşeli paranteze ihtiyacın var. İşte birkaç tane geçerli dizi örneği. Değerleri karışık verebileceğine ve sıralı olmaları gerekmediğine dikkat et.
zh_hans: 从一个方括号开始。 然后，写组成数组的值，用逗号分隔。 最后，需要一个右方括号来完成数组。 这是几个有效的数组。 你会发现可以在里面混合各种值，并且它们不用从小到大挨着排。

source: Because arrays themselves are a value type, just like numbers or [code]Vector2[/code], we can assign arrays to variables to reaccess them later. That'll come in handy in the next lesson, where we'll use those variables in loops.
it: Perché gli array sono lo ro stessi un tipo di valore, così come i numeri o i [code]Vector2[/code], possiamo assegnare array a variabili per ri-accedervi in seguito. Questo tornerà utile nella prossima lezione, in cui useremo queste variabili all'interno di cicli.
ja: 配列自体は数値や [code]Vector2[/code] と同様に値型であるため、配列を変数に代入して後で再アクセスできます。 これは、これらの変数をループで使用する次のレッスンで役に立ちます。
tr: Dizilerin kendileri de, tıpkı sayılar ve [code]Vector2[/code] gibi bir değer tipi olduğundan, bunlara daha sonra yeniden erişmek için değişkenlere atayabiliriz. Bu değişkenler, onları döngülerin içinde kullanacağımız sonraki dersimizde çok işimize yarayacak.
zh_hans: 因为数组本身是一种值的类型，就像数字或 [code]Vector2[/code] 一样，我们可以将数组分配给变量以便之后重新访问它们。 下一课会用到这种好方法，到时候得在循环中使用这些数组变量。

source: But first, let's see [i]when[/i] you'd use an array.
it: Ma prima, vediamo [i]quando[/i] dovresti usare un array.
ja: しかし、その前に、配列を[i]いつ[/i]使用するかを見てみましょう。
tr: Ama önce bir diziyi [i]ne zaman[/i] kullanacağınızı görelim.
zh_hans: 在此之前，让我们先看看数组该 [i]什么时候[/i] 使用。

source: When you use arrays
it: Quando usi gli array
ja: 配列を使用する場合
tr: Dizileri ne zaman kullanırsın
zh_hans: 要用上数组的时候

source: In computer programming, we use arrays [i]all the time[/i]. Precisely, you'll use them whenever you need to store a [i]list of things[/i]. You always need lists of things in games: - The player's party in an RPG. - The items in the player's inventory. - The high scores in an arcade game. - The objects in the game world. All of those and many more rely on arrays.
it: In programmazione informatica, usiamo gli array [i]tutte le volte[/i]. Precisamente, li userai ogniqualvolta che devi conservare una [i]lista di cose[/i]. Hai sempre bisogno di liste nei videogiochi: - Il party del giocatore in un RPG. - Gli oggetti nell'inventario del giocatore. - I record all'interno di un gioco arcade. - Gli oggetti nel mondo di gioco. Tutti questi e molti altri fanno affidamento su degli array.
ja: コンピュータプログラミングでは、[i]常に[/i]配列を使用します。 正確には、[i]リスト[/i]を保存する必要があるときに使用します。 ゲームには常にリストが必要です。 - RPGにおけるプレイヤーのパーティー。 - プレイヤーのインベントリ内のアイテム。 - アーケードゲームのハイスコア。 - ゲームワールド内のオブジェクト。 これらすべて、そしてさらに多くのものが配列に依存しています。
tr: Bilgisayar programlamada, [i]dizilerini her zaman[/i] kullanırız. Kesin olmak gerekirse, [i]bir şeylerin listesi[/i]'ni saklaman gerektiğinde bunları kullanacaksın. Oyunlarda her zaman listelere ihtiyaç duyarsın: - Bir RPG'de (rol yapma oyunu) oyuncunun takımı. - Oyuncunun deposundaki eşyalar. - Bir arcade (salon tarzı) oyunundaki yüksek skorlar. - Oyun dünyası içindeki nesneler. Bunların hepsi ve daha fazlası dizilere bel bağlar.
zh_hans: 在计算机编程中，数组可以说是[i]从早到晚[/i]都在用。 准确地说，每当你需要存储 [i] 一系列的东西 [/i] 时，你就会用到它。 并且游戏中总是有各种系列的事物： - 角色扮演游戏（RPG）中玩家的队伍。 - 玩家库存中的物品。 - 街机游戏中的高分排行榜。 - 游戏世界中的所有对象。 上述这些以及各种别的东西都依赖于数组。

source: Using arrays to follow a path
it: Usando gli array per seguire un percorso
ja: 配列を使用してパスをたどる
tr: Bir yolu takip etmek için dizileri kullanmak
zh_hans: 使用数组沿路线走

source: Let's look at a widespread use of arrays in games: finding and following a path. In games, you need allies or monsters to find their way to their target, whether it's the player or some point of interest. To achieve that, we use [i]pathfinding algorithms[/i]. As the name suggests, those algorithms find the path between two points and allow AIs to traverse the game.
it: Vediamo un uso diffuso degli array nei giochi: trovare e seguire un percorso. Nei giochi, è necessario che gli alleati o i mostri trovino la strada per raggiungere il loro obiettivo, che sia il giocatore o un punto di interesse. Per raggiungere questo obiettivo, utilizziamo [i]algoritmi di pathfinding[/i]. Come suggerisce il nome, questi algoritmi trovano il percorso tra due punti e permettono alle IA di attraversare il gioco.
ja: ゲームで広く使われている配列、つまりパスを見つけてたどる方法を見てみましょう。 ゲームでは、プレイヤーであろうと興味のある場所であろうと、ターゲットへの道を見つけるために味方やモンスターが必要です。 これを実現するために、[i]経路探索アルゴリズム[/i]を使用します。名前が示すように、これらのアルゴリズムは2点間のパスを見つけ、AIがゲームを横断できるようにします。
tr: Dizilerin, oyunlardaki yaygın bir kullanımına bakalım: bir yolu bulmak ve onu takip etmek. Oyunlarda, müttefik oyuncular veya canavarların, hedeflerine giden yolu, mesela oyuncuya yada ilgi çekici bir noktaya doğru, bulmalarına ihtiyacın vardır. Bunu başarmak için [i]yol-bulma algoritmaları [/i] kullanıyoruz. Adından da anlaşılacağı gibi, bu algoritmalar iki nokta arasındaki yolu bulur, ve AI'ların (yapay zeka, Artificial Intelligence) oyunda dolaşmasına olanak sağlar.
zh_hans: 在游戏中，数组的一个广泛应用就是：查找和跟随一个路径。 在游戏中，队友或怪物得能找到通往目标的路线，无论是为了玩家的利益还是别的什么原因。 为此，我们要用上[i]寻路算法[/i]。 顾名思义，这些算法会找到两点之间的路径并允许 AI 通过。

source: Many of those algorithms use arrays of [code]Vector2[/code] coordinates to represent the path. Take this turtle pet. It wants to follow the robot, but there are rocks in the way. How can we tell it where to walk to reach the robot? With an array!
it: Molti di questi algoritmi usano array di coordinate in [code]Vector2[/code] che rappresentato un percorso. Guarda questo cucciolo di tartaruga. Vuole seguire il robot, ma ci sono rocce ad ostacolarla. Come possiamo dirle dove andare per raggiungere il robot? Con un array!
ja: これらのアルゴリズムの多くは、[code]Vector2[/code] 座標の配列を使用してパスを表します。 このカメのペットを取ります。ロボットを追いかけようとしますが、岩が邪魔をしています。 ロボットにたどり着くためにどこを歩けばよいか、どのように判断すればよいのでしょうか?配列付き!
tr: Bu algoritmaların çoğu, yolu temsil etmek için [code]Vector2[/code] tipinde konum dizilerini kullanır. Bu evcil kaplumbağayı ele alalım. Robotu takip etmek istiyor ama önünde kayalar var. Robota ulaşmak için nereden yürümesi gerektiğini nasıl söyleyebiliriz? Bir dizi ile!
zh_hans: 很多寻路算法使用 [code]Vector2[/code] 坐标数组来表示路径。 带上这只海龟宠物。 它想跟随机器人，但是有石头挡路。 我们怎样才能告诉它走到机器人的移动方法？ 用一个数组来实现！

source: Every value in the array is a [code]Vector2[/code] and represents a cell the turtle needs to walk through. Together, all the values in the array represent a path we can draw.
it: Ogni valore nell'array [code]Vector2[/code] e rappresenta una cella che la tartaruga deve attraversare. Insieme, tutti i valori dell'array rappresentano un percorso che noi possiamo designare.
ja: 配列内のすべての値は [code]Vector2[/code] であり、カメが歩く必要のあるセルを表します。 配列内のすべての値が一緒になって、描画できるパスを表します。
tr: Dizideki her değer bir [code]Vector2[/code] değeridir ve kaplumbağanın geçmesi gereken bir hücreyi temsil eder. Birlikte, dizideki değerlerin tümü bize, çizebileceğimiz bir yolu gösterir.
zh_hans: 在这个数组里的每个值都是一个 [code]Vector2[/code]，代表海龟需要经过的一个单元格。 数组中的所有值连起来就代表了一条可绘制的路径。

source: In upcoming lessons, you will see how we can use arrays to store player inventories or design attack combos. For now, let's practice creating arrays.
it: Nelle prossime lezioni, vedrai come usiamo gli array per immagazzinare inventari di giocatori o per progettare combo di attacchi. Per ora, facciamo pratica a creare array.
ja: 今後のレッスンでは、配列を使用してプレイヤーのインベントリを保存したり、攻撃コンボを設計したりする方法を説明します。 とりあえず、配列の作成を演習しましょう。
tr: İlerleyen derslerde, oyuncunun eşya deposunu tutmak veya birleşik saldırılar tasarlamak için dizileri nasıl kullanabileceğimizi göreceksin. Ama şimdilik, dizi oluşturma alıştırması yapalım.
zh_hans: 在接下来的课程中，你会看到使用数组存储玩家的背包，或者设计攻击组合（combos）的方法。 但是现在，让我们来练习创建数组。

source: Walking to the robot
it: Arrivare fino al robot
ja: ロボットに歩み寄る
tr: Robota doğru yürümek
zh_hans: 走向机器人

source: The turtle wants to meet the robot! But it cannot find it on its own. Fill the [code]turtle_path[/code] array with [code]Vector2[/code] coordinates indicating where the turtle should move to avoid the obstacles and arrive safely to the robot. The turtle can move up, down, left, or right. It cannot move diagonally. We recommend copying and pasting to fill the array with comma-separated [code]Vector2[/code] values quickly.
it: La tartaruga vuole incontrare il robot! Ma non può farlo da sola. Riempi l'array [code]turtle_path[/code] con coordinate [code]Vector2[/code] che indicano dove la tartaruga dovrebbe andare per evitare gli ostacoli e arrivare in sicurezza al robot. La tartaruga si può muovere sopra, sotto, a destra e a sinistra. Non si può muovere diagoonalmente. Ti consigliamo di copiare e incollare per riempire rapidamente l'array con valori [code]Vector2[/code] separati da virgole.
ja: カメはロボットに会いたがっています!しかし、それはそれ自身でそれを見つけることはできません。 [code]turtle_path[/code] 配列に、障害物を避けてロボットに安全に到達するためにカメが移動する場所を示す [code]Vector2[/code] 座標を入力します。 カメは上下左右に移動できます。斜めに動くことはできません。 コピー&ペーストして、配列にコンマ区切りの [code]Vector2[/code] 値をすばやく入力することをお勧めします。
tr: Kaplumbağa, robotla tanışmak istiyor! Ama onu kendi başına bulamaz. [code]turtle_path[/code] dizisini, kaplumbağanın engellerden kaçınmak ve robota güvenli bir şekilde ulaşmak için nereye hareket etmesi gerektiğini gösteren [code]Vector2[/code] koordinatlarıyla doldur. Kaplumbağa yukarı, aşağı, sola veya sağa hareket edebilir. Ancak çapraz hareket edemez. Diziyi virgülle ayrılmış [code]Vector2[/code] değerleriyle hızlı bir şekilde doldurmak için, kopyala-yapıştır yapmanı öneririz.
zh_hans: 小海龟想和机器人汇合！ 但仅靠它自己没法找到。 用 [code]Vector2[/code] 坐标填充 [code]turtle_path[/code] （海龟路径）数组，指示海龟选择移动的位置，避开障碍物并安全到达机器人。 小海龟可以上下左右移动。 不能沿对角线移动。 建议复制粘贴有一个分隔逗号的 [code]Vector2[/code] 值来快速填充数组（然后再往里面填数字）。

source: Help the turtle find its way to the robot! Give it a path to follow to reach the robot.
it: Aiuta la tartaruga ad arrivare dal robot! Dagli un percorso da seguire per raggiungere il robot.
ja: カメがロボットへの道を見つけるのを手伝ってください!ロボットにたどり着くための経路を指定します。
tr: Kaplumbağanın robota giden yolu bulmasına yardım et! Robota ulaşmak için, izlemesi gereken bir yol ver.
zh_hans: 帮助小海龟找到通往机器人的位置的路！ 告诉它一条去找机器人的路径。

source: Selecting units
it: Selezionando unità
ja: ユニットの選択
tr: Birimlerin seçilmesi
zh_hans: 选中单位

source: In this tactical game, the player and computer can select multiple units at once. You need to call the [code]select_units()[/code] function and pass it an array of [code]Vector2[/code] coordinates to know which units to select. Each [code]Vector2[/code] in the array represents a cell with a unit. You can pass arrays in function calls as arguments. As an array is a value type the computer recognizes, you can pass the whole array as a single function argument. Select all units on the board by passing the correct array to the [code]select_units()[/code] function.
it: In questo gioco tattico, il giocatore e il computer possono selezionare più unità allo stesso momento. Devi chiamare la funzione [code]select_units()[/code] e passarle un array di coordinate [code]Vector2[/code] per sapere quale unità selezionare. Ogni [code]Vector2[/code] nell'array rappresenta una cella con un'unità. Puoi passare array quando chiami delle funzioni come argomenti. Dato che l'array è un tipo di valore che il computer riconosce, puoi passare un'intero array come un singolo argomento di una funzione. Seleziona tutte le unità sulla tavola passandogli l'array corretto alla funzione [code]select_units()[/code].
ja: この戦術ゲームでは、プレイヤーとコンピューターは一度に複数のユニットを選択できます。[code]select_units()[/code]関数を呼び出し、[code]Vector2[/code]座標の配列を渡して、選択する単位を知る必要があります。 配列内の各 [code]Vector2[/code] は、単位を持つセルを表します。 関数呼び出しで配列を引数として渡すことができます。配列はコンピューターが認識する値型であるため、配列全体を 1 つの関数引数として渡すことができます。 正しい配列を [code]select_units()[/code] 関数に渡して、ボード上のすべてのユニットを選択します。
tr: Bu taktiksel oyunda, oyuncu ve bilgisayar aynı anda birden fazla birim seçebilir. Hangi birimlerin seçileceğini bilmek için, [code]select_units()[/code] fonksiyonunu çağırman ve ona [code]Vector2[/code] konumlarında oluşan bir dizi vermen gerekiyor. Dizideki her bir [code]Vector2[/code] değeri, bir hücreyi temsil eder. Dizileri fonksiyon çağrılarında girilen değişken olarak geçirebilirsin. Bir dizi, bilgisayarın tanıdığı bir değer tipi olduğundan, tüm diziyi tek bir girdi değişkeni olarak geçirebilirsin. [code]select_units()[/code] fonksiyonuna doğru diziyi geçirerek tahta üstündeki tüm birimleri seç. (birimlerin durduğu hücrelerin konum sayılarını, diğer sayılara bakıp çıkarabilirsin).
zh_hans: 在这个战术游戏中，玩家和电脑可以同时选中多个单位。 你需要调用 [code]select_units()[/code] （选择单位）函数并将 [code]Vector2[/code] 坐标数组传递给它，来告诉它要选中的单位。 数组中的每个 [code]Vector2[/code] 代表一个单元格。 你可以在函数调用中将数组作为参数传递（填在函数的括号里）。 由于数组是计算机可识别的值类型，你可以将整个数组作为单个函数参数传递。 通过将正确的数组传递给 [code]select_units()[/code] 函数来让它选中棋盘上的所有单元。

source: Write an array to select all units on the board in this strategy game.
it: Scrivi un array per selezionare tutte le unità sulla tavola in questo gioco di strategia.
ja: この戦略ゲームでボード上のすべてのユニットを選択するための配列を記述します。
tr: Bu strateji oyununda, tüm birimleri seçmek için bir dizi yaz.
zh_hans: 在策略游戏里，写一个数组，选中棋盘上的所有单位。

source: Creating arrays
it: Creando array
ja: 配列の作成
tr: Diziler oluşturmak
zh_hans: 创建数组
