Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-22-functions-return-values.po
Languages: da, de, es, fr, it, ja, nl, pl, pt_br, ru, tr, uk, zh_hans

source: Until now, you learned that functions are a way to group instructions, give them a name, and reuse them.
da: Indtil nu har du lært, at funktioner er en måde at gruppere instruktioner, give dem et navn og genbruge dem.
uk: Дотепер ви знали, що функції — це послідовності інструкцій, яким ви даєте ім’я, яке ви можете викликати будь-коли.

source: Functions can also make calculations and [i]return[/i] new values.
da: Funktioner kan også foretage beregninger og [i]returnere[/i] nye værdier.
uk: Крім того, функції можуть виконувати обчислення та [i]повертати[/i] нові значення.

source: Let's look at some examples to see why this is useful.
da: Lad os se på nogle eksempler for at se, hvorfor dette er nyttigt.
uk: Давайте розглянемо кілька прикладів, щоб зрозуміти, чому це корисно.

source: Built-in functions that return a value
da: Indbygget funktioner, der returnerer en værdi
de: Integrierte Funktionen, die einen Wert zurückgeben
es: Funciones incorporadas que devuelven un valor
fr: Fonctions intégrées qui renvoient une valeur
it: Funzioni predefinite che ritornano un valore
ja: 値を返す組み込み関数
nl: Ingebouwde functies die een waarde teruggeven
pl: Wbudowane funkcje, które zwracają wartość
pt_br: Funções internas prontas que retornam um valor
ru: Встроенные функции, возвращающие значение
tr: Bir değer döndüren yerleşik fonksiyonlar
uk: Вбудовані функції, які повертають значення
zh_hans: 返回一个值的内置函数

source: Many functions built into GDScript make calculations and return a new value.
da: Mange funktioner indbygget i GDScript laver beregninger og returnerer en ny værdi.
pl: Wiele funkcji wbudowanych w GDScript wykonuje obliczenia i zwraca nową wartość.
uk: Багато функцій, вбудованих у GDScript, виконують обчислення та повертають нове значення.

source: For example, the [code]round()[/code] function takes a decimal number as an argument and gives you back a new whole number rounded to the nearest digit.
da: For eksempel tager funktionen [code]round()[/code] et decimaltal som argument og giver dig et nyt heltal afrundet til nærmeste ciffer.
uk: Наприклад, функція [code]round()[/code] приймає десяткове число як аргумент і повертає вам нове число, округлене до найближчої цифри.

source: Imagine you have a game where you track the player's health as a percentage, a decimal number going from [code]0.0[/code] to [code]100.0[/code].
da: Forestil dig et spil, hvor du sporer spillerens liv i procent, et decimaltal der går fra [code]0.0[/code] til [code]100.0[/code].
pl: Wyobraź sobie, że masz grę, w której śledzisz zdrowie gracza jako procent, liczbę dziesiętną od \[code]0.0\[/code] do \[code]100.0\[/code].
uk: Уявіть, що у вас є гра, у якій ви відстежуєте здоров’я гравця у відсотках, десяткове число від [code]0.0[/code] до [code]100.0[/code].

source: When displaying the health on the interface, you don't want to show the decimal part. In that case, you may use the [code]round()[/code] function, like so.
da: Når livet vises på brugerfladen, ønsker du ikke at vise decimaldelen. I så fald kan du bruge funktionen [code]round()[/code] på denne måde.
pl: Podczas wyświetlania zdrowia w interfejsie nie chcesz pokazywać części dziesiętnej. W takim przypadku możesz użyć funkcji \[code]round()\[/code], w ten sposób.
uk: Під час відображення здоров’я в інтерфейсі ви не хочете показувати десяткову частину. У такому випадку ви можете використати функцію [code]round()[/code], наприклад.

source: Notice how we assign the result of the function call to a variable. Because the [code]round()[/code] function returns a [i]new[/i] value, we need to either store the result in a variable or use the value immediately.
da: Bemærk, hvordan vi tildeler resultatet af funktionskaldet til en variabel. Fordi funktionen [code]round()[/code] returnerer en [i]ny[/i] værdi, skal vi enten gemme resultatet i en variabel eller bruge værdien med det samme.
uk: Зверніть увагу, як ми присвоюємо результат виклику функції змінній. Оскільки функція [code]round()[/code] повертає [i]нове[/i] значення, нам потрібно або зберегти результат, або негайно використати значення.

source: Above, we assigned it to a variable, but you could also do the following.
da: Ovenfor tildelte vi det til en variabel, men du kan også gøre følgende.
pl: Powyżej przypisaliśmy wynik do zmiennej, ale moglibyśmy też zrobić to w taki sposób.
uk: Вище ми призначили його змінній, але ви також можете зробити наступне.

source: If you need to use a returned value more than once, store it in a variable first. Otherwise, you can use the function call directly where you need it.
da: Hvis du har brug for at bruge en returneret værdi mere end én gang, skal du først gemme den i en variabel. Ellers kan du bruge funktionskaldet direkte der, hvor du har brug for det.
uk: Якщо вам потрібно використовувати повернуте значення більше одного разу, спочатку збережіть його у змінній. В іншому випадку ви можете використовувати виклик функції безпосередньо там, де він вам потрібен.

source: A cooler example: lerp()
da: Et smartere eksempel: lerp()
de: Ein cooleres Beispiel: lerp()
es: Un ejemplo más interesante: lerp()
fr: Un exemple un peu plus intéressant : lerp()
it: Un esempio più interessante: lerp()
ja: よりクールな例: lerp()
nl: Een cooler voorbeeld: lerp()
pl: Ciekawszy przykład: [code]lerp()[/code]
pt_br: Um exemplo mais legal: lerp()
ru: Пример покруче: lerp()
tr: Daha havalı bir örnek: lerp()
uk: Більш крутий приклад: lerp()
zh_hans: 更酷的例子：lerp()函数

source: The [code]lerp()[/code] function (short for [i]linear interpolate[/i]), blends between two values.
da: Funktionen [code]lerp()[/code] (forkortelse for [i]lineær interpolering[/i]) blander mellem to værdier.
uk: Функція [code]lerp()[/code] (скорочення від [i]linear interpolate[/i]) змішує два значення.

source: It takes three arguments: a start value, an end value, and a blend amount between [code]0.0[/code] and [code]1.0[/code] that controls the blend. A value of [code]0.0[/code] gives you the start value, [code]1.0[/code] gives you the end value, and [code]0.5[/code] gives you halfway between them.
da: Den kræver tre argumenter: en startværdi, en slutværdi og en blandingsmængde mellem [code]0.0[/code] og [code]1.0[/code], der styrer blandingen. En værdi på [code]0.0[/code] giver dig startværdien, [code]1.0[/code] giver dig slutværdien, og [code]0.5[/code] giver dig midt imellem dem.
uk: Він приймає три аргументи: початкове значення, кінцеве значення та величину змішування між [code]0.0[/code] і [code]1.0[/code], яка контролює змішування. Значення [code]0.0[/code] дає початкове значення, [code]1.0[/code] дає кінцеве значення, а [code]0.5[/code] дає значення посередині між ними.

source: In games, [code]lerp()[/code] is often used to make things move smoothly towards a target.
da: I spil bruges [code]lerp()[/code] ofte til at få ting til at bevæge sig gnidningsløst mod et mål.
uk: В іграх [code]lerp()[/code] часто використовується для плавного переміщення об'єктів до цілі.

source: [b]Note:[/b] In the code example below, I wrote the [code]lerp()[/code] function call across multiple lines for readability. This works exactly the same as writing it on one line.
da: [b]Bemærk:[/b] I kodeeksemplet nedenfor skrev jeg funktionskaldet [code]lerp()[/code] på tværs af flere linjer for at sikre læsbarheden. Dette fungerer på præcis samme måde som at skrive det på én linje.
uk: [b]Примітка:[/b] У наведеному нижче прикладі коду я написав виклик функції [code]lerp()[/code] у декількох рядках для зручності читання. Це працює точно так само, як і написання в одному рядку.

source: Every frame, the code calculates a position somewhere between the turtle and the mouse cursor. The [code]lerp()[/code] function takes care of everything.
da: For hver frame beregner koden en position et sted mellem skildpadden og musemarkøren. Funktionen [code]lerp()[/code] tager sig af alt.
pl: Co klatkę kod oblicza pozycję gdzieś pomiędzy żółwiem a kursorem myszy. Funkcja \[code]lerp()\[/code] zajmuje się wszystkim.
uk: Кожен кадр код обчислює позицію десь між черепашкою та курсором миші. Функція [code]lerp()[/code] подбає про все.

source: It's not the most robust approach for smooth movement, as you'll learn in the future, but it's a helpful function nonetheless.
da: Det er ikke den mest robuste metode til jævn bevægelse, som du vil lære i fremtiden, men det er ikke desto mindre en nyttig funktion.
pl: To nie jest najpewniejsze podejście do płynnego ruchu, o czym dowiesz się w przyszłości, ale mimo wszystko jest to przydatna funkcja.
uk: Це не найнадійніший підхід для плавного руху, як ви дізнаєтесь у майбутньому, але все ж це корисна функція.

source: Writing a function that returns a value
da: At skrive en funktion, der returnerer en værdi
de: Schreiben einer Funktion die einen Wert zurückgibt
es: Escribir una función que devuelva un valor
fr: Écrire une fonction qui renvoie une valeur
it: Scrivendo una funzione che ritorna un valore
ja: 値を返す関数の記述
nl: Een functie schrijven die een waarde teruggeeft
pl: Pisanie funkcji, która zwraca wartość
pt_br: Escrevendo uma função que retorna um valor
ru: Написание функции, возвращающей значение
tr: Değer döndüren bir fonksiyon yazmak
uk: Написання функції, яка повертає значення
zh_hans: 编写一个有返回值的函数

source: You can make [i]your[/i] functions return values.
da: Du kan få [i]dine[/i] funktioner til at returnere værdier.
pl: Możesz sprawić, że twoje funkcje będą zwracać wartości.
uk: Ви можете змусити [i]свої[/i] функції повертати значення.

source: To make a function return a value, you use the [code]return[/code] keyword followed by the value in question.
da: For at få en funktion til at returnere en værdi, bruger du nøgleordet [code]return[/code] efterfulgt af den pågældende værdi.
pl: Aby funkcja zwracała wartość, używasz słowa kluczowego [code]return[/code], po którym podajesz wartość, którą chcesz zwrócić.
uk: Щоб змусити функцію повертати значення, ви використовуєте ключове слово [code]return[/code], за яким слідує відповідне значення.

source: In previous lessons, we had characters walking on grids. For those practices, you were working with cell coordinates like [code]Vector2(0, 0)[/code] or [code]Vector2(2, 1)[/code].
da: I tidligere lektioner havde vi figurer, der gik på gitre. I disse øvelser arbejdede du med cellekoordinater som [code]Vector2(0, 0)[/code] eller [code]Vector2(2, 1)[/code].
uk: У попередніх уроках ми мали персонажів, які ходили по сітці. Для цих вправ ви працювали з координатами комірок, такими як [code]Vector2(0, 0)[/code] або [code]Vector2(2, 1)[/code].

source: But cell coordinates are not the same as positions on the screen. A cell coordinate like [code]Vector2(2, 1)[/code] tells us which cell we're in, but not where it is in pixels. To draw something on screen, we need pixel positions.
da: Men cellekoordinater er ikke det samme som positioner på skærmen. Et cellekoordinat som [code]Vector2(2, 1)[/code] fortæller os, hvilken celle vi er i, men ikke hvor den er i pixels. For at tegne noget på skærmen skal vi bruge pixelpositioner.
uk: Але координати комірки не збігаються з позиціями на екрані. Координати комірки, такі як [code]Vector2(2, 1)[/code], вказують, в якій комірці ми знаходимося, але не вказують її положення в пікселях. Щоб намалювати щось на екрані, нам потрібні позиції пікселів.

source: We can write a function to convert cell coordinates to pixel positions. Hover over the cells below to see how it works.
da: Vi kan skrive en funktion til at konvertere cellekoordinater til pixelpositioner. Hold musen over cellerne nedenfor for at se, hvordan det fungerer.
uk: Ми можемо написати функцію для перетворення координат комірок у позиції пікселів. Наведіть курсор на комірки нижче, щоб побачити, як це працює.

source: The yellow circle marks the pixel position at the top-left corner of each cell. This corner is the reference point we use for grid position.
da: Den gule cirkel markerer pixelpositionen i øverste venstre hjørne af hver celle. Dette hjørne er det referencepunkt, vi bruger til gitterposition.
uk: Жовте коло позначає положення пікселя у верхньому лівому куті кожної комірки. Цей кут є опорною точкою, яку ми використовуємо для визначення положення на сітці.

source: To convert cell coordinates to pixel positions, we multiply the cell coordinates by the size of each cell in pixels.
da: For at konvertere cellekoordinater til pixelpositioner ganger vi cellekoordinaterne med størrelsen af hver celle i pixels.
uk: Щоб перетворити координати комірок у позиції пікселів, ми перемножуємо координати комірок на розмір кожної комірки в пікселях.

source: For example, if each cell is [code]120[/code] pixels wide and tall, then:
da: Hvis for eksempel hver celle er [code]120[/code] pixels bred og høj, så:
uk: Наприклад, якщо кожна комірка має ширину і висоту [code]120[/code] пікселів, то:

source: - Cell [code]Vector2(1, 0)[/code] is at pixel position [code]Vector2(120, 0)[/code]. - Cell [code]Vector2(2, 1)[/code] would be at [code]Vector2(240, 120)[/code] pixels.
da: - Celle [code]Vector2(1, 0)[/code] er på pixelposition [code]Vector2(120, 0)[/code]. - Celle [code]Vector2(2, 1)[/code] ville være på [code]Vector2(240, 120)[/code] pixels.
uk: - Комірка [code]Vector2(1, 0)[/code] знаходиться в піксельній позиції [code]Vector2(120, 0)[/code]. - Комірка [code]Vector2(2, 1)[/code] буде знаходитися в піксельній позиції [code]Vector2(240, 120)[/code].

source: Use the interactive grid above to visualize the calculations.
da: Brug det interaktive gitter ovenfor til at visualisere beregningerne.
uk: Використовуйте інтерактивну сітку вище, щоб візуалізувати розрахунки.

source: This gives us the top-left corner of each cell, which is the standard way to position things on a grid in games.
da: Dette giver os det øverste venstre hjørne af hver celle, hvilket er standardmåden at placere ting på et gitter i spil.
uk: Це дає нам верхній лівий кут кожної комірки, що є стандартним способом розміщення об'єктів на сітці в іграх.

source: The function below does this calculation and returns the result, so we can store it in a variable or use it right away.
da: Funktionen nedenfor udfører denne beregning og returnerer resultatet, så vi kan gemme det i en variabel eller bruge det med det samme.
uk: Нижче наведена функція виконує цей розрахунок і повертає результат, тому ми можемо зберегти його в змінній або відразу ж використати.

source: The [code]return[/code] keyword sends the calculated value back to the code that called the function.
da: Nøgleordet [code]return[/code] sender den beregnede værdi tilbage til den kode, der kaldte funktionen.
uk: Ключове слово [code]return[/code] повертає обчислене значення назад до коду, який викликав функцію.

source: Note: In Godot, we write coordinates as [code]Vector2(x, y)[/code]. The [code]x[/code] value goes left to right (the column), and [code]y[/code] goes top to bottom (the row).
da: Bemærk: I Godot skriver vi koordinater som [code]Vector2(x, y)[/code]. Værdien [code]x[/code] går fra venstre mod højre (kolonnen), og [code]y[/code] går fra top til bund (rækken).
uk: Примітка: У Godot координати записуються у вигляді [code]Vector2(x, y)[/code]. Значення [code]x[/code] йде зліва направо (стовпець), а [code]y[/code] — зверху вниз (рядок).

source: In the example below, we call the function and store the returned value in the variable [code]world_position[/code]. Click the run button to see the result.
da: I eksemplet nedenfor kalder vi funktionen og gemmer den returnerede værdi i variablen [code]world_position[/code]. Klik på knappen "kør" for at se resultatet.
uk: У наведеному нижче прикладі ми викликаємо функцію і зберігаємо повернуте значення у змінній [code]world_position[/code]. Натисніть кнопку «run», щоб побачити результат.

source: Some functions return values, and some do not. You can check this in the documentation panel during practices. When a practice uses specific functions, the panel shows information about them.
da: Nogle funktioner returnerer værdier, og andre gør ikke. Du kan tjekke dette i dokumentationspanelet under øvelser. Når en øvelse bruger specifikke funktioner, viser panelet oplysninger om dem.
uk: Деякі функції повертають значення, а деякі — ні. Ви можете перевірити це в панелі документації під час виконання вправ. Коли вправа використовує певні функції, панель показує інформацію про них.

source: In the documentation, functions that start with the word [code]void[/code] do not return a value. Any other word before the function name means it returns a value of that type. You'll learn more about types in a couple of lessons.
da: I dokumentationen returnerer funktioner, der starter med ordet [code]void[/code], ikke en værdi. Ethvert andet ord før funktionsnavnet betyder, at det returnerer en værdi af den type. Du lærer mere om typer i et par lektioner.
uk: У документації функції, що починаються зі слова [code]void[/code], не повертають значення. Будь-яке інше слово перед назвою функції означає, що вона повертає значення цього типу. Більше про типи ви дізнаєтеся через кілька уроків.

source: For now, let's practice returning values from functions!
da: Lad os nu øve os i at returnere værdier fra funktioner!
uk: А поки потренуємося повертати значення з функцій!

source: Converting coordinates from the grid to the screen
da: Konvertering af koordinater fra gitteret til skærmen
de: Koordinaten aus dem Grid für den Bildschirm umwandeln
es: Convertir coordenadas de la cuadrícula a la pantalla
fr: Convertir les coordonnées de la grille à l'écran
it: Convertendo coordinate della griglia a coordinate dello schermo
ja: グリッドから画面への座標の変換
nl: Coördinaten omzetten van het raster naar het scherm
pt_br: Convertendo coordenadas do grid para a tela
ru: Конвертация координат сетки в координаты экрана
tr: Konumları ızgaradan alıp ekrana uygun dönüştürmek
uk: Перетворення координат із сітки на екран
zh_hans: 将坐标从网格转换到屏幕

source: Complete the function that converts a cell coordinate to a pixel position on the screen.
da: Færdiggør den funktion, der konverterer et cellekoordinat til en pixelposition på skærmen.
uk: Завершіть функцію, яка перетворює координати комірки в положення пікселя на екрані.

source: The function takes a [code]Vector2[/code] cell coordinate as an argument, like [code]Vector2(2, 1)[/code]. It should return the pixel position of that cell's top-left corner.
da: Funktionen tager et [code]Vector2[/code] cellekoordinat som et argument, f.eks. [code]Vector2(2, 1)[/code]. Den skal returnere pixelpositionen for cellens øverste venstre hjørne.
uk: Функція приймає в якості аргументу координату комірки [code]Vector2[/code], наприклад [code]Vector2(2, 1)[/code]. Вона повинна повертати піксельну позицію верхнього лівого кута цієї комірки.

source: To convert, multiply the cell coordinate by the [code]cell_size[/code].
da: For at konvertere skal du gange cellekoordinaten med [code]cell_size[/code].
uk: Для перетворення помножте координату комірки на [code]cell_size[/code].

source: We need a function to convert grid coordinates to pixel positions. Complete the function to make the turtle move to the correct cells!
da: Vi har brug for en funktion til at konvertere gitterkoordinater til pixelpositioner. Færdiggør funktionen for at få skildpadden til at bevæge sig til de rigtige celler!
uk: Нам потрібна функція для перетворення координат сітки в позиції пікселів. Доповніть функцію, щоб черепашка перемістилася в потрібні комірки!

source: Functions that return a value
da: Funktioner, der returnerer en værdi
de: Funktionen, die einen Wert zurückgeben
es: Funciones que devuelven un valor
fr: Fonctions qui renvoient une valeur
it: Funzioni che ritornano valori
ja: 値を返す関数
nl: Functies die een waarde teruggeven
pl: Funkcje zwracające wartość
pt_br: Funções que retornam um valor
ru: Функции, возвращающие значения
tr: Değer döndüren fonksiyonlar
uk: Функції, що повертають значення
zh_hans: 返回值的函数

source: Until now, you learned that functions are sequences of instructions you give a name and you can call any time.
pl: Do tej pory nauczyłeś się, że funkcje to sekwencje instrukcji, którym nadajesz nazwę i które możesz wywołać w dowolnym momencie.

source: On top of that, functions can make calculations and [i]return[/i] new values.
pl: Oprócz tego funkcje mogą wykonywać obliczenia i \[i]zwracać\[/i] nowe wartości.

source: Let's look at some examples to see why it's useful.
pl: Przyjrzyjmy się kilku przykładom, aby zobaczyć, dlaczego to jest przydatne.

source: For example, the [code]round()[/code] function takes a decimal number as an argument and gives you back a new number rounded to the nearest digit.
pl: Na przykład funkcja \[code]round()\[/code] przyjmuje jako argument liczbę dziesiętną i zwraca nową liczbę zaokrągloną do najbliższej cyfry.

source: Notice how we assign the result of the function call to a variable. Because the [code]round()[/code] function returns a [i]new[/i] value, we need to either store the result or use the value immediately.
pl: Zauważ, że przypisujemy wynik wywołania funkcji do zmiennej. Ponieważ funkcja \[code]round()\[/code] zwraca \[i]nową\[/i] wartość, musimy albo zapisać wynik w zmiennej, albo od razu użyć tej wartości.

source: You can assign the return value of a function call if you plan on using it more than once.
de: Du kannst den Rückgabewert eines Funktionsaufrufs zuweisen, wenn du ihn mehr als einmal verwenden möchten.
es: Puedes asignar el valor de retorno de una llamada de función si planeas usarla más de una vez.
fr: Vous pouvez assigner la valeur de retour d'un appel de fonction si vous prévoyez de l'utiliser plusieurs fois.
it: Puoi assegnare il risultato della funzione ad una variabile se intendi riutilizzarlo successivamente.
ja: 関数呼び出しの戻り値は、複数回使用する予定がある場合は割り当てることができます。
nl: Je kunt de teruggavewaarde van een functieaanroep toewijzen als je van plan bent deze meerdere malen te gebruiken.
pl: Możesz przypisać wartość zwracaną przez wywołanie funkcji, jeśli planujesz używać jej więcej niż jeden raz.
pt_br: Você pode atribuir o valor de retorno de uma chamada de função se planeja usá-lo mais de uma vez.
ru: Вы можете присвоить значение, возвращённое функцией, в переменную, если хотите использовать его более одного раза.
tr: Eğer birden fazla kez kullanmayı planlıyorsanız, bir fonksiyon çağrısının dönüş değerini bir değişkene atayabilirsiniz.
zh_hans: 如果你计划多次使用一个函数的返回值的话，你可以将它赋值给一个变量。

source: The [code]lerp()[/code] function, short for [i]linear interpolate[/i], calculates and returns a weighted average between two values.
pl: Funkcja [code]lerp()[/code], skrót od [i]linear interpolate[/i] (interpolacja liniowa), oblicza i zwraca średnią ważoną pomiędzy dwiema wartościami.

source: It takes three arguments: the two values to average and a value between [code]0.0[/code] and [code]1.0[/code] to skew the result.
pl: Przyjmuje trzy argumenty: dwie wartości do uśrednienia oraz liczbę z zakresu od [code]0.0[/code] do [code]1.0[/code], która wpływa na przesunięcie wyniku.

source: In game programming, it's used to animate things moving towards a target with a single line of code.
pl: W programowaniu gier używa się jej do animowania obiektów poruszających się w stronę celu za pomocą jednej linijki kodu.

source: In previous lessons, we had characters walking on grids.
pl: W poprzednich lekcjach postacie poruszały się po siatkach.

source: And for those practices, you were working directly with cell coordinates.
pl: Podczas tych ćwiczeń pracowałeś bezpośrednio ze współrzędnymi komórek.
