Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-15-modulo.po
Languages: cs, de, fr, hu, it, pt_br, ru, tr, zh_hans

source: Calculating a random number within a range
cs: Výpočet náhodného čísla v určitém rozsahu
de: Berechnen einer Zufallszahl innerhalb eines Zahlenbereichs
fr: Calcul d'un nombre aléatoire dans une plage
hu: Véletlenszám generálása adott határértéken belül
it: Calcolando un numero naturale all'interno di un intervallo
pt_br: Calculando um número aleatório dentro de um intervalo
ru: Получение случайного числа в конкретном диапазоне
tr: Bir sayı aralığında rastgele bir sayı hesaplamak
zh_hans: 计算范围内的随机数

source: We can use the modulo to simulate dice rolls. To do so, we generate a large random number and use the modulo operator to limit the number's range. To generate a random whole number, you can call the [code]randi()[/code] function. The name stands for random integer. The number the function generates can be huge: roughly up to 2 billion on an Android device and around 10^18 on a 64-bit computer. You can use the modulo operation to limit the random number's range.
cs: Modulo můžeme použít k simulaci hodu kostkou. Za tímto účelem vygenerujeme velké náhodné číslo a pomocí operátoru modulo omezíme jeho rozsah. Chcete-li vygenerovat náhodné celé číslo, můžete zavolat funkci [code]randi()[/code]. Název je zkratkou pro náhodné celé číslo. Číslo, které funkce vygeneruje, může být obrovské: zhruba až 2 miliardy na zařízení se systémem Android a přibližně 10^18 na 64bitovém počítači. K omezení rozsahu náhodného čísla můžete použít operaci modulo.
de: Wir können den Modulo verwenden, um Würfelwürfe zu simulieren. Dazu erzeugen wir eine große Zufallszahl und verwenden den Modulo-Operator, um den Bereich der Zahl zu begrenzen. Um eine zufällige ganze Zahl zu erzeugen, kannst du die Funktion [code]randi()[/code] aufrufen. Der Name steht für Random Integer. Die von der Funktion erzeugte Zahl, kann riesig sein: etwa bis zu 2 Milliarden auf einem Android-Gerät und etwa 10^18 auf einem 64-Bit-Computer. Du kannst die Modulo-Operation verwenden, um den Bereich der Zufallszahl zu begrenzen.
fr: Nous pouvons utiliser le modulo pour simuler des lancers de dés. Pour ce faire, nous générons un grand nombre aléatoire et utilisons l'opérateur modulo pour limiter la plage du nombre. Pour générer un nombre entier aléatoire, vous pouvez appeler la fonction [code]randi()[/code]. Ce nom vient de la abréviation du terme en anglais [i]random integer[/i] qui signifie « nombre entier aléatoire ». Le nombre que la fonction génère peut être énorme : en gros jusqu'à 2 milliards sur un appareil Android et environ 10^18 sur un ordinateur 64 bits. Vous pouvez utiliser l'opération modulo pour limiter la plage du nombre aléatoire.
hu: A modulot használhatjuk kockadobás szimulálására is. Ehhez először generálnunk kell egy nagy véletlenszámot, majd a moduloval szabályozhatjuk a felső határt. Véleltlenszámot a [code]randi()[/code] függvénnyel generálhatsz. Az elnevezés a random integer rövidítése. A függvény által generált szám hatalmas is lehet: nagyjából 2 milliárd egy Androidos eszközön, és kb. 10^18 egy 64-bites számítógépen. A modulo segítségével ezt a tartományt leszükítheted.
it: Possiamo usare il modulo per simulare delle tirate di dado. Per fare questo, generiamo un grande numero casuale e usiamo l'operatore modulo per limitare l'intervallo di numeri. Per generare un numero intero casuale puoi chiamare la funzione [code]randi()[/code]. Il nome sta per random integer. Il numero che la funzione genera può essere enorme: fino a 2 miliardi su un dispositivo Android e circa 10^18 su un computer a 64-bit. Puoi usare l'operatore modulo per limitare l'intervallo di numeri.
pt_br: Podemos usar o módulo para simular jogadas de dados. Para fazer isso, geramos um grande número aleatório e usamos o operador módulo para limitar o intervalo do número. Para gerar um número inteiro aleatório, você pode chamar a função [code]randi()[/code]. O nome significa random integer (número inteiro aleatório). O número que a função gera pode ser enorme: aproximadamente até 2 bilhões em um dispositivo Android por exemplo e cerca de 10^18 em um computador de 64 bits. Você pode usar a operação de módulo para limitar o intervalo do número aleatório.
ru: Мы можем использовать остаток от деления для симуляции бросков игральной кости. Для этого мы генерируем большое случайное число и применяем к нему оператор %, чтобы ограничить диапазон чисел. Для генерации случайного целого числа вы можете использовать функцию [code]randi()[/code]. Имя образовано от «random integer» (случайное целое число). Число, которое генерирует эта функция, очень велико: максимальное его значение может быть равно приблизительно 2-м миллиардам на устройствах Android и около 10^18 на 64-битных компьютерах. Вы можете использовать операцию получения остатка от деления, чтобы ограничить диапазон этого случайного числа.
tr: Zar atma benzeşimi (simülasyon) yapmak için mod almayı kullanabiliriz. Bunu yapmak için, çok büyük bir rastgele sayı üretiyoruz ve sayının alacağı değerleri sınırlamak için mod alma işlemini kullanıyoruz. Rastgele bir tam sayı oluşturmak için [code]randi()[/code] fonksiyonunu çağırabilirsin. İsim rasgele tamsayı (random integer) anlamına gelir. Fonksiyonun ürettiği sayı aşırı büyük olabilir: bir Android cihazda kabaca 2 milyara kadar ve 64-bit bilgisayarda yaklaşık 10^18 (1'den sonra 18 tane 0 var demek). Rasgele sayının alacağı değer aralığını sınırlamak için mod alma işlemini kullanabilirsin.
zh_hans: 我们可以使用模来模拟掷骰子。为此，我们生成一个大随机数并使用模运算符来限制数字的范围。 要生成随机整数，可以调用 [code]randi()[/code] 函数。该名称代表随机整数。 该函数生成的数字可能很大：在 Android 设备上大约高达 20 亿，在 64 位计算机上大约为 10^18。 您可以使用模运算来限制随机数的范围。

source: The result is also random because we use the modulo operation on a random number. In the following practices, you'll use a modulo to advance traffic lights, add maximum health to the robot on every odd level, and learn how to code dice rolls.
cs: Výsledek je také náhodný, protože používáme operaci modulo na náhodné číslo. V následujících postupech budete používat modulo k posunu semaforů, přidání maximálního zdraví robotovi na všech lichých úrovních a naučíte se kódovat hody kostkami.
de: Das Ergebnis bleibt zufällig, auch wenn wir die Modulo-Operation auf eine Zufallszahl anwenden. In den folgenden Übungen verwendest Du Modulo, um Ampeln umzuschalten und dem Roboter, auf jeder ungeraden Stufe, maximales Leben zu verleihen. Außerdem wirst du lernen, wie man zufällige Würfelergebnisse programmiert.
fr: Le résultat est également aléatoire car nous utilisons l'opération modulo sur un nombre aléatoire. Dans les exercices suivantes, vous utiliserez un modulo pour gérer des feux de signalisation, ajouter de la santé maximale au robot à chaque niveau impair et apprendre à coder des lancers de dés.
hu: Az eredmény is véletlenszerű lesz, miv el egy véletlenszámon használjuk a modulo operátort. A következő gyakorlatokban, a modulo segítségével fogsz jelzőlámpát szimulálni, extra életet adni a robotnak minden második szinten, és megtanulsz kockadobást kódolni.
it: Il risultato è comunque casuale perché usiamo l'operazione modulo su un numero casuale. Nelle seguenti pratiche, userai un modulo per avanzare le luci di semafori, aggiungerai vita massima ad un robot ad ogni livello dispari e imparerai come simulare la tirata di dadi.
pt_br: O resultado também é aleatório porque usamos a operação módulo em um número aleatório. Nas próximas práticas, você vai usar uma operação de módulo para avançar semáforos, adicionar uma vida máxima ao robô em cada nível ímpar e aprender a programar jogadas de dados.
ru: Результат также будет случайным, ведь мы применяем операцию получения остатка от деления к случайному числу. В последующих упражнениях вы будете использовать остаток от деления для переключения цветов светофора, добавления бонуса к максимуму здоровья робота, при каждом получении им чётного уровня прокачки, и научитесь программировать броски игральной кости.
tr: Sonuç değeri rastgele bir sayı olur, çünkü mod alma işlemini rastgele bir sayı üzerinde kullanırız. Sıradaki uygulamalarda, trafik ışıklarını değiştirmek, her tek sayılı seviyede robotun en yüksek sağlığına ekleme yapmak, ve zar atmayı nasıl kodlayacağını öğrenmek için bir mod almayı kullanacaksın.
zh_hans: 结果也是随机的，因为我们对随机数使用模运算。 在以下练习中，您将使用模数来推进红绿灯，在每个奇数级别为机器人添加最大生命值，并学习如何编写掷骰子代码。

source: Advancing Traffic Lights
cs: Postupující semafory
de: Ampeln umschalten
fr: Gérer les feux de signalisation
hu: Jelzőlámpa szimulálás
it: Avanzando Luci Di Semafori
pt_br: Avançando Luzes de Semáforos
ru: Переключение цветов светофора
tr: Trafik Işıklarını Değiştirmek
zh_hans: 推进交通灯

source: Add to the [code]advance_traffic_light()[/code] function so the [code]light_index[/code] variable increments by one, then wraps back to [code]0[/code] if it gets too high. Use the modulo operator [code]%[/code] to make sure the value of [code]light_index[/code] wraps back to [code]0[/code]. The value of [code]light_index[/code] should only ever be [code]0[/code], [code]1[/code], or [code]2[/code].
cs: Přidejte do funkce [code]advance_traffic_light()[/code], aby se proměnná [code]light_index[/code] zvýšila o jedničku a pak se vrátila zpět na [code]0[/code], pokud je příliš vysoká. Použijte operátor modulo [code]%[/code], abyste se ujistili, že se hodnota [code]light_index[/code] vrátí zpět na [code]0[/code]. Hodnota [code]light_index[/code] by měla být vždy pouze [code]0[/code], [code]1[/code] nebo [code]2[/code].
de: Ergänze die Funktion [code]advance_traffic_light()[/code], sodass die Variable [code]light_index[/code] um 1 erhöht wird und wieder bei [code]0[/code] anfängt, wenn sie zu hoch wird. Verwenden Sie den Modulo-Operator [code]%[/code], um sicherzustellen, dass der Wert von [code]light_index[/code] wieder bei [code]0[/code] beginnt. Der Wert von [code]light_index[/code] sollte immer nur [code]0[/code], [code]1[/code] oder [code]2[/code] sein.
fr: Ajoutez du code à la fonction [code]advance_traffic_light()[/code] pour que la variable [code]light_index[/code] s'incrémente de un, puis revienne à [code]0[/code] si elle monte trop. Utilisez l'opérateur modulo [code]%[/code] pour vous assurer que la valeur de [code]light_index[/code] revient à [code]0[/code]. La valeur de [code]light_index[/code] ne peut être que [code]0[/code], [code]1[/code] ou [code]2[/code].
hu: Módosítsd az [code]advance_traffic_light()[/code] függvényt úgy, hogy a [code]light_index[/code] értéke eggyel nőjön, majd váltson vissza [code]0[/code]-ra, ha túl nagy lesz. Használd a modulo [code]%[/code] operátort, hogy a [code]light_index[/code] értéke váltson vissza [code]0[/code]-ra. A [code]light_index[/code] értéke kizárólag [code]0[/code], [code]1[/code], vagy [code]2[/code] kéne, hogy legyen.
it: Aggiungi alla funzione [code]advance_traffic_light()[/code] cosicché la variabile [code]light_index[/code] si incrementi di uno e poi ritorni a [code]0[/code] se diventa troppo grande. Usa l'operatore modulo [code]%[/code] per assicurarti che il valore del [code]light_index[/code] ritorni a [code]0[/code]. Il valore di [code]light_index[/code] dovrebbe essere solamente [code]0[/code]. [code]1[/code] o [code]2[/code].
pt_br: Adicione algo na função [code]advance_traffic_light()[/code] para que a variável [code]light_index[/code] seja incrementada em um e, em seguida, volte para [code]0[/code] se o valor ficar muito alto. Use o operador de módulo [code]%[/code] para garantir que o valor de [code]light_index[/code] volte para [code]0[/code]. O valor de [code]light_index[/code] só deve ser [code]0[/code], [code]1[/code] ou [code]2[/code].
ru: Доработайте функцию [code]advance_traffic_light()[/code], чтобы при её выполнении переменная [code]light_index[/code] увеличивалась на единицу, а затем возвращалась назад к [code]0[/code], если увеличилась слишком сильно. Используйте оператор [code]%[/code], чтобы убедиться, что значение [code]light_index[/code] возвращается обратно к [code]0[/code]. Значение [code]light_index[/code] всегда должно быть равно [code]0[/code], [code]1[/code], или [code]2[/code].
tr: [code]advance_traffic_light()[/code] (değiştir_trafik_ışığı) fonksiyonuna ekleme yap; böylece [code]light_index[/code] (ışık_dizini) değişkeni hep bir artsın, ama çok artarsa geri [code]0[/code] değerini alsın. [code]light_index[/code] değerinin [code]0[/code] değerine geri sardığından emin olmak için mod alma işleci olan [code]%[/code] kullan. [code]light_index[/code] değeri yalnızca [code]0[/code], [code]1[/code] veya [code]2[/code] olmalıdır.
zh_hans: 添加到 [code]advance_traffic_light()[/code] 函数，使 [code]light_index[/code] 变量递增 1，如果它变得太高，则返回到 [code]0[/code]。 使用模运算符 [code]%[/code] 确保 [code]light_index[/code] 的值回绕到 [code]0[/code]。 [code]light_index[/code] 的值只能是 [code]0[/code]、[code]1[/code] 或 [code]2[/code]。

source: Learn how to use modulo to wrap a number back to zero using traffic lights.
cs: Naučte se používat modulo k vracení čísla zpět na nulu pomocí semaforů.
de: Lerne anhand einer Ampel wie du mit Hilfe von Modulo eine Zahl auf 0 zurücksetzt.
fr: Apprenez à utiliser le modulo pour ramener un nombre à zéro à l'aide de feux de signalisation.
hu: Megtanulhatod, hogyan lehet a modulo segítségével visszaállítani a számot nullára, egy jelzőlámpa szimulálásához.
it: Impara ad utilizzare il modulo per far tornare a zero un numero usando dei semafori.
pt_br: Aprenda a usar a operação de módulo para fazer um número voltar pra zero usando luzes de semáforos.
ru: Научитесь использовать остаток от деления для возвращения числа к нулю при помощи светофора.
tr: Trafik ışıklarını kullanarak bir sayıyı sıfıra geri sarmak için mod almayı nasıl kullanacağını öğren.
zh_hans: 了解如何使用红绿灯使用模数将数字回零。

source: Rolling Dice
cs: Házení kostkou
de: Würfeln
fr: Lancer de dés
hu: Kockadobás
it: Tirando Dei Dadi
pt_br: Lançando dados
ru: Бросание игральной кости
tr: Zar Atmak
zh_hans: 掷骰子

source: Our dice rolling function doesn't work! Right now, it always gives the result of how many sides the dice has: 20. Use [code]randi()[/code] to generate a random number and the modulo operation [code]%[/code]. Using the [code]return[/code] keyword inside the function, return a random number between [code]1[/code] and [code]sides[/code].
cs: Naše funkce házení kostkou nefunguje! Nyní vždy udává výsledek, kolik stran má kostka: 20. Použijte [code]randi()[/code] pro vygenerování náhodného čísla a operaci modulo [code]%[/code]. Pomocí klíčového slova [code]return[/code] uvnitř funkce vraťte náhodné číslo mezi [code]1[/code] a [code]sides[/code].
de: Unsere Würfelfunktion funktioniert nicht! Im Moment liefert sie als Ergebnis immer, wie viele Seiten der Würfel hat: 20. Verwende [code]randi()[/code] und die Modulo-Operation [code]%[/code], um eine Zufallszahl zu generieren. Gebe mit dem Schlüsselwort [code]return[/code] innerhalb der Funktion eine Zufallszahl zwischen [code]1[/code] und Anzahl der Würfelseiten([code]sides[/code]) zurück.
fr: Notre fonction de lancement de dés ne fonctionne pas ! En ce moment, elle donne toujours le résultat du nombre de faces du dé : 20. Utilisez [code]randi()[/code] pour générer un nombre aléatoire et l'opération modulo [code]%[/code]. En utilisant le mot-clé [code]return[/code] dans la fonction, renvoyez un nombre aléatoire entre [code]1[/code] et [code]sides[/code] (le nombre de côtés).
hu: A kockadobó függvényünk nem működik! Jelenleg, mindig a kocka oldalainak számát adja vissza: 20. Használd a [code]randi()[/code] függvényt és a modulo [code]%[/code] műveletet egy véletlenszám generálásához. A [code]return[/code] kulcsszó használatával, adj vissza egy véletlenszámot [code]1[/code] és [code]sides[/code] között.
it: La nostra funzione che tira dadi non funziona! Adesso, dà come risultato solo quanti lati ha il dato: 20. Usa [code]randi()[/code] per generare un numero casuale e l'operazione modulo [code]%[/code]. Usando la parola chiave [code]return[/code] all'interno della funzione, ritorna un numero casuale tra [code]1[/code] e [code]sides[/code].
pt_br: Nossa função de lançar dados não funciona! Neste momento, ela sempre dá o resultado de quantos lados o dado tem: 20. Use a função [code]randi()[/code] para gerar um número aleatório e use também a operação de módulo [code]%[/code]. Usando a palavra-chave [code]return[/code] dentro da função, retorne um número aleatório entre [code]1[/code] e [code]sides[/code].
ru: Наша функция бросания кости не работает! Сейчас она всегда возвращает количество граней кости: 20. Используйте функцию [code]randi()[/code] для генерации случайного числа и оператор получения остатка от деления — [code]%[/code]. При помощи ключевого слова [code]return[/code] внутри функции, верните случайное число, находящееся в диапазоне между [code]1[/code] и [code]sides[/code].
tr: Zar atma fonksiyonumuz çalışmıyor! Şu anda, zarın kaç tarafı (sides) varsa o sayıyı döndürüyor: 20 (normal zar değil). Rastgele bir sayı üretmek için [code]randi()[/code] ve mod alma işlemi, [code]%[/code], kullan. (unutma, mod alma işleminin sonucu, 0'dan başlar, mod sayısından 1 eksiğe kadar gider). Fonksiyonun içindeki [code]return[/code] anahtar kelimesini kullanarak, [code]1[/code] ve [code]sides[/code] arasında rastgele bir sayı döndür.
zh_hans: 我们的掷骰子功能不起作用！现在，它总是给出骰子有多少面的结果：20。 使用 [code]randi()[/code] 生成随机数和模运算 [code]%[/code]。 使用函数内部的 [code]return[/code] 关键字，返回 [code]1[/code] 和 [code]sides[/code] 之间的随机数。

source: Whether in a board game or video game, getting a random number is always useful. Here, we create a function that simulates a dice roll.
cs: Získání náhodného čísla je vždy užitečné, ať už se jedná o stolní hru nebo videohru. Zde vytvoříme funkci, která simuluje hod kostkou.
de: Ob in einem Brettspiel oder einem Videospiel, eine Zufallszahl zu erhalten ist immer nützlich. Hier erstellen wir eine Funktion, die einen Würfelwurf simuliert.
fr: Que ce soit dans un jeu de société ou un jeu vidéo, obtenir un nombre aléatoire est toujours utile. Ici, nous créons une fonction qui simule un lancer de dés.
hu: Legyen az társasjáték vagy videójáték, egy véletlenszám mindig jól jön. Most egy függvényt fogunk létrehozni, ami egy kockadobást szimulál.
it: Che sia un gioco da tavolo o un videogioco, ottenere un numero casuale è sempre utile. Eccoti, abbiamo creato una funzione che simula la tirata di un dado.
pt_br: Seja em um jogo de tabuleiro ou videogame, obter um número aleatório é sempre útil. Aqui, nós criamos uma função que simula um lançamento de dados.
ru: Вне зависимости от того, настольная игра или компьютерная, получать случайные числа в ней может быть очень полезно. Здесь мы создадим функцию, симулирующую бросок игральной кости.
tr: İster masa oyunu olsun, ister video oyunu olsun, rastgele bir sayı elde etmek her zaman yararlıdır. Burada, zar atma benzeşimi yapan bir fonksiyon oluşturuyoruz.
zh_hans: 无论是在棋盘游戏还是视频游戏中，获取随机数总是有用的。在这里，我们创建了一个模拟掷骰子的函数。

source: Bonus Health Every Other Level
cs: Bonus zdraví na každé druhé úrovni
de: Zusätzliches Leben beim Erreichen jeder zweiten Stufe
fr: Bonus de santé tous les deux niveaux
hu: Extra élet minden második szinten
it: Vita Bonus Ogni Altro Livello
pt_br: Bônus de Vida em Todos os Outros Níveis
ru: Бонусное здоровье каждый чётный уровень
tr: Her Seviye Atlamada İlave Sağlık
zh_hans: 其他级别的额外生命值

source: Change the [code]level_up()[/code] function so it does the following: 1) Increment [code]level[/code] by [code]1[/code] 2) Increase [code]max_health[/code] by [code]5[/code] 3) If [code]level[/code] is [b]even[/b], increase [code]max_health[/code] by an additional [code]5[/code] The robot starts with [code]100[/code] maximum health. It will gain three levels when you run the code. At level 4, the robot should have [code]125[/code] maximum health.
cs: Změňte funkci [code]level_up()[/code] tak, aby provedla následující: 1) Zvýší [code]level[/code] o [code]1[/code]. 2) Zvýší [code]max_health[/code] o [code]5[/code]. 3) Pokud je [code]level[/code] [b]sudý[/b], zvyš [code]max_health[/code] o dalších [code]5[/code]. Robot začíná s maximálním zdravím [code]100[/code]. Po spuštění kódu získá tři úrovně. Na čtvrté úrovni by měl mít robot maximální zdraví [code]125[/code].
de: Ändere die Funktion [code]level_up()[/code] wie folgt: 1) Zähle die Variable [code]level[/code] um [code]1[/code] nach oben 2) Erhöhe [code]max_health[/code] um [code]5[/code] 3) Wenn [code]level[/code] [b]gerade[/b] ist, erhöhe [code]max_health[/code] um zusätzliche [code]5[/code] Punkte Der Roboter beginnt mit [code]100[/code] maximaler Gesundheit. Er erhält drei Stufen, wenn Du den Code ausführst. Auf Stufe 4 sollte der Roboter maximal [code]125[/code] Leben haben.
fr: Modifiez la fonction [code]level_up()[/code] afin qu'elle fasse ce qui suit : 1) Incrémenter le [code]level[/code] de [code]1[/code] 2) Augmenter la [code]max_health[/code] de [code]5[/code] 3) Si le [code]level[/code] est [b]pair[/b], augmenter la [code]max_health[/code] de [code]5[/code] points supplémentaires Le robot commence avec [code]100[/code] de santé maximale. Il gagnera trois niveaux lorsque vous exécuterez le code. Au niveau 4, le robot devrait avoir [code]125[/code] de santé maximale.
hu: Módosítsd a [code]level_up()[/code] függvényt az alábbiak szerint: 1) Növeld a [code]level[/code] értékét [code]1[/code]-gyel 2) Növeld a [code]max_health[/code] értékét [code]5[/code]-tel 3) Ha a [code]level[/code] értéke [b]even[/b] (páros), növeld a [code]max_health[/code] értékét még [code]5[/code]-tel A robot [code]100[/code] maximum élettel kezd. Háromszor fog szintet lépni, amikor futtatod a kódot. 4-es szinten a robot maximum élete [code]125[/code] kell, hogy legyen.
it: Cambia la funzione [code]level_up()[/code] cosicché faccia le seguenti cose: 1) Incrementare il [code]livello[/code] di [code]1[/code] 2) Incrementare la [code]max_health[/code] di [code]5[/code] 3) Se il [code]level[/code] è [b]pari[/b], incrementa la [code]max_health[/code] di altri [code]5[/code] Il robot inizia con [code]100[/code] di vita massima. Guadagnerà tre leveli quando eseguirai il codice. Al livello 4, il robot dovrebbe avere [code]125[/code] di vita massima.
pt_br: Altere a função [code]level_up()[/code] para que faça o seguinte: 1) Incrementar o [code]level[/code] em [code]1[/code] 2) Aumentar o [code]max_health[/code] em [code]5[/code] 3) Se [code]level[/code] for [b]par[/b], aumente [code]max_health[/code] por um adicional de [code]5[/code] O robô começa com [code]100[/code] de vida máxima. Ele ganhará três níveis quando você executar o código. No nível 4, o robô deve ter [code]125[/code] de vida máxima.
ru: Измените функцию [code]level_up()[/code], чтобы она: 1) Увеличивала [code]level[/code] на [code]1[/code] 2) Увеличивала [code]max_health[/code] на [code]5[/code] 3) Увеличивала [code]max_health[/code] ещё на [code]5[/code], если [code]level[/code] [b]чётный[/b] Робот начинает с максимальным здоровьем [code]100[/code]. Он получит три уровня когда вы запустите код. На уровне 4 максимальное здоровье робота должно быть равно [code]125[/code].
tr: [code]level_up()[/code] (seviye_atla) fonksiyonunu, aşağıdakileri yapacak şekilde değiştir: 1) seviyeyi, [code]level[/code], [code]1[/code] artır 2) en yüksek sağlık değerini, [code]max_health[/code], [code]5[/code] artır 3) Eğer [code]level[/code] bir [b]çift sayı[/b] ise, [code]max_health[/code] değerini fazladan [code]5[/code] daha arttır. Robot, seviyesi 1 ve en yüksek sağlık değeri [code]100[/code] ile başlar. Kodu çalıştırdığınızda üç seviye kazanacaktır. Seviye 4'te robot [code]125[/code] maksimum sağlığa sahip olmalıdır.
zh_hans: 更改 [code]level_up()[/code] 函数，使其执行以下操作： 1) 将 [code]level[/code] 增加 [code]1[/code] 2) 将 [code]max_health[/code] 增加 [code]5[/code] 3) 如果 [code]level[/code] 为 [b]偶数[/b]，则将 [code]max_health[/code] 增加一个 [code]5[/code] 机器人以 [code]100[/code] 最大生命值开始。运行代码时，它将获得三个级别。在第 4 级，机器人应该有 [code]125[/code] 的最大生命值。
