Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-14-multiplying.po
Languages: hu, nl, pl, tr, uk, zh_hans

source: Our robot's health is always between [code]0[/code] and [code]100[/code].
uk: Здоров’я нашого робота завжди між [code]0[/code] і [code]100[/code].

source: But as our robot fights, we want to increase its strength and toughness.
uk: Але поки наш робот бореться, ми хочемо збільшити його силу та витривалість.

source: When a character levels up, it might deal more damage to enemies, gain new abilities or, in our case, gain more health.
uk: Коли персонаж підвищує рівень, він може завдати більше шкоди ворогам, отримати нові здібності або, у нашому випадку, отримати більше здоров’я.

source: We define a [code]level[/code] variable to keep track of the level of the robot. It starts at level one.
uk: Ми визначаємо змінну [code]level[/code], щоб відстежувати рівень робота. Починається з першого рівня.

source: When the robot has defeated enough enemies, we call the [code]level_up()[/code] function to increment the robot's level.
uk: Коли робот переміг достатньо ворогів, ми викликаємо функцію [code]level_up()[/code], щоб збільшити рівень робота.

source: As we briefly saw in the last lesson, our robot could have a range of variables that could increase when it levels up.
hu: Ahogy az előző leckében már láthattuk, a robotunknak van jónéhány változója, amit szintlépéssel növelhetünk.
nl: Zoals we kort zagen in de vorige les, kan onze robot een reeks variabelen hebben die kunnen toenemen wanneer hij een hoger niveau bereikt.
pl: Z czym mieliśmy już okazję zapoznać się w poprzedniej lekcji, nasz robot może mieć szereg zmiennych, które mogą wzrosnąć, gdy osiągnie kolejny poziom.
tr: Son derste kısaca gördüğümüz gibi, robotumuz seviye atladığında artabilecek bir sürü değişkene sahip olabilir.
uk: Як ми коротко бачили в минулому уроці, наш робот може мати ряд змінних, які можуть збільшуватися, коли він підвищується.
zh_hans: 正如我们在上一课中简要介绍的那样，我们的机器人可以有一系列变量，当它升级时可能会增加的那种。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code].
uk: У цьому уроці ми зосередимося лише на збільшенні [code]max_health[/code] робота.

source: The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]heal()[/code] function to use this variable.
uk: Змінна [code]max_health[/code] — це максимальна кількість [code]health[/code] робота. Ми змінюємо нашу функцію [code]heal()[/code], щоб використовувати цю змінну.

source: We could add [code]5[/code] to the [code]max_health[/code] every time the robot levels up.
hu: Hozzáadhatunk [code]5[/code]-öt a [code]max_health[/code] változóhoz, minden alkalommal, amikor a robot szintet lép.
nl: We zouden [code]5[/code] kunnen toevoegen aan de [code]max_health[/code] telkens wanneer de robot een hoger niveau bereikt.
pl: Możemy dodawać [code]5[/code] do [code]max_health[/code] za każdym razem, gdy robot osiąga kolejny poziom.
tr: Robot her seviye atladığında, [code]max_health[/code] değerine [code]5[/code] ekleyebiliriz.
uk: Ми могли б додати [code]5[/code] до [code]max_health[/code] кожного разу, коли робот підвищує рівень.
zh_hans: 每次机器人升级时，我们可以将 [code]max_health[/code] 增加 [code]5[/code] 点。

source: This would increase [code]max_health[/code] the same amount every time.
uk: Це збільшуватиме [code]max_health[/code] щоразу однакову кількість.

source: If we graphed [code]max_health[/code], it'd look something like this.
uk: Якби ми побудували графік [code]max_health[/code], це виглядало б приблизно так.

source: This growth is [b]linear[/b].
uk: Це зростання є [b]лінійним[/b].

source: In our case, we want a feeling of more and more power as the robot levels up.
uk: У нашому випадку ми хочемо відчувати все більше і більше потужності, коли робот підвищується.

source: We want a graph like this.
uk: Ми хочемо отримати такий графік.

source: This growth is [b]exponential[/b].
uk: Це зростання є [b]експоненційним[/b].

source: With each level, more [code]max_health[/code] is added than the previous level up.
uk: З кожним рівнем додається більше [code]max_health[/code], ніж на попередньому рівні.

source: To get the exponential growth, we multiply the [code]max_health[/code] by an amount greater than [code]1[/code] each time the robot levels up.
uk: Щоб отримати експоненціальне зростання, ми множимо [code]max_health[/code] на суму, більшу за [code]1[/code] кожного разу, коли робот підвищує рівень.

source: To multiply values together, we use [code]*[/code].
uk: Щоб помножити значення разом, ми використовуємо [code]*[/code].

source: What is the value of damage?
hu: Mennyi a sebzés értéke?
nl: Wat is de waarde van damage?
pl: Jaką wartość ma damage?
tr: Hasar miktarı ne kadardır?
uk: Яка вартість збитку?
zh_hans: 下面的伤害（damage）的值是多少？

source: We multiply [code]power[/code] by [code]level[/code] using [code]*[/code] to get the result of [code]15[/code].
hu: Beszorozzuk a [code]power[/code]-t a [code]level[/code]-lel, a [code]*[/code] segítségével, hogy [code]15[/code]-öt kapjunk.
nl: We vermenigvuldigen [code]power[/code] met [code]level[/code] met behulp van [code]*[/code] en komen uit op [code]15[/code].
pl: Mnożymy [code]power[/code] przez [code]level[/code], używając [code]*[/code], zyskując wynik [code]15[/code].
tr: [code]15[/code] sonucunu elde etmek için [code]*[/code] kullanarak [code]güç[/code] ile [code]seviye[/code]'yi ile çarpıyoruz.
uk: Ми множимо [code]power[/code] на [code]level[/code] за допомогою [code]*[/code], щоб отримати результат [code]15[/code].
zh_hans: 使用 [code]*[/code] 将 [code]power[/code] 乘以 [code]level[/code]，结果是 [code]15[/code] 。

source: We can use [code]*=[/code] in the same way as [code]-=[/code] and [code]+=[/code].
hu: A [code]*=[/code]-t is használhatjuk úgy, mint a [code]-=[/code]-t és a [code]+=[/code]-t.
nl: We kunnen [code]*=[/code] op dezelfde manier gebruiken als [code]-=[/code] en [code]+=[/code].
pl: Możemy używać [code]*=[/code] w taki sam sposób jak [code]-=[/code] i [code]+=[/code].
tr: [code]*=[/code] ifadesini, [code]-=[/code] ve [code]+=[/code] ile aynı şekilde kullanabiliriz.
uk: Ми можемо використовувати [code]*=[/code] так само, як [code]-=[/code] і [code]+=[/code].
zh_hans: 我们可以像使用[code]-=[/code]和[code]+=[/code]一样使用[code]*=[/code]。

source: What is the value of damage now?
hu: Most mennyi a sebzés értéke?
nl: Wat is de waarde van damage nu?
pl: Jaką wartość damage ma tym razem?
tr: Hasar miktarı, bu defa ne kadar olur?
uk: Яка зараз вартість збитку?
zh_hans: 现在伤害（damage）值是多少？

source: The value of [code]damage[/code] starts as [code]15[/code].
uk: Значення [code]damage[/code] починається як [code]15[/code].

source: Then, [code]damage *= 2[/code] multiplies it by [code]2[/code] to get [code]30[/code].
uk: Потім [code]damage *= 2[/code] множить його на [code]2[/code], щоб отримати [code]30[/code].

source: Let's level up our robot and add exponential growth to [code]max_health[/code].
hu: Léptessük szintet a robotunkat, és adjunk exponenciális növekedési értéket a [code]max_health[/code]-nek.
nl: Laten we onze robot naar een hoger niveau brengen en exponentiële groei toevoegen aan [code]max_health[/code].
pl: Podnieśmy poziom naszego robota i dodajmy wykładniczy wzrost do [code]max_health[/code].
tr: Hadi robotumuzun seviyesini yükseltelim ve [code]max_health[/code]'e üstel büyüme ekleyelim.
uk: Давайте підвищимо рівень нашого робота та додамо експоненціальний ріст до [code]max_health[/code].
zh_hans: 升级我们的机器人，给[code]max_health[/code] 添加一个升级按指数增长的模式。

source: In the practices, you'll increase the robot's [code]max_health[/code] and add a special ability to our robot to make it extra tough at high levels.
hu: Ezekben a gyakorlatokban, megnöveled a robot [code]max_health[/code] értékét, és adsz neki egy különleges képességet, hogy nagyon kemény legyen a magsabb szinteken.
nl: In de oefeningen zul je de [code]max_health[/code] van de robot verhogen en een speciaal vermogen aan onze robot toevoegen om hem extra sterk te maken op hoge niveaus.
pl: Podczas ćwiczeń zwiększysz [code]max_health[/code] robota i dodasz naszemu robotowi specjalną zdolność, aby uczynić go wyjątkowo wytrzymałym na wysokich poziomach.
tr: Alıştırmalarda, robotun [code]max_health[/code] değerini artıracak ve onu yüksek seviyelerde daha da zorlu hale getirecek özel bir yetenek ekleyeceksin.
uk: Під час тренувань ви збільшите [code]max_health[/code] робота та додасте йому спеціальну здатність, щоб зробити його ще більш міцним на високих рівнях.
zh_hans: 在这次的练习中，你需要增加机器人的 [code]max_health[/code] 并为它添加一项特殊能力，使其在高等级时更加坚韧。

source: Increasing maximum health exponentially
hu: A maximális élet exponenciális növelése
nl: De maximale gezondheid exponentieel verhogen
pl: Wykładnicze zwiększanie maksymalnego zdrowia
tr: En yüksek sağlığın katlanarak artırılması
uk: Збільшення максимального здоров'я в геометричній прогресії
zh_hans: 指数式地增加最大生命值

source: Let's make the robot stronger when it levels up.
uk: Давайте зробимо робота сильнішим, коли він підвищиться.

source: Add to the [code]level_up()[/code] function so it does the following:
uk: Додайте до функції [code]level_up()[/code], щоб вона виконувала такі дії:

source: - Increases [code]level[/code] by one. - Increases [code]max_health[/code] by 10%.
uk: - Підвищує [code]level[/code] на одиницю. - Збільшує [code]max_health[/code] на 10%.

source: We want our robot to increase in strength as it levels up. Let's increase its health exponentially!
hu: Szeretnénk, ha a robotunk szintlépéskor erősebb lenne. Növeljük az életét exponenciálisan!
nl: We willen dat onze robot sterker wordt naarmate zijn niveau stijgt. Laten we zijn gezondheid exponentieel doen groeien!
pl: Chcemy, aby nasz robot rósł w siłę w miarę zdobywania kolejnych poziomów. Zwiększmy wykładniczo jego zdrowie!
tr: Robotumuzun, seviye atladıkça gücününde artmasını istiyoruz. Sağlığını katlayarak artıralım!
uk: Ми хочемо, щоб наш робот ставав сильнішим у міру підвищення рівня. Давайте збільшимо його здоров'я в геометричній прогресії!
zh_hans: 我们想让机器人随升级而变强。让我们指数式地增加它的生命值！

source: Reducing damage at higher levels
hu: Sebzés csökkentése magasabb szineteken
nl: Schade beperken op hogere niveaus
pl: Zmniejszenie otrzymywanych obrażeń na wyższych poziomach
tr: Daha yüksek seviyelerde hasarı azaltmak
uk: Зменшення шкоди на вищих рівнях
zh_hans: 高等级时会减少伤害量

source: When our robot's [code]level[/code] is [code]3[/code] or more, we want it to take a lot less damage.
uk: Коли [code]level[/code] нашого робота становить [code]3[/code] або більше, ми хочемо, щоб він отримував набагато менше шкоди.

source: Add to the [code]take_damage()[/code] function so the following happens:
uk: Додайте до функції [code]take_damage()[/code], щоб відбулося наступне:

source: - [code]if[/code] the robot's [code]level[/code] is greater than [code]2[/code], reduce the damage [code]amount[/code] by 50%
uk: - [code]if level[/code] робота перевищує [code]2[/code], зменшити [code]amount[/code] пошкоджень на 50%

source: The robot is level 3. An enemy is going to attack for 10 damage. This damage should reduce to 5.
uk: Робот має 3 рівень. Ворог збирається атакувати, завдаючи 10 ушкоджень. Ця шкода має зменшитися до 5.

source: At higher levels, we want our robot to be super tough and take even less damage!
hu: Magasabb szinteken szeretnénk, ha arobot szuper ellenálló lenne, és még kevesebb sebzést szenvedne el!
nl: Op hogere niveaus willen we dat onze robot supersterk is en nog minder schade oploopt!
pl: Na wyższych poziomach chcemy, aby nasz robot był superwytrzymały i otrzymywał jeszcze mniej obrażeń!
tr: Daha yüksek seviyelerde, robotumuzun çok sağlam olmasını ve daha da az hasar almasını istiyoruz!
uk: На вищих рівнях ми хочемо, щоб наш робот був надміцним і отримував ще менше пошкоджень!
zh_hans: 在更高的等级上，我们希望我们的机器人超级强悍并且受到的伤害降低！

source: Multiplying
hu: Szorzás
nl: Vermenigvuldigen
pl: Pomnażanie
tr: Çarpma Yapmak
uk: множення
zh_hans: 使用乘法

source: Our robot's health is always between [code]0[/code] and [code]100[/code]. But as our robot fights, we want to increase its strength and toughness. When a character levels up, it might deal more damage to enemies, gain new abilities or, in our case, gain more health.
hu: A robotunk élete mindig [code]0[/code] és [code]100[/code] között van. De ahogy harcol a robotunk, szeretnénk növelni az erejét és az ellenállását. Amikor a karakter szintet lép, lehet, hogy többet sebez, vagy új képességekre tesz szert, vagy, esetünkben, több életet szerez.
nl: De gezondheid van onze robot ligt altijd tussen [code]0[/code] en [code]100[/code]. Maar terwijl onze robot vecht, willen we zijn sterkte en taaiheid vergroten. Als een personage een niveau omhoog gaat, zou het meer schade aan vijanden toe kunnen brengen, nieuwe vaardigheden kunnen krijgen of, in ons geval, meer gezondheid kunnen krijgen.
pl: Zdrowie naszego robota jest zawsze wartością pomiędzy [code]0[/code] a [code]100[/code]. Jednak w miarę jak nasz robot będzie walczył, będziemy chcieli zwiększyć jego siłę i wytrzymałość. Gdy postać zdobędzie nowy poziom, może zadawać wrogom większe obrażenia, otrzymać nowe umiejętności lub, w naszym przypadku, zyskać więcej zdrowia.
tr: Robotumuzun sağlığı her zaman [code]0[/code] ve [code]100[/code] arasındadır. Ancak robotumuz savaştıkça, gücünü ve dayanıklılığını artırmak istiyoruz. Bir karakter seviye atladığında, düşmanlara daha fazla hasar verebilir, yeni yetenekler kazanabilir, veya bizim durumumuzda daha fazla sağlık kazanabilir.
zh_hans: 我们机器人的血量状况始终介于 [code]0[/code] 和 [code]100[/code] 之间。 但是当我们的机器人战斗时，我们想要增加它的力量和韧性。 当一个角色升级时，它可能会对敌人造成更多伤害，获得新的能力，或者在我们的例子中，获得更多的血量。

source: We define a [code]level[/code] variable to keep track of the level of the robot. It starts at level one. When the robot has defeated enough enemies, we call the [code]level_up()[/code] function to increment the robot's level.
hu: Létrehozunk egy [code]level[/code] nevű változót, hogy eltároljuk a robot szintjét. Az egyes szinttel kezdődik. Ha a robot elég ellenfeled győzött le, hívjuk a [code]level_up()[/code] függvényt, hogy növelje a szintet.
nl: We definiëren een variabele [code]level[/code] om het niveau van de robot bij te houden. Het begint op niveau één. Wanneer de robot genoeg vijanden heeft verslagen, roepen we de functie [code]level_up()[/code] aan om het niveau van de robot te verhogen.
pl: Definiujemy zmienną [code]level[/code], aby śledzić poziom robota. Zaczynać będziemy na poziomie pierwszym. Gdy robot pokona wystarczającą liczbę wrogów, wywołamy funkcję [code]level_up()[/code] do zwiększenia poziomu robota.
tr: Robotun seviyesini takip etmek için bir [code]level[/code] (seviye) değişkeni tanımlıyoruz. Robot, birinci seviyeden başlıyor. Robot yeterince düşman yendiğinde, robotun seviyesini artırmak için [code]level_up()[/code] (seviye_atla) fonksiyonunu çağırıyoruz.
zh_hans: 我们定义一个 [code]level[/code]（等级） 变量来跟踪机器人的等级。从一级开始。 当机器人击败足够多的敌人时，我们调用 [code]level_up()[/code]（等级增加） 函数来增加机器人的等级。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code]. The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]heal()[/code] function to use this variable.
nl: In deze les richten we ons alleen op het verhogen van de [code]max_health[/code] van de robot. De variabele [code]max_health[/code] is de maximale hoeveelheid [code]health[/code] van de robot. We veranderen onze [code]heal()[/code] functie om deze variabele te gebruiken.
tr: Bu derste, sadece robotun [code]max_health[/code] (en_yüksek_sağlık) değerini artırmaya odaklanacağız. [code]max_health[/code] değişkeni, robotun [code]sağlığının[/code] olabileceği en yüksek miktardır. [code]heal()[/code] fonksiyonumuzu, bu değişkeni kullanacak şekilde değiştiriyoruz.
zh_hans: 在本课中，我们把重心放在增加机器人的 [code]max_health[/code]（最大生命值）变量上。 变量 [code]max_health[/code] 是机器人的 [code]血量[/code] 可以达到的最大值。用这个来把 [code]take_damage()[/code] 函数做些改进。

source: This would increase [code]max_health[/code] the same amount every time. If we graphed [code]max_health[/code], it'd look something like this.
hu: Ez minden alkalommal ugyanannyival növelné a [code]max_health[/code] értékét. Ha grafikonon ábrázolnánk a [code]max_health[/code] értékét, valahogy így nézne ki.
nl: Hierdoor zou [code]max_health[/code] elke keer evenveel toenemen. Als we een grafiek van [code]max_health[/code] zouden maken, zou het er ongeveer zo uitzien.
pl: Zwiększać to będzie wartość [code]max_health[/code] za każdym razem o tę samą wartość. Gdybyśmy narysowali wykres [code]max_health[/code], wyglądałoby to mniej-więcej tak:
tr: Bunu yapmak, [code]max_health[/code] değerini her seferinde aynı miktarda artıracaktır. Eğer [code]max_health[/code] için bir çizelge yaparsak, şöyle bir şey ortaya çıkacaktır.
zh_hans: 这会让 [code]max_health[/code] 每次增加一个相同的量。 如果绘制 [code]max_health[/code] 的变化趋势，看起来会像这样。

source: This growth is [b]linear[/b]. In our case, we want a feeling of more and more power as the robot levels up. We want a graph like this.
hu: Ezt [b]lineáris[/b] növekedésnek hívjuk. Esetünkben, azt akarjuk elérni, hogy egyre erősebbnek tűnjön a robot, ahogy lépked felfelé a szinteken. Egy ilyen grafikont szeretnénk.
nl: Deze groei is [b]lineair[/b]. In ons geval willen we een gevoel van steeds meer kracht naarmate de robot hogere niveaus bereikt. We willen een grafiek zoals deze.
pl: Wzrost ten jest [b]liniowy[/b]. W naszym przypadku chcielibyśmy mieć poczucie coraz większej mocy w miarę zdobywania kolejnych poziomów. Chcemy mieć taki wykres:
tr: Bu büyüme [b]doğrusaldır[/b]. Bizim durumumuzda, robot seviye atladıkça çok daha fazla güç hissi istiyoruz. Bunun gibi bir çizelge istiyoruz.
zh_hans: 这种增长是[b]线性[/b]的。 在我们这个例子中，我们希望每次机器人的升级的时候，能感受到越来越强大的力量增幅。 我们想要的图表是这样的。

source: This growth is [b]exponential[/b]. With each level, more [code]max_health[/code] is added than the previous level up. To get the exponential growth, we multiply the [code]max_health[/code] by an amount greater than [code]1[/code] each time the robot levels up. To multiply values together, we use [code]*[/code].
hu: Ez [b]exponenciális[/b] növekedés. Minden szinten, többet nő a [code]max_health[/code], mint az előzőn. Az exponenciális növekedéshez, megszorozzuk a [code]max_health[/code] értéket egy [code]1[/code]-nél nagyobb számmal, minden alakalommal, ha a robot szintet lép. A változók összeszorzásához a [code]*[/code] karaktert használjuk.
nl: Deze groei is [b]exponentieel[/b]. Met elk niveau wordt er meer [code]max_health[/code] toegevoegd dan met het vorige niveau. Om de exponentiële groei te krijgen, vermenigvuldigen we de [code]max_health[/code] met een hoeveelheid groter dan [code]1[/code] elke keer dat de robot een niveau stijgt. Om waarden met elkaar te vermenigvuldigen, gebruiken we [code]*[/code].
pl: Wzrost ten jest [b]wykładniczy[/b]. Z każdym poziomem dodawane jest więcej [code]max_health[/code] niż przy poprzednim awansie o poziom. Aby uzyskać wzrost wykładniczy, mnożymy [code]max_health[/code] przez wartość większą niż [code]1[/code] za każdym razem, gdy robot zdobywa kolejny poziom. Aby pomnożyć wartości przez siebie, używamy symbolu [code]*[/code].
tr: Bu büyüme [b]üsteldir[/b]. Her seviyede, [code]max_health[/code] üzerine bir önceki seviyeye göre daha fazla ekleme yapılır. Üstel büyümeyi elde etmek için, robot her seviye atladığında [code]max_health[/code] değerini [code]1[/code]'den büyük bir miktarla çarpıyoruz. Değerleri birbiriyle çarpmak için [code]*[/code] (yıldız) işaretini kullanırız.
zh_hans: 这种增长是[b]指数[/b]形式的。 每次升级都会比上次升级获得更多的 [code]max_health[/code]增加量。 为了实现指数增长，每当机器人升级时，需要将 [code]max_health[/code] 乘以一个大于 [code]1[/code] 的值。 要将值相乘，我们使用 [code]*[/code]。

source: [code] var level = 5 var power = 3 func calculate_damage(): var damage = power * level [/code]
tr: [code] var seviye= 5 var güç = 3 func hasar_hesapla(): var hasar = güç * seviye [/code]

source: [code] var level = 5 var power = 3 func calculate_damage(): var damage = power * level damage *= 2 [/code]
tr: [code] var seviye= 5 var güç = 3 func hasar_hesapla(): var hasar = güç * seviye hasar *= 2 [/code]

source: The value of [code]damage[/code] starts as [code]15[/code]. Then, [code]damage *= 2[/code] multiplies it by [code]2[/code] to get [code]30[/code].
hu: A [code]damage[/code] értéke [code]15[/code]-ről indul. Ezután, a [code]damage *= 2[/code] beszoroizza [code]2[/code]-vel, hogy [code]30[/code] legyen.
nl: De waarde van [code]damage[/code] begint als [code]15[/code]. Vervolgens vermenigvuldigt [code]damage *= 2[/code] het met [code]2[/code] om [code]30[/code] te krijgen.
pl: Wartość [code]damage[/code] zaczyna się od [code]15[/code]. Następnie [code]damage *= 2[/code] mnoży je przez [code]2[/code], w wyniku czego uzyskujemy wynik [code]30[/code].
tr: [code]hasar[/code]'ın değeri, [code] 15[/code] olarak başlar. Ardından, [code]hasar *= 2[/code] satırı, bunu [code]2[/code] ile çarparak [code]30[/code] verir.
zh_hans: [code]damage[/code] 的初始值是 [code]15[/code] 。 然后，[code]damage *= 2[/code] 是把damage乘以 [code]2[/code] 达到 [code]30[/code]。

source: Let's make the robot stronger when it levels up. Add to the [code]level_up()[/code] function so it does the following: - Increases [code]level[/code] by one. - Increases [code]max_health[/code] by 10%.
hu: Tegyük erősebbé a roboto, ha szintet lép. Egészítsük ki a [code]level_up()[/code] függvényt a következőképpen: - Növelje a [code]level[/code] értékét eggyel. - Növelje a [code]max_health[/code] értékét 10%-kal.
nl: Laten we de robot sterker maken wanneer hij een hoger level bereikt. Vul de functie [code]level_up()[/code] aan zodat deze het volgende doet: - Verhoogt [code]level[/code] met één. - Verhoogt [code]max_health[/code] met 10%.
pl: Uczyńmy robota silniejszym, gdy awansuje o poziom. Dodaj do funkcji [code]level_up()[/code] odpowiedni kod, aby wykonywała następujące czynności: - Zwiększała [code]level[/code] o jeden. - Zwiększała [code]max_health[/code] o 10%.
tr: Hadi şimdi, seviye atladığında robotu daha güçlü yapalım. [code]level_up()[/code] fonksiyonuna aşağıdakileri yaptıracak şekilde ekleme yap: - seviyesini, [code]level[/code], bir artırır. - en yüksek sağlık seviyesini, [code]max_health[/code], %10 artırır.
zh_hans: 让机器人在升级时变得更强大。 给 [code]level_up()[/code] 函数新增一些代码，使其能执行以下操作： - 将 [code]level[/code] 增加1点。 - 将 [code]max_health[/code] 提高 10%。
