Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-23-append-to-arrays.po
Languages: da, fr, hu, it, nl, pt, pt_br, tr, uk, zh_hans

source: In previous lessons, you learned how to create arrays to store lists of values and how to loop over them. It's nice, but you won't go far with only that.
hu: Az előző leckékben megtanultad, hogyan készíts tömböket változók tárolására, és hogyan menj végig rajtuk. Remek, de ez önmagában nem sok mindenre elég.

source: The real strength of arrays is that you can add and remove values from them at any time. It allows you to [i]queue[/i] or [i]stack[/i] data.
hu: A tömbök igazi ereje, hogy bármikor hozzájuk adhatsz vagy elvehetsz egy értéket belőlük. Használhatod őket [i]verem[/i]-ként, vagy [i]sor[/i]-ként.

source: For now, let's take another example.
fr: Pour l'instant, prenons un autre exemple.
hu: Egyelőre, nézzünk egy másik példát.
it: Per ora, prendiamo un altro esempio.
nl: Laten we voor nu nog een ander voorbeeld bekijken.
pt: Por enquanto, vamos ver outro exemplo.
pt_br: Por enquanto, vamos ver outro exemplo.
tr: Şimdilik, hadi başka bir örneği ele alalım.
zh_hans: 现在，让我们再举一个例子。

source: Tracking orders in a restaurant management game
da: Holde styr på ordrer i et restaurantstyrings spil
fr: Suivi des commandes dans un jeu de gestion de restaurant
hu: Rendelések követése egy éttermes játékban
it: Gestire ordini in un gioco gestionale
nl: Bestellingen bijhouden in een restaurantmanagementspel
pt: Rasteamento de pedidos num jogo de gestão de restaurante
pt_br: Rastreamento de pedidos em um jogo de gerenciamento de restaurante
tr: Bir lokanta yönetimi oyununda siparişleri takip etmek
uk: Відстеження замовлень у грі про управління рестораном
zh_hans: 在餐厅管理游戏中跟踪订单顺序

source: You're making a restaurant management game where customers place orders, and you need to handle them as they come.
hu: Egy étterem menedzselős játékon dolgozol, ahol a vendégek rendelhetnek, és abban a sorrendben kell kiszolgálnod őket, ahogy jöttek.

source: In this game, customers order meals that end up in a queue. You need to prepare them in the kitchen.
hu: Ebben a játékban, a vendégek ételeket rendelnek, amelyek egy sorba rendeződnek. El kell készítened őket a konyhában.

source: In this example, we simulate orders arriving and getting completed over time.
hu: Ebben a példában. a beérkező rendeléseket és azok elkészítését szimuláljuk.

source: How do you keep track of pending and completed orders? With an array!
da: Hvordan holder du styr på ventende og afsluttede ordrer? Med et array!
hu: Hogyan tudod nyomon követni a várakozó és az elkészült rendeléseket? Egy tömbbel!
uk: Як ви відстежуєте незавершені та виконані замовлення? З масивом!

source: When a customer purchases a meal, you want to [i]append[/i] it to the array. Then, as you complete a meal in the kitchen and serve it, you want to remove it from the array.
hu: Amikor a vendég rendel egy ételt, akkor azt [i]hozzá akarod adni[/i] a tömbhöz. Aztán, ahogy elkészült az étel a konyhában, el akarod távolítani a tömbből.

source: You can do that with the [code]append()[/code] and the [code]pop_front()[/code] functions of the array, respectively.
hu: Ezeket az [code]append()[/code] és a [code]pop_front()[/code] függvényekkel tudod megtenni.

source: Try to read the code below before moving on. Don't worry if not everything makes sense, as we'll break it all down.
da: Prøv at læse koden nedenfor, før du går videre. Bare rolig, hvis ikke alt giver mening, da vi vil gennemgå det hele.
hu: Próbáld megérteni a lenti a kódot, mielőtt továbblépsz. Ne aggódj, ha nem mindet sikerül, mert majd részletezzük.
uk: Спробуйте прочитати код нижче, перш ніж рухатися далі. Не хвилюйтеся, якщо не все має сенс, оскільки ми все розберемо.

source: Notice how we call some functions by writing a dot after a variable name. Like a given value type can have sub-variables, it can also have its own functions.
hu: Vedd észre, hogy néhány függvényt úgy hívunk, hogy egy pontot teszünk a változó neve után. Ahogy bizonyos változó típusoknak lehetnek alváltozóik, úgy lehetnek saját függvényeik is.

source: Functions like [code]append()[/code] and [code]pop_front()[/code] only exist on arrays. That's why to call them, we need to access it from the array using the dot: [code]array.append()[/code].
hu: Az [code]append()[/code] és a [code]pop_front()[/code] függvények, csak tömbökből hívhatóak. Ezért, ahhoz, hogy használhassuk őket, a tömbből kell hívni őket a pont segítségével: [code]array.append()[/code].

source: Let's break down the code.
hu: Nézzük meg részletesebben a kódot.

source: We queue orders in the [code]waiting_orders[/code] array by appending them to the array.
hu: Sorbaállítjuk a rendeléseket a [code]waiting_orders[/code] tömbben, úgy, hogy hozzáadjuk őket.

source: We can use a string to represent a meal when calling the [code]add_order()[/code] function.
da: Vi kan bruge en streng til at repræsentere et måltid, når vi kalder funktionen [code]add_order()[/code].
fr: Nous pouvons utiliser une chaîne de caractères pour représenter un repas lorsque nous appelons la fonction [code]add_order()[/code].
hu: Használhatunk szöveget is az étel jelölésésre, amikor hívjuk az [code]add_order()[/code] függvényt.
it: Possiamo usare una stringa per rappresentare una pietanza quando chiamiamo la funzione [code]add_order()[/code].
nl: We kunnen een string gebruiken om een maaltijd aan te duiden wanneer we de functie [code]add_order()[/code] aanroepen.
pt: Podemos usar uma string para representar uma refeição ao chamar a função [code]add_order()[/code].
pt_br: Podemos usar uma string para representar uma refeição ao chamar a função [code]add_order()[/code].
tr: [code]add_order()[/code] (ekle_sipariş) fonksiyonunu çağırırken, bir yemeği temsil etmesi için bir dize kullanabiliriz.
uk: Ми можемо використовувати рядок для представлення страви під час виклику функції [code]add_order()[/code].
zh_hans: 在调用 [code]add_order()[/code] （追加订单）函数时，可以用字符串来表示某一顿饭。

source: When completing an order, we remove it from the [code]waiting_orders[/code] array by calling its [code]pop_front()[/code] function. This function gives us the order back, which allows us to assign it to a temporary variable.
da: Når vi fuldfører en ordre, fjerner vi den fra [code]waiting_orders[/code]-arrayet ved at kalde dens [code]pop_front()[/code]-funktion. Denne funktion giver os ordren tilbage, hvilket giver os mulighed for at tildele den til en midlertidig variabel.
fr: Lorsqu'une commande est terminée, nous la retirons du tableau [code]waiting_orders[/code] en appelant sa fonction [code]pop_front()[/code]. Cette fonction nous renvoie la commande, ce qui nous permet de l'assigner à une variable temporaire.
hu: Ha elkészült egy rendelés, eltávolítjuk a [code]waiting_orders[/code] tömbből, a [code]pop_front()[/code] függvényének hívásával. Ez a függvény visszaadja a rendelést, így azt elmenthetjük egy átmenti változóba.
it: Quando viene completato un ordine, lo rimuoviamo dall'array [code]waiting_orders[/code] chiamando la sua funzione [code]pop_front()[/code]. Questa funzione ci restituisce l'ordine e ci consente ti assegnarlo ad una variabile temporanea.
nl: Wanneer we een bestelling voltooien, verwijderen we deze uit de array [code]waiting_orders[/code] door de functie [code]pop_front()[/code] aan te roepen. Deze functie geeft ons de bestelling terug, waardoor we deze kunnen toewijzen aan een tijdelijke variabele.
pt: Ao concluir um pedido, removemo-lo do array [code]waiting_orders[/code] chamando a função [code]pop_front()[/code] dele. Essa função devolve-nos o pedido, o que nos permite atribuí-lo a uma variável temporária.
pt_br: Ao concluir um pedido, nós o removemos do array [code]waiting_orders[/code] chamando sua função [code]pop_front()[/code]. Essa função nos devolve o pedido, o que nos permite atribuí-lo a uma variável temporária.
tr: Bir siparişi tamamlarken, [code]pop_front()[/code] fonksiyonunu çağırarak onu [code]waiting_orders[/code] dizisinden kaldırırız. Bu fonksiyon bize siparişi geri verir, bu da onu geçici bir değişkene atamamızı sağlar.
uk: Виконуючи замовлення, ми видаляємо його з масиву [code]waiting_orders[/code], викликаючи його функцію [code]pop_front()[/code]. Ця функція повертає нам порядок, що дозволяє нам призначити його тимчасовій змінній.
zh_hans: 订单完成后，通过调用数组的 [code]pop_front()[/code] 函数，将它从 [code]waiting_orders[/code] 数组中移除。 该函数会将这个移除的订单作为参数返回，这样就可以把它分配给一个临时变量。

source: We can then append the order to our [code]completed_orders[/code] array.
da: Vi kan derefter tilføje ordren til vores [code]completed_orders[/code] array.
fr: Nous pouvons ensuite ajouter la commande à notre tableau de commandes complétées appelé [code]completed_orders[/code].
hu: Ezután hozzáadhatjuk a rendelést a [code]completed_orders[/code] tömbünkhöz.
it: Possiamo accodare l'ordine al nostro array [code]completed_orders[/code].
nl: We kunnen de bestelling vervolgens toevoegen aan onze array [code]completed_orders[/code].
pt: Podemos então anexar o pedido ao nosso array [code]completed_orders[/code].
pt_br: Podemos então anexar o pedido ao nosso array [code]completed_orders[/code].
tr: Daha sonra siparişi [code]completed_orders[/code] (tamamlanan_siparişler) dizimize ekleyebiliriz.
uk: Потім ми можемо додати замовлення до нашого масиву [code]completed_orders[/code].
zh_hans: 然后就可以将这个订单追加到我们的 [code]completed_orders[/code] （已经完成的订单）数组中。

source: We call arrays like [code]waiting_orders[/code] a [i]queue[/i]: the first element we append to the array is the first one we remove.
fr: Nous appelons des tableaux comme [code]waiting_orders[/code] une [i]file d'attente[/i] (en anglais [i]queue[/i]) : le premier élément que nous ajoutons au tableau est le premier que nous retirons.
hu: A [code]waiting_orders[/code]-hez hasonló tömböket [i]sor[/i]-nak (angolul 'queue') hívjuk: az első elem, amit hozzáadtunk, lesz az első, amit majd elveszünk.
it: Chiamiamo gli array come [code]waiting_orders[/code] delle [i]code[/i]: il primo elemento che accodiamo è il primo che rimuoviamo.
nl: We noemen arrays zoals [code]waiting_orders[/code] een [i]wachtrij[/i]: het eerste element dat we toevoegen aan de array is het eerste dat we verwijderen.
pt: Chamamos arrays como [code]waiting_orders[/code] de [i]queue[/i]: o primeiro elemento que anexamos ao array é o primeiro que removemos.
pt_br: Chamamos arrays como [code]waiting_orders[/code] de [i]queue[/i]: o primeiro elemento que anexamos ao array é o primeiro que removemos.
tr: [code]waiting_orders[/code] gibi dizilere bir [i]queue[/i] (sıra) ismini veriyoruz: diziye eklediğimiz ilk eleman, çıkardığımız ilk elemandır.
zh_hans: 我们将类似 [code]waiting_orders[/code] 这样的数组称为 [i]queue[/i]（队列）：最早被追加进数组的，会被第一个移除。

source: What does #... mean?
da: Hvad betyder #... ?
fr: Que signifie #... ?
hu: Mit jelent a #...?
it: Cosa significa "#..."?
nl: Wat betekent #...?
pt: O que significa #...?
pt_br: O que significa #...?
tr: #... ne anlama geliyor?
uk: Що означає #...?
zh_hans: 这里的#...是什么意思？

source: We write [code]#...[/code] to represent ellipses in the code. It means "we're completing the function's code." We use that to break down code examples and make them easier to learn from.
hu: A [code]#...[/code]-t használjuk arra, hogy jellezzük a kódrészleteket. Azt jelenti, hogy "befejezzük a függvény kódját." Arra, használjuk, hogy feldaraboljuk a példákat és könnyebben tanulhatóvá tegyük őket.

source: The hash sign itself marks the start of a code comment. It's a line the computer will ignore, which is why it typically appears in grey.
hu: A kettőskereszt a kód komment kezdetét jelöli. Ezt a sort a számítógép figyelmen kívül hagyja, ezért általában szürkén jelenik meg.

source: Using arrays as stacks
da: Brug af arrays som stakke
fr: Utiliser des tableaux comme des piles
hu: Töbök használata veremként
it: Usando gli array come delle pile
nl: Arrays als stapels gebruiken
pt: Usando arrays como stacks (empilhamento de dados)
pt_br: Usando arrays como stacks (empilhamento de dados)
tr: Dizileri, yığınlar olarak kullanmak
uk: Використання масивів як стеків
zh_hans: 使用数组实现堆栈（stack）

source: Another common use of arrays is [i]stacks[/i] of data.
da: En anden almindelig brug af arrays er [i]stakke[/i] af data.
hu: Egy másik gyakori felhasználási módj a tömöknek, a [i]verem[/i].
uk: Іншим поширеним використанням масивів є [i]стеки[/i] даних.

source: Take a factory management game where you need to retrieve materials from stacks of crates. They arrive at the factory piled up vertically, and you need to take them from top to bottom.
da: Tag et fabriksstyringsspil, hvor du skal hente materialer fra stakke af kasser. De ankommer til fabrikken stablet lodret op, og du skal flytte dem fra top til bund.
hu: Vegyünk példának egy olyan játékot, ahol egy gyárban ládákból kell kivenni az alapanyagokat. A gyárba egymásra pakolva érkeznek meg, neked pedig fentről lefelé kell elhasználnod őket.
uk: Візьміть гру управління фабрикою, де вам потрібно отримати матеріали зі стосів ящиків. На фабрику вони надходять вертикально складеними, а брати їх потрібно зверху вниз.

source: To take a crate from the back of the array, this time, we use the [code]pop_back()[/code] array function.
da: For at tage en kasse fra bagenden af arrayet bruger vi denne gang arrayfunktionen [code]pop_back()[/code].
hu: Ahhoz, hogy vegyünk egy ládát a sor végéről, ezúttal a [code]pop_back()[/code] függvényt fogjuk használni.
uk: Цього разу, щоб взяти ящик із задньої частини масиву, ми використовуємо функцію масиву [code]pop_back()[/code].

source: This function removes (pops) the last value from the array and returns it to you.
da: Denne funktion fjerner (pop-er) den sidste værdi fra arrayet og returnerer den til dig.
hu: Ez a függvény eltávolítja a tömb utolsó elemét, és átadja neked.
uk: Ця функція видаляє (вискакує) останнє значення з масиву та повертає його вам.

source: Here we pop the last value of the array and print what's left of the array to demonstrate how the array gets smaller.
da: Her pop-er vi den sidste værdi i arrayet og udskriver det, der er tilbage af arrayet, for at demonstrere, hvordan arrayet bliver mindre.
hu: Itt eltávolítjuk a tömb utolsó elemét, majd kiíratjuk, mi maradt a benne, hogy bemutassuk, hogy lesz egyre kisebb.
uk: Тут ми витягуємо останнє значення масиву та друкуємо те, що залишилося від масиву, щоб продемонструвати, як масив стає меншим.

source: Like [code]pop_front()[/code], the function returns the value removed from the array. You will often store that value in a variable.
hu: Ahogy a [code]pop_front()[/code], ez a függvény is visszadja az eltávolított értéket. Ezt az értéket gyakran egy változóban tárolod majd.

source: The value in question could be the crate's content, which you can then use to give resources to the player.
hu: A kérdéses érték lehet a láda tartalma, amit aztán arra használhatsz, hogy nyersanyagokat adj a játékosnak.

source: In the following practices, you will use the [code]append()[/code], [code]pop_front()[/code], and [code]pop_back()[/code] array functions.
da: I de følgende øvelser vil du bruge arrayfunktionerne [code]append()[/code], [code]pop_front()[/code] og [code]pop_back()[/code].
hu: A következő példákban az [code]append()[/code], a [code]pop_front()[/code], és a [code]pop_back()[/code] tömb függvényeket fogod használni.
uk: У наведених нижче практиках ви будете використовувати функції масиву [code]append()[/code], [code]pop_front()[/code] і [code]pop_back()[/code].

source: Completing orders
da: Færdiggørelse af ordrer
fr: Compléter des commandes
hu: Rendelések teljesítése
it: Completare gli ordini
nl: Bestellingen afhandelen
pt: Concluindo pedidos
pt_br: Concluindo pedidos
tr: Siparişleri tamamlamak
uk: Виконання замовлень
zh_hans: 完成订单

source: The [code]waiting_orders[/code] array will be filled over time.
da: Arrayet [code]waiting_orders[/code] vil blive udfyldt over tid.
hu: A [code]waiting_orders[/code] tömb az idő haladtával fel fog töltődni.
uk: Масив [code]waiting_orders[/code] з часом буде заповнено.

source: Your job is to move orders from the waiting list to the [code]completed_orders[/code] list using the array's [code]append()[/code] and [code]pop_front()[/code] functions.
da: Din opgave er at flytte ordrer fra ventelisten til listen [code]completed_orders[/code] ved hjælp af arrayets funktioner [code]append()[/code] og [code]pop_front()[/code].
hu: A te feladatod, hogy átvidd a rendeléseket a várólistáról a [code]completed_orders[/code] listára, a tömb [code]append()[/code] és [code]pop_front()[/code] függvényeivel.
uk: Ваше завдання — перемістити замовлення зі списку очікування до списку [code]completed_orders[/code] за допомогою функцій [code]append()[/code] і [code]pop_front()[/code] масиву.

source: Remember that the array's [code]pop_front()[/code] function returns the popped value, which allows you to store it in a variable and then pass it to another function.
da: Husk, at arrayets funktion [code]pop_front()[/code] returnerer den udfyldte værdi, hvilket giver dig mulighed for at gemme den i en variabel og derefter sende den til en anden funktion.
hu: Ne feledd, a tömb [code]pop_front()[/code] függvénye visszaadja az eltávolított értéket, ami lehetővé teszi, hogy tárold azt és átadd egy másik függvénynek.
uk: Пам’ятайте, що функція [code]pop_front()[/code] масиву повертає отримане значення, що дозволяє зберегти його в змінній, а потім передати в іншу функцію.

source: Orders are piling up in the kitchen, and we need to clear them fast using the array's [code]pop_front()[/code] function.
da: Ordrerne hober sig op i køkkenet, og vi er nødt til at få dem klaret hurtigt ved hjælp af arrayets [code]pop_front()[/code] funktion.
fr: Les commandes s'accumulent dans la cuisine et nous devons les compléter rapidement en utilisant la fonction [code]pop_front()[/code] du tableau.
hu: A rendelések gyűlnek a konyhában, nekünk pedig gyorsan el kell tüntetnünk őket a tömb [code]pop_front()[/code] függvényével.
it: Gli ordini si stanno accumulando in cucina e dobbiamo completarli velocemente usando la funzione per array [code]pop_front()[/code].
nl: De bestellingen stapelen zich op in de keuken en we moeten ze snel wegwerken met behulp van de functie [code]pop_front()[/code] van de array.
pt: Os pedidos acumulam-se na cozinha e precisamos completa-los rapidamente usando a função [code]pop_front()[/code] do array.
pt_br: Os pedidos estão se acumulando na cozinha e precisamos completa-los rapidamente usando a função [code]pop_front()[/code] do array.
tr: Siparişler mutfakta birikiyor, ve dizinin [code]pop_front()[/code] fonksiyonunu kullanarak bunları hızlı bir şekilde temizlememiz gerekiyor.
uk: Замовлення накопичуються на кухні, і нам потрібно швидко їх очистити за допомогою функції [code]pop_front()[/code] масиву.
zh_hans: 厨房里的订单堆积如山，我们需要使用数组的 [code]pop_front()[/code] 函数快速清除它们。

source: Clearing up the crates
da: Rydder op i kasserne
fr: Déplacer les caisses
hu: A ládák eltüntetése
it: Svuotare le casse
nl: Kratten opruimen
pt: Limpar as caixas
pt_br: Limpando as caixas
tr: Sandıkları düzenlemek
uk: Розчищення ящиків
zh_hans: 清理箱子

source: Crates are piling up on the platform. Move them out of the way by popping them from the [code]crates[/code] array.
da: Kasser hober sig op på platformen. Flyt dem ud af vejen ved at poppe dem op fra [code]crates[/code]-arrayet.
hu: A ládák egyre csak gyűlnek a platformon. Távolítsd el őket a [code]crates[/code] tömbből.
uk: На платформі накопичуються ящики. Пересуньте їх, витягнувши їх із масиву [code]crates[/code].

source: You need to remove them from top to bottom using the array's [code]pop_back()[/code] function.
da: Du skal fjerne dem fra top til bund ved hjælp af arrayets [code]pop_back()[/code]-funktion.
hu: Fentről lefelé kell eltávolítanod őket [code]pop_back()[/code] függvény segítségével.
uk: Вам потрібно видалити їх зверху вниз за допомогою функції [code]pop_back()[/code] масиву.

source: Your code should remove all the crates in the array using a while loop.
da: Din kode bør fjerne alle kasserne i arrayet ved hjælp af en while-løkke.
hu: A kódodnak az összes ládát el kell távolítani egy while ciklus segítségével.
uk: Ваш код має видалити всі ящики в масиві за допомогою циклу while.

source: [b]Careful![/b] if you run a while loop carelessly, you can lock the software.
hu: [b]Vigyázz![/b], ha meggondolatlanul használod a while ciklust, megakaszthatod a programot.

source: You can check if the [code]crates[/code] array still contains values by writing [code]while crates:[/code]
hu: Ellenőrizheted, hogy a [code]crates[/code] tömbben vannak-e még értékek, ha azt írod [code]while crates:[/code]

source: Crates are piling up on the platform. Move them out of the way by popping them from their array.
da: Kasser hober sig op på platformen. Flyt dem ud af vejen ved at poppe dem ud af deres array.
fr: Des caisses s'empilent sur la plateforme. Déplacez-les en les retirant de leur tableau.
hu: Gyűlnek a ládák a platformon. Szabadulj meg tőlük úgy, hogy eltávolítod őket a tömbből.
it: Le casse si stanno accumulando sulla piattaforma. Spostale via rimuovendole dal loro array.
nl: Kratten stapelen zich op op het platform. Haal ze uit de weg door ze uit hun array te pakken.
pt: As caixas acumulam-se na plataforma. Mova-as para fora do caminho, tirando-as do array.
pt_br: As caixas estão se acumulando na plataforma. Mova elas para fora do caminho, tirando-as do array.
tr: Sandıklar birikmeye başladı. Onları dizildikleri yerden kaldırıp yoldan çek.
uk: На платформі накопичуються ящики. Перемістіть їх убік, викинувши їх із масиву.
zh_hans: 地上的板条箱堆积如山。将它们从数组中弹出，将它们移走。

source: Appending and popping values from arrays
da: Tilføjelse og fjernelse af værdier fra arrays
fr: Ajouter et enlever des valeurs des tableaux
hu: Értékek hozzáadása a tömbhöz és azok eltávolítása
it: Accodando ed eliminando valori negli array
nl: Waarden toevoegen aan en verwijderen uit arrays
pt: Anexar e remover valores de arrays
pt_br: Anexando e removendo valores de arrays
tr: Dizilere değer eklemek ve dizilerden değer çıkarmak
uk: Додавання та вилучення значень із масивів
zh_hans: 从数组中追加或弹出值

source: In previous lessons, you learned how to create arrays to store lists of values and how to loop over them. That's useful, but arrays can do much more.
da: I tidligere lektioner lærte du, hvordan man opretter arrays til at gemme lister over værdier, og hvordan man looper over dem. Det er nyttigt, men arrays kan gøre meget mere.
uk: У попередніх уроках ви дізналися, як створювати масиви для зберігання списків значень і як виконувати цикли над ними. Це корисно, але масиви можуть набагато більше.

source: The real strength of GDScript arrays is that you can add and remove values from them at any time. This lets you build waiting lines of data or piles of data. We call these [i]queues[/i] and [i]stacks[/i], respectively. We'll see what that means in this lesson.
da: Den virkelige styrke ved GDScript-arrays er, at du kan tilføje og fjerne værdier fra dem når som helst. Dette giver dig mulighed for at opbygge ventelinjer med data eller stakke af data. Vi kalder disse henholdsvis [i]køer[/i] og [i]stakke[/i]. Vi vil se på, hvad det betyder i denne lektion.
uk: Справжня сила масивів полягає в тому, що ви можете додавати та видаляти значення з них у будь-який час. Це дозволяє [i]ставити в чергу[/i] або [i]стосувати[/i] дані.

source: Let's look at a concrete example.
da: Lad os se på et konkret eksempel.
uk: Давайте розглянемо конкретний приклад.

source: You're making a restaurant management game where customers place orders, and you need to handle them one by one.
da: Du laver et restaurantstyringsspil, hvor kunderne afgiver ordrer, og du skal håndtere dem én efter én.
uk: Ви створюєте гру про управління рестораном, де клієнти розміщують замовлення, і вам потрібно обробляти їх, коли вони надходять.
