Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-13-conditions.po
Languages: de, fr, hu, pl, tr, zh_hans

source: In previous lessons, we decreased and increased a character's health, but there was no limit to how much health they could have.
de: In früheren Lektionen haben wir das Leben des Charakters verringert und erhöht, aber es gab keine Begrenzung, wie viel Gesundheit er haben konnte.
fr: Dans les leçons précédentes, nous avons diminué et augmenté la santé d'un personnage, mais il n'y avait pas de limite à la quantité de santé qu'il pouvait avoir.
hu: Az előző leckékben növeltük és csökkentettük a karakterünk életét, de nem volt határa annak, hogy mennyi lehet neki.
pl: W poprzednich lekcjach zmniejszaliśmy i zwiększaliśmy zdrowie postaci, jednak nie ustaliliśmy ograniczeń co do tego, ile zdrowia mogą maksymalnie i minimalnie mieć.
tr: Önceki derslerde, bir karakterin sağlığını azaltıp artırıyorduk, ancak ne kadar sağlığa sahip olabilecekleri konusunda bir sınır yoktu.
zh_hans: 在之前的课程中，我们减少过也增加过角色的生命值，但角色可以拥有多少生命值没有限制。

source: As a result, the player could increase their character's health indefinitely, which we do not want.
de: Infolgedessen kann der Spieler das Leben seines Charakters uneingeschränkt erhöhen, was wir nicht wollen.
fr: En conséquence, le joueur pouvait augmenter indéfiniment la santé de son personnage, ce que nous ne voulons pas.
hu: Ennek eredményeképpen a játékos a végtelenségig növelheti az életei számát, amit nem szeretnénk.
pl: Rezultatem tego była możliwość zwiększania zdrowia postaci w nieskończoność, czego w naszej grze nie chcemy.
tr: Sonuç olarak, oyuncu karakterinin sağlığını sınırısz olarak arttırabilir, ki biz bunu istemiyoruz.
zh_hans: 结果，玩家可以无限地增加角色的生命值，这是我们不想要的。

source: What happens to health when we damage our character?
de: Was passiert mit dem Leben, wenn wir unserem Charakter Schaden zufügen?
fr: Qu'arrive-t-il à la santé lorsque nous endommageons notre personnage ?
hu: Mi történik az élettel, ha sebződik a karakterünk?
pl: Co dzieje się ze zdrowiem, gdy nasza postać otrzymuje obrażenia?
tr: Karakterimize zarar verdiğimizde, sağlığa (health) ne olur?
zh_hans: 当对我们的角色造成伤害时，生命值会发生什么变化？

source: Suppose our character has [code]100[/code] health.
pl: Załóżmy, że nasza postać ma [code]100[/code] zdrowia.

source: What would the value of health be if we called [code]take_damage(25)[/code] [b]five times[/b]?
pl: Jaka byłaby wartość zdrowia, gdybyśmy wywołali funkcję [code]take_damage(25)[/code] [b]pięć razy[/b]?

source: Calling [code]take_damage(25)[/code] five times would subtract a total of [code]125[/code] from [code]100[/code].
pl: Wywołanie [code]take_damage(25)[/code] pięć razy spowoduje odjęcie [code]125[/code] od [code]100[/code].

source: We can use conditions to run actions [b]selectively[/b].
pl: Do uruchamiania akcji [b]selektywnie[/b] możemy użyć warunków.

source: Conditions make your code branch into two paths: if the condition is met, the computer will run the corresponding instructions. Otherwise, those instructions will not run at all.
pl: Warunki powodują, że twój kod rozgałęzia się na dwie ścieżki: jeśli warunek jest spełniony, komputer uruchomia odpowiednie instrukcje. W przeciwnym razie te instrukcje w ogóle nie są brane pod uwagę.

source: Video games and other computer programs are full of conditions. For example, game input largely relies on conditions: [i]if[/i] the player presses the button on a gamepad, the character jumps.
de: Videospiele und andere Computerprogramme sind voller Bedingungen. Zum Beispiel hängt die Spieleingabe weitgehend von Bedingungen ab: [i]Wenn[/i] der Spieler die Taste auf einem Gamepad drückt, springt der Charakter.
fr: Les jeux vidéo et autres programmes informatiques sont pleins de conditions. Par exemple, la saisie dans les jeux reposent en grande partie sur des conditions : [i]si[/i] le joueur appuie sur le bouton d'une manette, le personnage saute.
hu: A videójátékok és más programok tele vannak feltételekkel. Például, az input nagyban függ a feltételektől: [i]ha[/i] a játékos megnyomja a gombot a kontrolleren, a karakter ugrik egyet.
pl: Gry wideo i inne programy komputerowe są pełne warunków. Na przykład dane wejściowe w grze w dużej mierze zależą od warunków: [i]jeśli[/i] gracz naciśnie przycisk na gamepadzie, wówczas postać podskoczy.
tr: Video oyunları ve diğer bilgisayar programları koşullarla doludur. Örneğin, oyun girdisi büyük ölçüde koşullara dayanır: [i]eğer[/i] oyuncu, oyun kolundaki düğmeye basarsa, karakter zıplar.
zh_hans: 电子游戏和其他计算机程序充满了各种各样的条件。例如，游戏的操作输入很大程度上依赖条件运作：[i]如果（if）[/i]玩家按下游戏手柄上的对应按钮，角色就会跳跃。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code].
pl: Gdy komputer sprawdza warunek, nazywa się to ocenianiem warunku. Wszystkie warunki oceniają się jako [code]true[/code] lub [code]false[/code].

source: Either the player is pressing the button, or not. Either the character is touching an enemy, or not.
pl: Albo gracz naciska przycisk, albo nie. Albo postać dotyka wroga, albo nie.

source: In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum.
pl: W naszym przypadku, jeśli zdrowie przekroczy wartość maksymalną, chcemy je zresetować do maksimum.

source: To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], [ignore]type the condition to evaluate, and end the line with a colon.
pl: Aby zdefiniować warunek, używamy słowa kluczowego [code]if[/code]. Piszesz linię zaczynającą się od [code]if[/code], wpisujesz warunek do oceny i kończysz linię dwukropkiem.

source: We've seen how function definitions use a colon at the end of the first line and nest content inside.
pl: Mieliśmy już sposobność zobaczyć, jak definicje funkcji używają dwukropka na końcu pierwszego wiersza i zagnieżdża w nim treści.

source: In GDScript, this syntax is a recurring pattern for all code blocks.
pl: W GDScript ta składnia jest powtarzającym się wzorcem dla wszystkich bloków kodu.

source: The computer knows which instructions belong to the condition because they are indented.
pl: Komputer wie, które instrukcje należą do warunku, ponieważ są odpowiednio wcięte.

source: Comparisons
de: Vergleiche
fr: Comparaisons
hu: Összehasonlítások
pl: Porównania
tr: Karşılaştırmalar
zh_hans: 做比较

source: In the above example, we used the [code]>[/code] syntax to mean "greater than".
pl: W powyższym przykładzie użyliśmy znaku [code]>[/code] do przekazania komputerowi, że coś jest „większe niż”.

source: We can compare numbers in other ways too.
pl: Liczby możemy porównywać również na inne sposoby.

source: [code]>[/code] means "greater than" [code]<[/code] means "less than" [code]==[/code] means "equal to" [code]!=[/code] means "not equal to"
pl: [code]>[/code] oznacza „większe niż” [code]<[/code] oznacza „mniejsze niż” [code]==[/code] oznacza „równe” [code]!=[/code] oznacza „nierówne”

source: Here's how we might use these in [code]if[/code] statements.
pl: Oto jak możemy używać ich podczas tworzenia warunku [code]if[/code]:

source: Which of these statements are true?
de: Welche der folgenden Aussagen sind wahr?
fr: Lesquelles de ces affirmations sont vraies ?
hu: Melyik állítás igaz?
pl: Które z tych warunków są prawdziwe?
tr: Bu ifadelerden hangileri doğrudur?
zh_hans: 这些陈述中哪些是正确（true）的？

source: The comparison [code]3 > 1[/code] means "three is greater than one" which is [b]true[/b]. The comparison [code]2 < 3[/code] means "two is less than three" which is [b]true[/b]. The comparison [code]1 != 3[/code] means "one is not equal to three" which is [b]true[/b].
pl: Porównanie [code]3 > 1[/code] oznacza, że „trzy jest większe niż jeden”, co jest [b]prawdą[/b]. Porównanie [code]2 < 3[/code] oznacza „dwa to mniej niż trzy”, co jest [b]prawdą[/b]. Porównanie [code]1 != 3[/code] oznacza „jeden nie jest równy trzem”, co jest [b]prawdą[/b].

source: The comparison [code]2 == 1[/code] means "two is equal to one" which is [b]false[/b]. The comparison [code]3 < 1[/code] means "three is less than one" which is [b]false[/b].
pl: Porównanie [code]2 == 1[/code] oznacza, że „dwa są równe jednemu”, co jest [b]fałszem[/b]. Porównanie [code]3 < 1[/code] oznacza „trzy to mniej niż jeden”, co jest [b]fałszem[/b].

source: Or else...
de: Oder...
fr: Ou sinon...
hu: Különben...
pl: Jest też wypadek przeciwny…
tr: Ya değilse...
zh_hans: 否则的话...

source: The [code]if[/code] keyword comes with a complementary [code]else[/code] keyword.
pl: Słowo kluczowe [code]if[/code] zawiera uzupełniające słowo kluczowe [code]else[/code] (w przeciwnym razie).

source: You can write an [code]else[/code] block after an [code]if[/code] block, like so.
pl: Możesz dodać blok [code]else[/code] po bloku [code]if[/code] w taki oto sposób:

source: The [code]else[/code] block will run whenever the condition above it isn't met.
de: Der Block [code]else[/code] wird immer dann ausgeführt, wenn die Bedingung darüber nicht erfüllt ist.
fr: Le bloc [code]else[/code] s'exécutera chaque fois que la condition qui le précède n'est pas remplie.
hu: AZ [code]else[/code] blokk akkor fog lefutni, ha a felette lévő feltétel nem teljesül.
pl: Blok [code]else[/code] zostanie uruchomiony, gdy warunek powyżej niego nie zostanie spełniony.
tr: [code]else[/code] gövdesi, üstteki koşul karşılanmadığında çalışacaktır.
zh_hans: 如果不满足上面的条件，[code]else[/code] 块就会被执行。

source: In the following practices, we'll use conditions and improve the way our character's health changes so it has limits.
de: In den folgenden Übungen verwenden wir Bedingungen und verbessern die Art und Weise, wie sich das Leben unseres Charakters verändert, so dass es Grenzen hat.
fr: Dans la pratique suivante, nous utiliserons des conditions et améliorerons la façon dont la santé de notre personnage change pour qu'elle ait des limites.
hu: A következő példákban feltételeket fogunk használni, és javítunk azon, hogyan változik a karakter élete, így már lesznek határai.
pl: W czekających nas ćwiczeniach wykorzystamy warunki i poprawimy sposób działania zdrowia naszej postaci dodając do niego stpsowne ograniczenia.
tr: Sıradaki alıştırmalarda, koşulları kullanacağız ve karakterimizin sağlığının değişme şeklini geliştireceğiz, böylece sınırları olacak.
zh_hans: 在接下来的练习中，我们将使用条件来改进角色血量的变化模式，使其数值大小受到限制。

source: Using Comparisons
de: Verwenden von Vergleichen
fr: Utiliser des comparaisons
hu: Összehasonlítások használata
pl: Korzystanie z porównań
tr: Karşılaştırmaları Kullanmak
zh_hans: 使用比较语句

source: Keep the values and statements as they are; only change the comparison signs.
pl: Zachowaj wartości i stwierdzenia takimi, jakimi są; zmień wyłącznie znaki porównania.

source: As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code]
pl: Przypominamy, że znaki porównania to: [code] > większe niż < mniejsze niż == równe != nierówne [/code]

source: The line [code]health < 5:[/code] means "health is less than 5".
pl: Wiersz [code]health < 5:[/code] oznacza „zdrowie jest mniejsze niż 5”.

source: Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
pl: Ponieważ [code]health = 100[/code] jest fałszem, komunikat [code]print("health is greater than five.")[/code] nie zostanie wyświetlony.

source: Comparing values allows us to make decisions in code. But there's something wrong with these statements..
de: Der Vergleich von Werten ermöglicht es uns, Entscheidungen im Code zu treffen. Aber mit diesen Aussagen stimmt etwas nicht.
fr: La comparaison des valeurs nous permet de prendre des décisions dans le code. Mais il y a un problème avec ces affirmations...
hu: Az értéket összehasonlításával döntéseket tudunk hozni a kódban. De valami nem stimmel ezekkel az állításokkal...
pl: Porównywanie wartości pozwala nam podejmować decyzje w kodzie. Ale z tymi warunkami coś jest nie tak…
tr: Değerleri karşılaştırmak, kod içinde kararlar vermemizi sağlar. Ama bu ifadelerde yanlış olan bir şey var.
zh_hans: 比较值的大小的话，就能在代码中做出各种决定。但是这里的代码状况有点不对头。。

source: Limiting Healing
de: Heilung einschränken
fr: Limiter la guérison
hu: Gyógyulás korlátozása
pl: Ograniczanie uzdrawiania
tr: İyileşmeyi Sınırlamak
zh_hans: 约束回血量

source: We have a heal function that adds an amount to the character's health.
pl: Mamy tu funkcję leczenia, która zwiększa zdrowie postaci.

source: Add to the function so the character's health is never greater than [code]80[/code].
pl: Dodaj do funkcji odpowiedni warunek, który sprawi, że zdrowie postaci nigdy nie wyniesie więcej niż [code]80[/code].

source: As much as we might like, we don't want our robot to have too much health. Limit how much healing the robot can take.
de: Wir wollen nicht, dass unser Roboter zu viel Leben hat. Begrenze, wie viel Heilung der Roboter erhalten kann.
fr: Autant que nous aimerions l'idée, nous ne voulons pas que notre robot ait trop de santé. Limitez la quantité de soins que le robot peut prendre.
hu: Bármennyire is jó lenne, nem szeretnénk, hogy a robotunknak túl sok élete legyen.Korlátozd, mennyit gyógyulhat a robot.
pl: Na ile może nam się to podobać, na tyle nie chcemy, aby robot w naszej grze miał zbyt dużo zdrowia. Ogranicz ilość leczenia, którą może przyjąć robot.
tr: Ne kadar çok hoş olsa da, robotumuzun aşırı fazla sağlığının olmasını istemiyoruz. Robotun ne kadar iyileşme alabileceğini sınırla.
zh_hans: 尽管大家都爱高血量，我们不希望机器人的血量超出预期。限制机器人通过治疗恢复的生命值。

source: Preventing Health from Going Below Zero
de: Verhindern, dass die Gesundheit unter Null fällt
fr: Empêcher la santé de passer en dessous de zéro
hu: Az élet 0 alá csökkenésének megakadályozása
pl: Zapobieganie spadnięciu zdrowia poniżej zera
tr: Sağlığın Sıfırın Altına Düşmesini Önlemek
zh_hans: 防止血量低于零

source: We might want to display the health number on screen, like in Japanese RPGs.
pl: Możemy chcieć wyświetlać stan zdrowia na ekranie niczym w japońskich grach RPG.

source: We don't want negative numbers. We want to stop at zero instead.
pl: Przez to nie chcemy liczb ujemnych. Zamiast tego chcemy zatrzymać się na zerze.

source: Calling the function should reduce [code]health[/code] by [code]amount[/code].
pl: Zastąp [code]pass[/code] kodem, który zmniejsza [code]health[/code] o [code]amount[/code].

source: If [code]health[/code] goes below [code]0[/code], set it to [code]0[/code] again.
pl: Jeśli [code]health[/code] spadnie poniżej wartości [code]0[/code], ponownie ustaw go na [code]0[/code].

source: Having a negative health value doesn't make a lot of sense. Make sure the robot's health can't go below zero.
de: Negatives Leben zu haben, ergibt nicht viel Sinn. Stelle sicher, dass die Gesundheit des Roboters nicht unter Null fallen kann.
fr: Avoir une valeur de santé négative n'a pas beaucoup de sens. Assurez-vous que la santé du robot ne peut pas descendre en dessous de zéro.
hu: A negatív életnek nem sok értelme van. Győződj meg róla, hogy a robot élete nem mehet 0 alá.
pl: Posiadanie ujemnej wartości zdrowia nie ma większego sensu. Upewnij się, że zdrowie robota nie spadnie poniżej zera.
tr: Negatif bir sağlık değerine sahip olmak pek mantıklı değil. Robotun sağlığının sıfırın altına düşemeyeceğinden emin ol.
zh_hans: 值是负数的血量不怎么合理。确保机器人的血量不能低于零。

source: Conditions
de: Bedingungen
hu: Feltételek
pl: Warunki
tr: Koşullar
zh_hans: 条件语句

source: Suppose our character has [code]100[/code] health. What would the value of health be if we called [code]take_damage(25)[/code] [b]five times[/b]?
de: Angenommen, unser Charakter hat [code]100[/code] Leben. Was wäre der Wert des Lebens, wenn wir [code]take_damage(25)[/code] [b]fünfmal[/b] aufrufen?
fr: Supposons que notre personnage ait [code]100[/code] de santé. Quelle serait la valeur de la santé si nous appelions [code]take_damage(25)[/code] [b]cinq fois[/b] ?
hu: Tegyük fel, hogy a karakterünknek [code]100[/code] élete van. Mennyi élete maradna, ha [b]ötször[/b] hívnánk a [code]take_damage(25)[/code] függvényt?
tr: Karakterimizin [code]100[/code] sağlığına sahip olduğunu varsayalım. [code]take_damage(25)[/code] çağrısını [b]beş kez[/b] yapsaydık sağlık değeri (health) ne olurdu?
zh_hans: 假设我们的角色有 [code]100[/code] 点生命值。 如果调用 [code]take_damage(25)[/code]（受伤） [b]五次[/b]，health的值是多少？

source: Calling [code]take_damage(25)[/code] five times would subtract a total of [code]125[/code] from [code]100[/code]. 100 75 50 25 0 -25
de: Ein fünfmaliger Aufruf von [code]take_damage(25)[/code] würde insgesamt [code]125[/code] von [code]100[/code] subtrahieren. 100 75 50 25 0 -25
fr: Appeler [code]take_damage(25)[/code] cinq fois soustrairait un total de [code]125[/code] de [code]100[/code]. 100 75 50 25 0 -25
hu: A [code]take_damage(25)[/code] függvény ötszöri hívása [code]125[/code]-öt vonna ki a [code]100[/code]-ból. 100 75 50 25 0 -25
tr: [code]take_damage(25)[/code] 'in beş kez çağrılması, toplamda [code]125[/code] değerini [code]100[/code] değerinden çıkaracaktır. 100 75 50 25 0 -25
zh_hans: 调用 [code]take_damage(25)[/code] 五次将从 [code]100[/code] 中减去总共 [code]125[/code]。 100 75 50 25 0 -25

source: We can use conditions to run actions [b]selectively[/b]. Conditions make your code branch into two paths: if the condition is met, the computer will run the corresponding instructions. Otherwise, those instructions will not run at all.
de: Wir können Bedingungen verwenden, um Aktionen [b]selektiv[/b] auszuführen. Durch Bedingungen verzweigt sich dein Code in zwei Pfade: Wenn die Bedingung erfüllt ist, führt der Computer die entsprechenden Anweisungen aus. Andernfalls werden diese Anweisungen überhaupt nicht ausgeführt.
fr: Nous pouvons utiliser des conditions pour exécuter des actions [b]sélectivement[/b]. Les conditions font que votre code se divise en deux branches : si la condition est remplie, l'ordinateur exécutera les instructions correspondantes. Sinon, ces instructions ne seront pas exécutées du tout.
hu: Használhatunk feltételeket, hogy [b]szelektíven[/b] futtassuk a kódot. A feltételek két irányba ágazzák a kódot: ha a feltétel teljesül, a számítógép végrehajtja a hozzá tatrtozó utasításokat. Ennek hiányában a kódrész nem fog lefutni.
tr: Eylemleri [b]seçerek[/b] çalıştırmak için koşulları kullanabiliriz Koşullar, kodunu iki yola ayrırır: koşul doğrulanırsa, bilgisayar ilgili talimatları çalıştırır. Aksi takdirde, bu talimatlar hiç çalışmayacaktır.
zh_hans: 我们可以使用条件来[b]选择性地[/b]运行操作。 条件使你的代码产生分支，出现两条路径：如果满足条件，计算机将运行相应的一些指令。否则，这些指令将不会被运行。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code]. Either the player is pressing the button, or not. Either the character is touching an enemy, or not. In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum. To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], [ignore]type the condition to evaluate, and end the line with a colon.
fr: Lorsque l'ordinateur vérifie une condition, on appelle cela [b]évaluer[/b] une condition. Toutes les conditions [b]évaluent[/b] à [code]true[/code] (« vrai ») ou à [code]false[/code] (« faux »). Soit le joueur appuie sur le bouton, soit il ne le fait pas. Soit le personnage touche un ennemi, soit il ne le fait pas Dans notre cas, [i]si[/i] la santé dépasse une valeur maximale, nous voulons la réinitialiser à cette valeur maximale. Pour définir une condition, nous utilisons le mot-clé [code]if[/code] (« si » en anglais). Nous écrivons une ligne commençant par [code]if[/code], nous écrivons la condition à évaluer et nous terminons la ligne par deux-points.
tr: Bilgisayar bir koşulu kontrol ettiğinde, buna [b]bir koşulu[/b] değerlendirmek denir. Tüm koşullar, ya [code]true[/code] (doğru) ya da [code]false[/code] (yanlış) olarak [b]değerlendirilir[/b] . Oyuncu düğmeye basıyor, ya da basmıyor. Karakter bir düşmana dokunuyor, ya da dokunmuyor. Bizim durumumuzda, [i]eğer[/i] sağlık, izi verilen en yüksek değerin üzerine çıkarsa, bunu en yüksek değere geri değiştirmek istiyoruz. Bir koşul tanımlamak için [code]if[/code] (eğer) anahtar sözcüğünü kullanırız. Satırı yazmaya, [code]if[/code] ile başlıyoruz, değerlendirilecek koşulu yazıyoruz, ve satırı iki nokta üst üste ile bitiriyoruz.
zh_hans: 当计算机检查一个条件时，称为 [b] 评估 [/b] 一个条件。条件 [b]评估[/b] 的结果要么是 [code]true[/code]（真） 要么是 [code]false[/code]（假）。 玩家要么按着按钮，要么没按。角色要么碰到了敌人，要么就是没碰到。 在我们的例子中，[i]如果[/i] 生命值超过最大值，我们得将其重置为最大值。 要定义条件，我们使用 [code]if[/code]（如果） 关键字。以 [code]if[/code] 开头，键入要评估的条件，并以冒号结束该行。

source: Notice the [code]>[/code] comparison sign. We read this symbol as "greater than". We've seen how function definitions use a colon at the end of the first line and nest content inside. In GDScript, this syntax is a recurring pattern for all code blocks. The computer knows which instructions belong to the condition because they are indented.
fr: Remarquez le signe de comparaison [code]>[/code]. Nous lisons ce symbole comme « supérieur à ». Nous avons vu comment les définitions de fonction utilisent deux-points à la fin de la première ligne et imbriquent le contenu à l'intérieur. Dans GDScript, cette syntaxe est un modèle récurrent pour tous les blocs de code. L'ordinateur sait quelles instructions appartiennent à la condition car elles sont en retrait.
tr: [code]>[/code] karşılaştırma işaretine dikkat et. Bu sembolü "büyüktür" olarak okuruz. Fonksiyon tanımlarının, ilk satırın sonunda iki nokta üst üste kullandığını, ve talimatların içine nasıl yerleştirildiğini gördük. GDScript'te bu sözdizimi tüm kod kalıpları için yinelenen bir modeldir. Bilgisayar, satırda girintili oldukları için, hangi talimatların koşula ait olduğunu bilir.
zh_hans: 注意这个比较符号 [code]>[/code] 。该符号读作“大于”。 我们有看过怎么定义函数，在第一行末尾要使用冒号，以及如何在其中嵌套内容。 在 GDScript 中，这种语法模式对于所有代码块都是适用的。 计算机能知道哪些指令属于该条件，因为它们缩进过。

source: In the above example, we used the [code]>[/code] syntax to mean "greater than". We can compare numbers in other ways too. [code]>[/code] means "greater than" [code]<[/code] means "less than" [code]==[/code] means "equal to" [code]!=[/code] means "not equal to" Here's how we might use these in [code]if[/code] statements.
de: Im obigen Beispiel bedeutet die Syntax [code]>[/code] "größer als". Wir können Zahlen auch auf andere Weise vergleichen. [code]>[/code] bedeutet "größer als" [code]<[/code] bedeutet "kleiner als" [code]==[/code] bedeutet "gleich" [code]!=[/code] bedeutet "nicht gleich" Hier ist, wie wir diese in [code]if[/code]-Anweisungen verwenden können.
fr: Dans l'exemple ci-dessus, nous avons utilisé la syntaxe [code]>[/code] pour signifier « supérieur à ». Nous pouvons aussi comparer les chiffres d'autres manières. [code]>[/code] signifie « supérieur à » [code]<[/code] signifie « inférieur à » [code]==[/code] signifie « égal à » [code]!=[/code] signifie « n'est pas égal à » Voici comment nous pourrions les utiliser dans les affirmations [code]if[/code].
hu: A fenti példában a [code]>[/code] jelet használtuk, hogy azt mondjuk "nagyobb, miknt". Másként is hasonlíthatuink össze számokat. a [code]>[/code] jelentése "nagyobb, mint" a [code]<[/code] jelentése "kisebb, mint" az [code]==[/code] jelentése "egyenlő" a [code]!=[/code] jelentése "nem egyenlő" Itt egy példa, hogyan használhatjuk ezeket egy [code]if[/code] (feltételes) függvényben.
tr: Yukarıdaki örnekte, "büyüktür" anlamına gelmek üzere [code]>[/code] işaretini kullandık. Sayıları başka şekillerde de karşılaştırabiliriz. [code]>[/code] "büyüktür" anlamına gelir [code]<[/code] "küçüktür" anlamına gelir [code]==[/code] "eşittir" anlamına gelir [code]!=[/code] "eşit değil" anlamına gelir İşte bunları [code]if[/code] ifadelerinde nasıl kullanabileceğimize dair bir kaç örnek.
zh_hans: 在上面的示例中，我们使用 [code]>[/code] 语法来表示“大于”。 我们也可以用其他方式比较数字。 [code]>[/code] 意思是“大于” [code]<[/code] 意思是“小于” [code]==[/code] 意思是“等于” [code]!=[/code] 表示“不等于” 下面是在 [code]if[/code] 语句中使用它们的方法。
