Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-25-creating-dictionaries.po
Languages: de, hu, nl, zh_hans

source: In the last lesson, we used an array to represent a player's inventory.
hu: Az előző leckében egy tömbbel reprezentáltuk a játékos leltárát.

source: With just an array of item names, though, we can't easily keep track of the amount of each item.
hu: Csak a a tárgyak neveivel. Azonban, így nem túl könnyű számon tartani, hogy miből mennyi van.

source: Instead, we can bundle the item names and amounts into a single [i]dictionary[/i].
hu: Ehelyett, egybegyúrhatjuk a tárgyak neveit és mennyiségét egy [i]könyvtárban[/i].

source: A dictionary is a data structure that allows you to map pairs of values. In the pair, we call the first value a [i]key[/i] as we use it to access the second.
hu: A könyvtár egy olyan adatstrúktúra, mely lehetővé teszi, hogy adatpárokat tárolj. A pár első elemét [i]kulcsnak (key)[/i] hívjuk, mert ezt használjuk arra, hogy elérjük a másodikat.

source: In other words, a dictionary has a list of [i]keys[/i], and each key points to a [i]value[/i].
hu: Más szóval, a könyvtár tartalmaz egy listát a [i]kulcsokról[/i], és minden kulcs egy [i]értékre[/i] mutat.

source: To define a dictionary, we use curly brackets. A colon separates each key and its value. A comma separates each key and value pair.
hu: Könyvtárat szögletes zárójelekkel tudunk létrehozni. Kettőspont választja el egymástól a kulcsot és az értékét. A kulcs-érték párokat pedig vessző választja el egymástól.

source: Dictionaries can hold any values
de: Dictionaries können jegliche Werte (bzw. Typen) beinhalten
hu: A könyvtárak bármilyen értéket tárolhatnak
nl: Dictionaries kunnen elke waarde bevatten
zh_hans: 字典可以保存任何值

source: Dictionaries can map about any value to any other value.
hu: A könyvtárak bármilyen értéket hozzárendelhetnek bármilyen másikhoz.

source: For example, we can use the name of an item as a key and the amount as the corresponding value. This makes dictionaries excellent for keeping track of a player's inventory.
hu: Például, használhatjuk egy tárgy nevét kulcsként, a mennyiségét pőedig a hozzátartozó értékként. Ez remek választássá teszi a könyvtárat a játékos eszköztárának nyomonkövetésére.

source: Here we matched the name (a string) to the amount (a number). But a key could be a string, a number, or even a vector!
hu: Itt hozzárendeltük a nevet (szöveg) a mennyiséghez (szám). A kulcs lehet szöveg szám, vagy akár vektor is!

source: Although we can have all of these different keys, keep in mind that every key has to be [i]unique[/i]. That means we [i]couldn't[/i] have a dictionary like the following.
hu: Habár ilyen sokféle kulcsunk lehet, ne feledd, hogy minden kulcsnak [i]egyedinek[/i] kell lennie. Tehát, [i]nem lehet[/i] ilyen könyvtárunk, mint a lenti példában.

source: We would get the following error.
de: Wir würden den folgenden Fehler bekommen.
hu: A következő hibaüzenetet kapnánk.
nl: We zouden de volgende foutmelding krijgen.
zh_hans: 会得到以下错误。

source: In the above example, which key would cause an error?
de: Welcher Schlüssel aus dem oben stehenden Beispiel verursacht einen Fehler?
hu: A fenti példában, melyik kulcs okozná a hibát?
nl: Welke sleutel zou in het bovenstaande voorbeeld een fout veroorzaken?
zh_hans: 在上面的例子中，哪个key是罪魁祸首？

source: The key [code]"healing heart"[/code] appears [b]twice[/b] in the dictionary.
hu: A [code]"healing heart"[/code] kulcs [b]kétszer[/b] szerepel a könyvtárban.

source: In the above example, Godot wouldn't know whether to return [code]3[/code] or [code]8[/code] when using [code]inventory["healing heart"][/code]. This is why keys need to be unique.
hu: A fenti példában, a Godot nem tudná eldönteni, hogy [code]3[/code] vagy [code]8[/code] legyen az érték, ha az [code]inventory["healing heart"][/code] kódot használnánk. Ezért kell a kulcsoknak egyedinek lenni.

source: How dictionaries work under the hood
de: Wie Dictionaries unter der Haube funktionieren
hu: Így működnek a könyvtárak a színfalak mögött
nl: Hoe dictionaries onder de motorkap werken
zh_hans: 字典的工作原理是怎样的

source: Dictionaries are also called mappings or [i]associative arrays[/i]. Under the hood, they use arrays and several functions to efficiently store and retrieve values across arrays.
hu: A könyvtárakat mapnek (térkép), vagy [i]asszociatív tömbnek[/i] is nevezik. A színfalak mögött tömböket használnak, és különböző függvényeket, hogy effektíven tárolják és visszaadják az értékeket a tömbök közt.

source: Precisely, dictionaries use a [i]hashing algorithm[/i]. Hashing algorithms convert one value into another.
hu: Pontosabban, a könyvtárak egy [i]hashing algoritmust[/i] használnak. A hashing algoritmusok egy értéket valami mássá konvertálnak.

source: In this case, hashing consists of converting a given key into a unique whole number. The dictionary then uses that number as an array's index!
hu: Ebben az esetben, a hashing abból áll, hogy egy adott kulcsot egy egyedi egész számmá konvertál. A tömb ezután ezt a számot használja a tömb indexeként!

source: That's how a dictionary works: when you give it a key, it converts it into a unique index and uses that index to retrieve the corresponding value in the computer's memory.
hu: Így működik a könyvtár: ha megadsz egy kulcsot, azt egy egyedi index-szé konvertálja és ezt az indexet használja, hogy visszaadja a hozzá tartozó értéket a számítógép memóriájából.

source: That's also why you can't have the same key twice: it would map to the same array index, causing you to overwrite an existing value.
hu: Ezért nem használhatod kétszer ugyanazt a kulcsot: ugyanarra a tömb indexre kerülne, így felülírná a már ott lévő értéket.

source: Accessing values
de: Auf werte zugreifen
hu: Értékek lehívása
nl: Waarden opvragen
zh_hans: 访问字典的值

source: We access the value of keys by writing the dictionary name, with the key in between square brackets.
de: Wir greifen auf Werte der Schlüssel zu indem wir den Dictionary Name schreiben und den Schlüssel in viereckigen Klammern.
hu: A kulcsok értékét úgy tudjuk lehívni, hogy kiírjuk a könyvtár nevét utána pedig a kulcs nevét, szögletes zárójelek közt.
nl: We vragen de waarden van sleutels op door de naam van de dictionary te schrijven, met de sleutel tussen vierkante haken.
zh_hans: 我们用字典名称来访问key对应的值，前面写字典名，后跟方括号里的key。

source: How would you access how many gems the player has?
de: Wie würdest du auf die Anzahl an 'gems' des Spielers zugreifen?
hu: Hogyan kérnéd le, mennyi drágaköve van a játékosnak?
nl: Hoe zou je kunnen achterhalen hoeveel edelstenen de speler heeft?
zh_hans: 对上面的字典来说，如何访问玩家拥有的宝石（gems）的数量？

source: We need to make sure the key is the same as we defined in the dictionary.
hu: Meg kell róla győződnünk, hogy a kulcs ugyanaz, mint amit a könyvtárban létrehoztunk.

source: In our case, [code]var item_count = inventory["gems"][/code] is correct.
hu: Esetünkben, a [code]var item_count = inventory["gems"][/code] korrekt.

source: Changing values
de: Werte manipulieren
hu: Értékek változtatása
nl: Waarden veranderen
zh_hans: 修改字典的值

source: We can also change values directly, which is useful in our case for adding or removing items from the player's inventory.
de: Wir können auch Werte direkt verändern. Das ist nützlich, wenn wir Items zum Spielerinventar hinzufügen oder entfernen wollen.
hu: Közvetlenül változtathatjuk is az értékeket, amit jelen esetben használhatunk arra, hogy tárgyakat adjunk hozzá, vagy vegyünk el a játékos eszköztárából.
nl: We kunnen waarden ook direct wijzigen, wat in ons geval handig is voor het toevoegen of verwijderen van items in de inventaris van de speler.
zh_hans: 我们还可以直接更改值，在我们的背包例子中，用来从玩家的背包中添加或删除物品很有用。

source: In the following practices, we'll use a dictionary to create a player inventory and create a function to change the value of items.
de: In den nachfolgenden Übungen wollen wir Dictionaries nutzen um das Inventar des Spielers und die Funktionen für das Ändern von Werten und Gegenständen zu erstellen.
hu: A következő példákban arra használjuk a könyvtárat, hogy készítsünk egy eszköztárat a játékosnak és készítünk egy függvényt, hogy változtassuk a tárgyak értékét.
nl: In de volgende oefeningen gebruiken we een dictionary om een spelersinventaris te maken en maken we een functie om de aantallen van voorwerpen te wijzigen.
zh_hans: 在下面的练习中，我们将使用字典来创建玩家的物品栏，并创建一个函数来更改物品对应的值。

source: Creating an inventory using a dictionary
de: Erstellen eines Inventars mit einem Dictionaray
hu: Eszköztár létrehozása könyvtár segítségével
nl: Een inventaris maken met behulp van een dictionary
zh_hans: 使用字典创建背包/物品栏

source: Let's give some items to the player.
hu: Adjunk néhány tárgyat a játékosnak.

source: We use a dictionary for the player's inventory. We defined the [code]inventory[/code] variable for you, but it contains no items yet.
hu: A játékos eszköztárához egy könyvtárat fogunk használni. Már létrehoztuk neked az [code]inventory[/code] nevű változót, de még nincs benne semmi.

source: Give the player the following items by adding the correct keys and values to the dictionary:
hu: Add a játékosnak a következő tárgyakat, úgy, hogy a megfelelő kulcsokat és értékeket adod a könyvtárhoz:

source: - Three "healing heart". - Nine "gems". - One "sword".
hu: - három "healing heart". - kilenc "gems". - egy "sword".

source: The keys should be text strings, and the values whole numbers.
hu: A kulcsok legyenek szövegek, az értékek pedig egész számok.

source: Collecting items is fun, but we need a good way to store them. Write a dictionary to display the player's items.
de: Gegenstände sammeln ist Lustig, aber wir brauchen einen guten Weg sie zu speichern. Schreib ein Dictionary um die Gegenstände des Spielers zu zeigen.
hu: A tárgyak gyűjtögetése jó móka, de kell egy jó módszer, hogy tároljuk is azokat. Készíts egy könyvtárat, a játékos tárgyainak megjelenítésére.
nl: Voorwerpen verzamelen is leuk, maar we hebben een goede manier nodig om ze op te slaan. Schrijf een dictionary om de voorwerpen van de speler weer te geven.
zh_hans: 捡道具很有趣，但我们需要一种很好的方式来储存它们。 编写一个字典来显示玩家的物品。

source: Increasing item counts
de: Erhöhen der Itemanzahl
hu: Tárgyak számának növelése
nl: Aantallen voorwerpen verhogen
zh_hans: 增加物品数量

source: We want to change the item counts in the player's inventory whenever the player picks up or uses an item.
hu: Szeretnénk a tárgyak számát változtatni, mindig, ha a játékos felvesz vagy használ egyet.

source: We've started the [code]add_item()[/code] function for you.
hu: Elkezdtük neked az [code]add_item()[/code] függvényt.

source: The [code]inventory[/code] dictionary should use the [code]item_name[/code] parameter as the key to access its values, and we should increase the value by [code]amount[/code].
hu: Az [code]inventory[/code] könyvtár használja az [code]item_name[/code] paramétert kulcsként, hogy elérje az értékeket, ezt az értéket pedig [code]amount[/code]-tal növeljük.

source: To test this practice, we'll use your [code]add_item()[/code] function to increase the item count of Healing Heart, Gems, and Sword.
hu: Hogy teszteljük, az [code]add_item()[/code] függvényedet használjuk arra, hogy növeljük a Healing Heart, a Gem, és a Sword számát.

source: The player might walk over a pick-up or find something in a chest, so we need a way to change the item counts in our inventory.
de: Der Spieler könnte über ein Gegenstand laufen oder etwas in einer Truhe finden. Also brauchen wir einen Weg die Anzahl der Gegenstände in seinem Inventar zu ändern.
hu: A játékos esetleg átsétál valami felvehető tárgyon, vagy kinyit egy ládát, szóval kell egy módszer, amivel változtathatjuk az eszköztárban lévő tárgyak mennyiségét.
nl: De speler kan iets oppakken of iets in een kist vinden, dus we hebben een manier nodig om het aantal voorwerpen in onze inventaris aan te passen.
zh_hans: 玩家可能会顺道捡起道具或在宝箱里找到什么东西，所以我们需要一种方法来更改背包中物品的数量。

source: Creating Dictionaries
de: Erstellen von Dictionaries
hu: Könyvtárak létrehozása
nl: Dictionaries maken
zh_hans: 创建字典

source: In the last lesson, we used an array to represent a player's inventory. With just an array of item names, though, we can't easily keep track of the amount of each item. Instead, we can bundle the item names and amounts into a single [i]dictionary[/i]. A dictionary is a data structure that allows you to map pairs of values. In the pair, we call the first value a [i]key[/i] as we use it to access the second. In other words, a dictionary has a list of [i]keys[/i], and each key points to a [i]value[/i]. To define a dictionary, we use curly brackets. A colon separates each key and its value. A comma separates each key and value pair.
de: In der letzten Lektion haben wir ein Array verwendet, um das Inventar eines Spielers darzustellen. Mit nur einem Array von Artikelnamen können wir jedoch nicht einfach die Menge jedes Items verfolgen. Stattdessen können wir die Artikelnamen und Mengen in einem einzigen [i]Dictionary[/i] bündeln. Ein Dictionary ist eine Datenstruktur, die es ermöglicht, Paare von Werten zuzuordnen. In diesem Paar nennen wir den ersten Wert einen [i]Schlüssel[/i], da wir ihn verwenden, um auf den zweiten Wert zuzugreifen. Mit anderen Worten, ein Dictionary hat eine Liste von [i]Schlüsseln[/i], und jeder Schlüssel zeigt auf einen [i]Wert[/i]. Um ein Dictionary zu definieren, verwenden wir geschweifte Klammern. Ein Doppelpunkt trennt jeden Schlüssel und seinen Wert. Ein Komma trennt jedes Schlüssel-Wert-Paar.
nl: In de vorige les hebben we een array gebruikt om de inventaris van een speler voor te stellen. Met alleen een array van voorwerpnamen kunnen we echter niet eenvoudig de hoeveelheid van elk voorwerp bijhouden. In plaats daarvan kunnen we de voorwerpnamen en hoeveelheden bundelen in een [i]dictionary[/i]. Een dictionary is een datastructuur waarin je paren van waarden kunt opslaan. In het paar noemen we de eerste waarde een [i]sleutel[/i] omdat we deze gebruiken om toegang te krijgen tot de tweede. Met andere woorden, een dictionary heeft een lijst met [i]sleutels[/i] en elke sleutel verwijst naar een [i]waarde[/i]. Om een dictionary te definiëren, gebruiken we accolades. Een dubbele punt scheidt elke sleutel en zijn waarde. Een komma scheidt elk sleutel- en waardepaar.
zh_hans: 在上一课中，我们用了一个数组来表示玩家的背包。 但是，仅使用一个物品名称的数组，没办法轻松跟踪每个物品的数量。 更进一步的话，可以将物品名称和数量捆绑到同一个 [i]字典[/i]（dictionary） 中。 字典是一种数据结构，允许将成对的值映射起来。 在一对映射中，我们将第一个值称为 [i]key[/i]（钥匙，关键），因为我们会用它来访问第二个值。 换句话说，字典有一个[i]keys[/i] 列表，然后每个 key 指向一个 [i]value[/i]。 要定义字典，要使用大括号。 用冒号分隔key和对应的值。 用逗号分隔每对值。

source: Dictionaries can map about any value to any other value. For example, we can use the name of an item as a key and the amount as the corresponding value. This makes dictionaries excellent for keeping track of a player's inventory.
de: Dictionaries können nahezu jeden Wert einem anderen Wert zuordnen. Zum Beispiel können wir den Namen eines Items als Schlüssel verwenden und die Menge als entsprechenden Wert. Das macht Dictionaries ideal, um das Inventar eines Spielers zu verwalten.
nl: Dictionaries kunnen zowat elke waarde aan elke andere waarde koppelen. We kunnen bijvoorbeeld de naam van een voorwerp als sleutel gebruiken en het bedrag als de overeenkomstige waarde. Dit maakt dictionaries uitstekend voor het bijhouden van de inventaris van een speler.
zh_hans: 字典可以将任何值映射给其他任何值。 例如，key可以是物品的名称，对应的值则是物品的数量。这样用字典非常适合用来跟踪玩家的背包库存。

source: Here we matched the name (a string) to the amount (a number). But a key could be a string, a number, or even a vector! Although we can have all of these different keys, keep in mind that every key has to be [i]unique[/i]. That means we [i]couldn't[/i] have a dictionary like the following.
de: Hier haben wir den Namen (einen String) mit der Menge (einer Zahl) verknüpft. Aber ein Schlüssel könnte auch ein String, eine Zahl oder sogar ein Vektor sein! Obwohl wir all diese verschiedenen Schlüssel verwenden können, muss jeder Schlüssel [i]eindeutig[/i] sein. Das bedeutet, wir [i]könnten[/i] kein Dictionary wie das folgende haben.
nl: Hier hebben we de naam (een string) gekoppeld aan het bedrag (een getal). Maar een sleutel kan een string, een getal of zelfs een vector zijn! Hoewel we al deze verschillende sleutels kunnen hebben, moet je onthouden dat elke sleutel [i]uniek[/i] moet zijn. Dat betekent dat we [i]niet[/i] een dictionary kunnen hebben zoals de volgende.
zh_hans: 这里，我们是将物品名称（字符串）与数量（数字）相匹配。 一个key可以是一个字符串、一个数字，甚至是一个向量！ 尽管我们可以用上各种不同类型的key，但请记住，每个key都必须是 [i]唯一的[/i]。 这意味着 [i]不能[/i] 用下面这样的字典。

source: The key [code]"healing heart"[/code] appears [b]twice[/b] in the dictionary. In the above example, Godot wouldn't know whether to return [code]3[/code] or [code]8[/code] when using [code]inventory["healing heart"][/code]. This is why keys need to be unique.
de: Der Schlüssel [code]"healing heart"[/code] erscheint [b]zweimal[/b] im Dictionary. Im obigen Beispiel wüsste Godot nicht, ob es [code]3[/code] oder [code]8[/code] zurückgeben soll, wenn [code]inventory["healing heart"][/code] verwendet wird. Aus diesem Grund müssen Schlüssel eindeutig sein.
nl: De sleutel [code]"healing heart"[/code] komt [b]twee keer[/b] voor in de dictionary. In het bovenstaande voorbeeld zou Godot niet weten of hij [code]3[/code] of [code]8[/code] moet teruggeven als je [code]inventory["healing heart"][/code] gebruikt. Daarom moeten sleutels uniek zijn.
zh_hans: [code]"healing heart"[/code] 在字典中出现了 [b] 两次 [/b]。 在上面的例子中，Godot 在使用 [code]inventory["healing heart"][/code] 时，不知道是该返回 [code]3[/code] 还是返回 [code]8[/code]。 这就是为什么key必须是唯一的。

source: "healing heart"
zh_hans: "healing heart"（回血）

source: "shield"
zh_hans: "shield"（盾牌）

source: "sword"
zh_hans: "sword"（剑）

source: Dictionaries are also called mappings or [i]associative arrays[/i]. Under the hood, they use arrays and several functions to efficiently store and retrieve values across arrays. Precisely, dictionaries use a [i]hashing algorithm[/i]. Hashing algorithms convert one value into another. In this case, hashing consists of converting a given key into a unique whole number. The dictionary then uses that number as an array's index! That's how a dictionary works: when you give it a key, it converts it into a unique index and uses that index to retrieve the corresponding value in the computer's memory. That's also why you can't have the same key twice: it would map to the same array index, causing you to overwrite an existing value.
de: Dictionaries werden auch als Mappings oder [i]assoziative Arrays[/i] bezeichnet. Intern verwenden sie Arrays und mehrere Funktionen, um Werte effizient über Arrays hinweg zu speichern und abzurufen. Genauer gesagt nutzen Dictionaries einen [i]Hashing-Algorithmus[/i]. Hashing-Algorithmen wandeln einen Wert in einen anderen um. In diesem Fall besteht das Hashing darin, einen gegebenen Schlüssel in eine eindeutige ganze Zahl zu konvertieren. Das Dictionary verwendet diese Zahl dann als Index eines Arrays! So funktioniert ein Dictionary: Wenn du ihm einen Schlüssel gibst, wandelt es diesen in einen eindeutigen Index um und verwendet diesen Index, um den entsprechenden Wert im Speicher des Computers abzurufen. Das ist auch der Grund, warum du keinen Schlüssel zweimal haben kannst: Er würde auf denselben Array-Index abbilden und somit einen vorhandenen Wert überschreiben.
nl: Dictionary's worden ook wel afbeeldingen of [i]associatieve arrays[/i] genoemd. Onder de motorkap gebruiken ze arrays en verscheidene functies om efficiënt waarden op te slaan en op te halen uit die arrays. In feite gebruiken dictionaries een [i]hashalgoritme[/i]. Hashalgoritmen zetten een waarde om in een andere. In dit geval bestaat het hashen uit het omzetten van een gegeven sleutel in een uniek geheel getal. De dictionary gebruikt dat getal dan als index voor een array! Dat is hoe een dictionary werkt: als je het een sleutel geeft, zet het die om in een unieke index en gebruikt die index om de overeenkomstige waarde in het geheugen van de computer op te halen. Dat is ook de reden waarom je niet twee keer dezelfde sleutel kunt hebben: het zou naar dezelfde array-index verwijzen, waardoor je een bestaande waarde zou overschrijven.
zh_hans: 字典也称为映射或 [i] 关联数组 [/i]。 底层逻辑中，它会用多个数组和函数来有效地跨数组存储和检索值。 准确地说，字典使用[i]哈希算法[/i]（hashing algorithm）。 哈希算法会将一个值转换为另一个值。 对字典来说，哈希算法将给定的key转换为一个唯一的整数。 字典就能用这个数字作为数组的索引了！ 这就是字典的工作原理：当你给它一个key时，它会将它转换为一个唯一的索引，并使用该索引来检索计算机内存中的相应值（也就是数组）。 这也是不能两次用到同一个key的原因：它会映射到相同的数组索引，结果就是一个位置被写入两次不同的值。后者会把前者覆盖掉。

source: We need to make sure the key is the same as we defined in the dictionary. In our case, [code]var item_count = inventory["gems"][/code] is correct.
de: Wir würden sichergehen, dass der Schlüssel der selbe ist, wie der den wir im Dictionary deklariert haben. In unserem Fall, wäre [code]var item_count = inventory["gems"][/code] richtig.
nl: We moeten ervoor zorgen dat de sleutel dezelfde is als die we in de dictionary hebben gedefinieerd. In dit geval is [code]var item_count = inventory["gems"][/code] correct.
zh_hans: 要确保调用的key和字典中定义的key相同。 在这个例子中，[code]var item_count = inventory["gems"][/code] 是正确的。

source: Let's give some items to the player. We use a dictionary for the player's inventory. We defined the [code]inventory[/code] variable for you, but it contains no items yet. Give the player the following items by adding the correct keys and values to the dictionary: - Three "healing heart". - Nine "gems". - One "sword". The keys should be text strings, and the values whole numbers.
de: Lass uns dem Spieler Gegenstände geben. Wir können ein Dictionary als das Inventar nutzen. Wir definieren die [code]inventory[/code] Variable für euch, sie wird allerdings keine Gegenstände beinhalten. Gib dem Spieler die folgenden Gegenstände indem du die korrekten Schlüssel und Werte dem Dictionary zuweist. - Drei "healing heart". - Neun "gems". - Ein "sword". Die Schlüssel sollten Zeichenfolgen sein und die Werte Zahlen.
nl: Laten we wat voorwerpen aan de speler geven. We gebruiken een dictionary voor de inventaris van de speler. We hebben de variabele [code]inventory[/code] voor je gedefinieerd, maar deze bevat nog geen voorwerpen. Geef de speler de volgende voorwerpen door de juiste sleutels en waarden toe te voegen aan de dictionary: - Drie "healing heart". - Negen "gems". - Eén "sword". De sleutels moeten strings zijn en de waarden gehele getallen.
zh_hans: 让我们给玩家一些物品。 用字典创建玩家的背包。我们已经定义好了 [code]inventory[/code]（背包）变量，但它里面还没有任何物品。 通过将正确的key和对应的值添加到字典中，为玩家提供以下初始物品： - 三个"healing heart"（回复心心）。 - 九颗"gems"（宝石）。 - 一把"sword"（剑）。 key应该是字符串string，对应的数量值应该是整数。
