Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-10-the-game-loop.po
Languages: hu, it, nl, pl, pt_br, sv, zh_hans

source: [font=res://ui/theme/fonts/font_title.tres]Why is [code]_process()[/code] useful?[/font] It's perhaps better to see the [code]_process()[/code] function in action. Take the following example.
sv: [font=res://ui/theme/fonts/font_title.tres]Why is [code]_process()[/code] användbar?[/font] Det är kanske bättre att se funktionen [code]_process()[/code] i aktion. Ta följande exempel.
