Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-15-modulo.po
Languages: cs, de, fr, hu, it, pt_br, ru, tr, zh_hans

source: The modulo operation ([code]%[/code]) calculates the remainder of a whole number division. For example, the modulo of [code]5[/code] by [code]3[/code] ([code]5 % 3[/code]) is [code]2[/code]. We typically use this operation to tell if a number is odd or even or to produce a random number within a particular range (like a dice roll). Play around with the modulo widget on the right to see how modulo works visually.
cs: Operace modulo ([code]%[/code]) vypočítá zbytek po dělení celých čísel. Například modulo [code]5[/code] podle [code]3[/code] ([code]5 % 3[/code]) je [code]2[/code]. Tuto operaci obvykle používáme k určení, zda je číslo sudé nebo liché, nebo k vytvoření náhodného čísla v určitém rozsahu (jako při hodu kostkou). Pohrajte si s widgetem modulo vpravo a podívejte se, jak modulo funguje vizuálně.
de: Die Modulo-Operation ([code]%[/code]) berechnet den Rest einer ganzzahligen Division. Beispielsweise ist das Modulo von [code]5[/code] durch [code]3[/code] ([code]5 % 3[/code]) [code]2[/code]. Wir verwenden diese Operation normalerweise, um festzustellen, ob eine Zahl ungerade oder gerade ist, oder um eine Zufallszahl innerhalb eines bestimmten Bereichs (wie ein Würfelwurf) zu erzeugen. Spiele rechts mit verschiedenen Werten herum, um zu sehen, wie modulo funktioniert.
fr: L'opération modulo ([code]%[/code]) calcule le reste d'une division d'un nombre entier. Par exemple, le modulo de [code]5[/code] par [code]3[/code] ([code]5 % 3[/code]) est [code]2[/code]. Nous utilisons généralement cette opération pour savoir si un nombre est pair ou impair ou pour produire un nombre aléatoire dans une plage particulière (comme un lancer de dé). Jouez avec le widget de modulo sur la droite pour voir comment fonctionne le modulo à niveau visuel.
hu: A modulo ([code]%[/code]) a maradékot adja meg 2 egész szám osztása után. Például, az [code]5[/code] osztva [code]3[/code]-mal ([code]5 % 3[/code]) moduloja [code]2[/code]. Általában arra használjuk, hogy eldöntsük egy számról, hogy páros vagy páratlan, de véletlenszámokat is generálhatunk egy bizonyos határon belül (mint egy kockadobás). Próbálgasd a modulo widgetet a jobb oldalon, hogy vizuálisan is lásd, hogy működik.
it: L'operatore modulo ([code]%[/code]) calcola il resto di una divisione tra numeri interi. Per esempio, il modulo tra [code]5[/code] e [code]3[/code] ([code]5 % 3[/code]) è [code]2[/code]. Tipicamente usiamo questa operazione per capire se un numero è pari o dispari o per produrre un numero casuale all'interno di un particolare intervallo (come una tirata di dato). Sperimenta un po' con l'oggetto modulo sulla destra per vedere come il modulo funzioni visivamente.
pt_br: A operação de módulo ([code]%[/code]) calcula o restante de uma divisão de número inteiro. Por exemplo, o módulo de [code]5[/code] por [code]3[/code] ([code]5 % 3[/code]) é [code]2[/code]. Normalmente usamos essa operação para saber se um número é par ou ímpar ou para produzir um número aleatório dentro de um determinado intervalo (como um lançamento de dados). Brinque um pouco com o widget do módulo à direita para ver como o ele funciona de uma forma mais visual.
ru: Оператор [code]%[/code] рассчитывает остаток от деления целых чисел. Например, остаток от деления [code]5[/code] на [code]3[/code] ([code]5 % 3[/code]) — это [code]2[/code]. Обычно мы используем этот оператор, чтобы проверить чётность числа, либо сгенерировать случайное число в конкретном диапазоне (как при бросании игральной кости). Поэкспериментируйте с виджетом, приложенным справа, чтобы наглядно увидеть, как работает операция получения остатка от деления.
tr: Mod alma işlemi ([code]%[/code] işaretiyle), bir tam sayıyla bölme yapınca, geriye kalanı hesaplar. Örneğin, [code]5[/code] 'in [code]3[/code] ile modu ([code]5 % 3[/code]) [code]2[/code] verir. Bu işlemi genellikle bir sayının tek mi çift mi olduğunu söylemek veya belirli bir aralıkta rastgele bir sayı üretmek için kullanırız (zar atmak gibi). Mod almanın görsel olarak nasıl çalıştığını görmek için sağdaki mod alma penceresi ile oynayın.
zh_hans: 模运算 ([code]%[/code]) 计算整数除法的余数。 例如，[code]5[/code] 与 [code]3[/code] ([code]5 % 3[/code]) 的模是 [code]2[/code]。 我们通常使用这个操作来判断一个数字是奇数还是偶数，或者产生一个特定范围内的随机数（如掷骰子）。 玩弄右边的模小部件，看看模是如何在视觉上工作的。

source: What's the result of this modulo operation?
cs: Jaký je výsledek této modulo operace?
de: Was ist das Ergebnis dieser Modulo-Operation?
fr: Quel est le résultat de cette opération modulo ?
hu: Mi az eredménye enneka modulo műveletnek?
it: Qual è il risultato di quest'operazione di modulo?
pt_br: Qual é o resultado dessa operação de módulo?
ru: Какой результат выполнения у этой операции?
tr: Bu mod alma işleminin sonucu nedir?
zh_hans: 这个模运算的结果是什么？

source: [code]11[/code] divided by [code]4[/code] is [code]2[/code], and the [b]remainder[/b] of the division is [code]3[/code]. So [code]11 % 4[/code] is [code]3[/code].
cs: [code]11[/code] děleno [code]4[/code] je [code]2[/code], a [b]zbytek[/b] dělení je [code]3[/code]. Takže [code]11 % 4[/code] je [code]3[/code].
de: [code]11[/code] geteilt durch [code]4[/code] ist [code]2[/code], und der [b]Rest[/b] der Division ist [code]3[/code]. [code]11 % 4[/code] ist also [code]3[/code].
fr: [code]11[/code] divisé par [code]4[/code] est [code]2[/code], et le [b]reste[/b] de la division est [code]3[/code]. Donc [code]11 % 4[/code] est [code]3[/code].
hu: [code]11[/code] osztva [code]4[/code]-gyel, az [code]2[/code], az osztás [b]maradéka[/b] pedig [code]3[/code]. Tehát, [code]11 % 4[/code] az [code]3[/code].
it: [code]11[/code] diviso per [code]4[/code] è [code]2[/code] e il [b]resto[/b] della divisione è [code]3[/code]. Quindi [code]11 % 4[/code] è [code]3[/code].
pt_br: [code]11[/code] dividido por [code]4[/code] é [code]2[/code], e o [b]resto[/b] da divisão é [code]3[/code] . Então [code]11% 4[/code] é [code]3[/code].
ru: Деление [code]11[/code] на [code]4[/code] даёт результат [code]2[/code], и [code]3[/code] в [b]остатке[/b]. Соответственно, [code]11 % 4[/code] равно [code]3[/code].
tr: [code]11[/code] 'in içinde [code]4[/code], [code]2[/code] defa var ve bölümden [b]kalan[/b], [code]3[/code] olur. Yani [code]11 % 4[/code], [code] 3[/code]'tür.
zh_hans: [code]11[/code]除以[code]4[/code]为[code]2[/code]，除法的[b]余数[/b]为[code]3[/code] . 所以 [code]11 % 4[/code] 是 [code]3[/code]。

source: The modulo operation only works on [b]whole numbers[/b]; Not decimal numbers. Also, just like in regular divisions, the divisor can't be zero. All three examples below will cause an error in your code.
cs: Operace modulo funguje pouze pro [b]celá čísla[/b]; nikoliv pro desetinná čísla. Stejně jako u běžného dělení ani zde nemůže být dělitel nula. Všechny tři níže uvedené příklady způsobí ve vašem kódu chybu.
de: Die Modulo-Operation funktioniert nur bei [b]ganzen Zahlen[/b]; Keine Dezimalzahlen. Genau wie in regulären Divisionen kann der Teiler auch nicht Null sein. Alle drei folgenden Beispiele verursachen einen Fehler in deinem Code.
fr: L'opération modulo fonctionne seulement sur les [b]nombres entiers[/b] ; pas sur les nombres décimaux. De plus, tout comme dans les divisions ordinaires, le diviseur ne peut pas être zéro. Les trois exemples ci-dessous provoqueront une erreur dans votre code.
hu: A modulo művelet csak [b]egész számokkal[/b] működik; törtekkel nem. Továbbá, ahogy a hagyományos osztásnál, az osztó itt sem lehet 0. Mind a három lenti példa hibát fog eredményezni a kódban.
it: L'operazione modulo funziona solo su [b]numeri interi[/b]; Non numeri decimali. Inoltre, così come per le divisioni normali, il divisore non può essere zero. Tutti e tre gli esempi qui sotto causano un errore nel tuo codice.
pt_br: A operação de módulo só funciona em [b]números inteiros[/b]; Não funciona com números decimais. Além disso, assim como nas contas de divisão, o divisor não pode ser zero. Todos os três exemplos abaixo causarão um erro no seu código.
ru: Операция получения остатка от деления работает только с [b]целыми числами[/b]; Не с десятичными дробями. Также как и при обычном делении, в качестве делителя нельзя использовать ноль. Все три примера, показанные ниже, вызовут ошибку в вашем коде.
tr: Mod alma işlemi yalnızca [b]tam sayılar[/b] üzerinde çalışır; ondalık sayılar üzerinde çalışmaz. Ayrıca, tıpkı normal bölmelerde olduğu gibi, bölen sayı sıfır olamaz. Aşağıdaki üç örnek de kodunda bir hataya neden olacaktır.
zh_hans: 模运算仅适用于[b]整数[/b]；不是十进制数。 此外，就像在常规除法中一样，除数不能为零。 以下所有三个示例都将导致您的代码出错。

source: Three ways we use the modulo operation
cs: Tři způsoby použití operace modulo
de: Drei Möglichkeiten, wie wir die modulo-Operation verwenden
fr: Trois façons d'utiliser l'opération modulo
hu: A modulo három használati módja
it: Tre modi in cui utilizziamo l'operazione modulo
pt_br: Nós usamos a operação de módulo em três ocasiões
ru: Три способа использовать остаток от деления
tr: Mod alma işlemini kullandığımız üç yer
zh_hans: 我们使用模运算的三种方式

source: The modulo operation has important uses in programming, like making a number cycle. Take a traffic light, for example.
cs: Operace modulo má důležité využití v programování, například při vytváření číselného cyklu. Vezměme si například semafor.
de: Die Modulo-Operation hat wichtige Anwendungen in der Programmierung, wie das Erstellen eines Zahlenzyklus. Nehmen wir zum Beispiel eine Ampel.
fr: L'opération modulo a des utilisations importantes dans la programmation, comme pour faire un cycle de nombres. Prenez comme exemple un feu de signalisation.
hu: A modulonak fontos felhasználási területei vannak a programozásban, például egy számkör létrehozása. Vegyünk példának egy közlekedési lámpát.
it: L'operazione modulo ha degli utilizzi importanti in programmazione, come far ciclare un numero. Per esempio, prendi un semaforo.
pt_br: A operação de módulo tem usos importantes na programação, como para fazer um ciclo numérico. Podemos pegar como exemplo um semáforo.
ru: Есть несколько важных способов применения этой операции в программировании, например, создание числового цикла. Для примера возьмём светофор.
tr: Mod alma işleminin programlamada, sayı döngüsü oluşturmak gibi, önemli kullanımları vardır. Örneğin, bir trafik ışığını ele alalım.
zh_hans: 模运算在编程中具有重要用途，例如制作数字循环。 以交通灯为例。

source: We use the number [code]light_index[/code] to represent the traffic light's current state. The lights always cycle in the same way: first, we have the red light, then the yellow, then the green. To represent that cycle, you can periodically add one to the number and use the modulo operator to wrap back to [code]0[/code]. Instead, you could use a condition; In this case, we use the modulo as a shortcut.
cs: Pro vyjádření aktuálního stavu semaforu použijeme číslo [code]light_index[/code]. Semafory se vždy cyklicky střídají: nejprve máme červené světlo, pak žluté a nakonec zelené. Pro znázornění tohoto cyklu můžete k číslu pravidelně přičítat jedničku a pomocí operátoru modulo se vrátit zpět na [code]0[/code]. Můžete použít podmínku; Ale když použijeme modulo, je to kratší a hezčí.
de: Wir verwenden die Variable [code]light_index[/code], um den aktuellen Zustand der Ampel als Zahl darzustellen. Die Lichter durchlaufen immer die gleiche Reihenfolge: Zuerst haben wir das rote Licht, dann das gelbe, dann das grüne. Um diesen Zyklus darzustellen, können Sie der Zahl regelmäßig um 1 erhöhen und den Modulo-Operator verwenden, um wieder bei [code]0[/code] anzufangen. Du könntest stattdessen eine Bedingung verwenden. In diesem Fall verwenden wir aber Modulo um den Code zu verkürzen.
fr: Nous utilisons le nombre [code]light_index[/code] pour représenter l'état actuel du feu de signalisation. Les lumières s'allument toujours de la même manière : nous avons d'abord le feu rouge, puis le jaune, puis le vert. Pour représenter ce cycle, vous pouvez périodiquement ajouter un au nombre et utiliser l'opérateur modulo pour revenir à [code]0[/code]. Au lieu de cela, vous pourriez utiliser une condition ; dans ce cas-ci, nous utilisons le modulo comme raccourci.
hu: A [code]light_index[/code] nevű szám mutatja a lámpa a jelenlegi helyzetét. A fények mindig ugyanabban a sorrendben kapcsolnak be: először a piros, majd a sárga, végül a zöld. Ennek a körnek a reprezentálásához, hozzáadhatsz mindig egyet egy számhoz, majd használhatod a modulo operátort, hogy visszajuss [code]0[/code]-ra. Ehelyett, használhatunk egy feltételt; ebben az esetben a modulot rövidítésként használhatjuk.
it: Usiamo il numero [code]light_index[/code] per rappresentare lo stato corrente del semaforo. Le luci ciclano sempre nello stesso modo: prima, abbiamo la luce rossa, poi la giallo e infine la verde. Per rappresentare questo ciclo, puoi incrementare periodicamente di uno il numero e usare l'operatore modulo per ritornare a [code]0[/code]. Piuttosto, potresti usare una condizione; In questo caso, possiamo usare il modulo come scorciatoia.
pt_br: Usamos o número [code]light_index[/code] para representar o estado atual do semáforo. As luzes sempre circulam da mesma maneira: primeiro, temos a luz vermelha, depois a amarela, depois a verde. Para representar esse ciclo, você pode adicionar periodicamente um ao número e usar o operador de módulo para voltar para [code]0[/code]. Você também pode usar uma condição; Nesse caso, usamos o módulo como atalho.
ru: Мы используем число [code]light_index[/code] для представления текущего состояния светофора. Цвета всегда сменяют друг-друга в одном порядке: красный, жёлтый, зелёный. Для представления этого цикла вы можете периодически добавлять единицу к числу и использовать оператор получения остатка от деления, чтобы вернуться к [code]0[/code]. Вместо этого вы можете использовать условие; В этом случае остаток от деления можно использовать для сокращения.
tr: Trafik ışığının mevcut durumunu temsil etmek için [code]light_index[/code] (ışık_dizini) sayısını kullanırız. Işıklar hep aynı şekilde yanar: önce kırmızı yanar, sonra sarı, ve sonra yeşil. Bu döngüyü temsil etmesi için, düzenli olarak sayıya bir ekleyebilir, ve mod alma işlemini kullanarak tekrar [code]0[/code]yapabilirsin. Bunun yerine, bir koşulda kullanabilirdin; Bu durumda, mod almayı bir kısayol olarak kullanırız.
zh_hans: 我们使用数字 [code]light_index[/code] 来表示红绿灯的当前状态。 灯总是以相同的方式循环：首先，我们有红灯，然后是黄色，然后是绿色。 为了表示该循环，您可以定期将数字加一并使用模运算符返回到 [code]0[/code]。 相反，您可以使用条件；在这种情况下，我们使用模数作为捷径。

source: Why do we start from zero?
de: Warum fangen wir bei Null an?
fr: Pourquoi commençons-nous à zéro ?
it: Perché partiamo da zero?
pt_br: Por que começamos com zero?
ru: Почему мы начинаем с нуля?
tr: Neden sıfır ile başlıyoruz?
zh_hans: 为什么要从零开始？

source: In computer code, we very often count from [code]0[/code]. Every number translates to a precise combination of bits in the machine, starting from [code]0[/code]. We don't want to waste any number, and as the first number the computer knows about is [code]0[/code], we start counting from [code]0[/code].
cs: V počítačovém kódu velmi často počítáme od [code]0[/code]. Každé číslo se ve stroji převede na přesnou kombinaci bitů, počínaje [code]0[/code]. Nechceme plýtvat žádným číslem, a protože první číslo, které počítač zná, je [code]0[/code], začínáme počítat od [code]0[/code].
de: Im Computercode starten wir mit dem Zählen sehr oft bei [code]0[/code]. Jede Zahl wird in eine präzise Kombination von Bits in der Maschine übersetzt, beginnend mit [code]0[/code]. Wir wollen keine Zahl verschwenden, und da die erste Zahl, die der Computer kennt, [code]0[/code] ist, beginnen wir mit dem Zählen von [code]0[/code].
fr: En code informatique, on compte très souvent à partir de [code]0[/code]. Chaque nombre se traduit par une combinaison précise de bits dans la machine, partant de [code]0[/code]. Nous ne voulons gaspiller aucun nombre, et comme le premier nombre connu par l'ordinateur est [code]0[/code], nous commençons à compter à partir de [code]0[/code].
hu: A számítógépes kódban, gyakran kezdjük [code]0[/code]-tól a számolást. Minden szám a bitek egy speciális kombinációja, kezdve a [code]0[/code]-tól. Egy számot sem akarunk elvesztegetni, és mivel az első szám, amit a számítógép ismer a [code]0[/code], ezért [code]0[/code]-tól kezdjük a számolást.
it: In programmazione, spesso contiamo da [code]0[/code]. Ogni numero si traduce in una precisa combinazione di bit, che iniziano da [code]0[/code]. Non vogliamo sprecare nessun numero e il primo numero che il computer conosce è [code]0[/code], quindi iniziamo a contare da [code]0[/code].
pt_br: Em programação, muitas vezes iniciamos a contagem dos números a partir do número [code]0[/code] e não do número 1. Cada número se traduz em uma combinação precisa de bits dentro da máquina, começando do [code]0[/code]. Não queremos desperdiçar nenhum número, e como o primeiro número que o computador conhece é o [code]0[/code], então começamos a contar a partir de [code]0[/code].
ru: В компьютерном коде мы очень часто начинаем отсчёт с [code]0[/code]. Каждое число, начиная с [code]0[/code], преобразуется в точную комбинацию бит в машине. Мы не хотим тратить числа зря, поэтому мы начинаем считать с [code]0[/code], поскольку [code]0[/code] — это первое число, известное компьютеру.
tr: Bilgisayar kodunda, sayı saymaya genellikle [code]0[/code]'dan başlarız. Başta [code]0[/code] olmak üzere her sayı, makine içindeki bitlerin (0 ve 1 sinyalleri) çok belirli bir birleşimine karşılık gelir. Hiçbir sayıyı boşa harcamak istemiyoruz, ve bilgisayarın bildiği ilk sayı [code]0[/code] olduğu için saymaya [code]0[/code]'dan başlıyoruz.
zh_hans: 在计算机代码中，我们经常从 [code]0[/code] 开始计数。 每个数字都转换为机器中位的精确组合，从 [code]0[/code] 开始。 我们不想浪费任何数字，因为计算机知道的第一个数字是 [code]0[/code]，我们从 [code]0[/code] 开始计数。

source: Using modulo to find even and odd numbers
cs: Použití modulo k nalezení sudých a lichých čísel
de: Verwenden von Modulo zum Finden gerader und ungerader Zahlen
fr: Utilisation du modulo pour trouver des nombres pairs et impairs
hu: Páros és páratlan számok keresése, a modulo segítségével
it: Usando il modulo per capire se un numero è pari o dispari
pt_br: Usando o módulo para encontrar números pares e ímpares
ru: Использование остатка от деления для поиска чётных и нечётных чисел
tr: Çift ve tek sayıları bulmak için mod almayı kullanmak
zh_hans: 使用模查找偶数和奇数

source: We can also use a modulo to check if a number is even or odd. If we divide a number by [code]2[/code] and there's no remainder, then the number is [b]even[/b].
cs: Můžeme také použít modulo ke kontrole, zda je číslo sudé nebo liché. Pokud vydělíme číslo [code]2[/code] a nezůstane žádný zbytek, pak číslo je [b]sudé[/b].
de: Wir können auch ein Modulo verwenden, um zu überprüfen, ob eine Zahl gerade oder ungerade ist. Wenn wir eine Zahl durch [code]2[/code] teilen und es keinen Rest gibt, dann ist die Zahl [b]gerade[/b].
fr: Nous pouvons également utiliser un modulo pour vérifier si un nombre est pair ou impair. Si nous divisons un nombre par [code]2[/code] et qu'il n'y a pas de reste, alors le nombre est [b]pair[/b].
hu: Arra is használhatjuk a moduilot, hogy kiderítsük, egy szám páros vagy páratlan. Ha elosztunk egy számot [code]2[/code]-vel, és nem marad semmi, akkor a szám [b]páros[/b].
it: Possiamo pure usare il modulo per controllare se un numero è pari o dispari. Se dividiamo un numero per [code]2[/code] e non c'è alcun resto, allora il numero è [b]pari[/b].
pt_br: Também podemos usar a operação de módulo para verificar se um número é par ou ímpar. Se dividirmos um número por [code]2[/code] e não houver resto da divisão, ou seja, se o resto da divisão for zero, o número será [b]par[/b].
ru: Также мы можем использовать остаток от деления для проверки чётности чисел. Если при делении числа на [code]2[/code] остатка нет — то число [b]чётное[/b].
tr: Mod alma işlemini, bir sayının çift ya da tek olduğunu kontrol etmek için de kullanabiliriz. Bir sayıyı [code]2[/code] ile bölersek ve kalan olmazsa (sıfır kalısa), sayı [b]çift[/b] olur.
zh_hans: 我们还可以使用模来检查数字是偶数还是奇数。如果我们将一个数除以 [code]2[/code] 并且没有余数，则该数是 [b]偶数[/b]。

source: Notice how the modulo can be larger than the number it affects. For example, [code]1 % 2[/code] gives you [code]1[/code]. That's because [code]1[/code] divided by [code]2[/code] equals [code]0[/code], and the remainder is [code]1[/code]. Like with divisions, the only case you can't use modulo is with a divisor of [code]0[/code].
cs: Všimněte si, že modulo může být větší než číslo, které se dělí(dělenec). Například [code]1 % 2[/code] dává [code]1[/code]. To proto, že [code]1[/code] děleno [code]2[/code] je rovno [code]0[/code] a zbytek je [code]1[/code]. Stejně jako u dělení, jediný případ, kdy nelze použít modulo, je dělitel [code]0[/code].
de: Beachte, dass das Modulo größer sein kann als die Zahl, die es beeinflusst. Beispiel: [code]1 % 2[/code] ergibt [code]1[/code]. Das liegt daran, dass [code]1[/code] geteilt durch [code]2[/code] gleich [code]0[/code] ist und der Rest [code]1[/code] ist. Wie bei Divisionen ist der einzige Fall, in dem Du Modulo nicht verwenden kannst, mit einem Teiler von [code]0[/code].
fr: Remarquez comment le modulo peut être supérieur au nombre qu'il affecte. Par exemple, [code]1 % 2[/code] donne [code]1[/code]. C'est parce que [code]1[/code] divisé par [code]2[/code] est égal à [code]0[/code], et le reste est [code]1[/code]. Comme pour les divisions, le seul cas où vous ne pouvez pas utiliser le modulo est avec un diviseur de [code]0[/code].
hu: Figyeld meg, hogy a modulo lehet nagyobb, mint a szám, amire alkamazva van. Például, az [code]1 % 2[/code] eredménye [code]1[/code]. Ez azért van, mert [code]1[/code] osztva [code]2[/code]-vel az [code]0[/code], a maradék pedig [code]1[/code]. Ahogy osztásnál, úgy itt is az egyetlen olyan eset, ahol nem használhatod a modulot, ha [code]0[/code] az osztó.
it: Nota bene che il modulo può essere più grande del numero di partenza. Per esempio, [code]1 % 2[/code] dà come risultato [code]1[/code]. Questo è perchè [code]1[/code] diviso [code]2[/code] è uguale a [code]0[/code] e il resto è [code]1[/code]. Come per le divisioni, l'unico caso in cui non puoi usare il modulo è con un divisore di [code]0[/code].
pt_br: Observe como o módulo pode ser maior do que o número que ele afeta. Por exemplo, [code]1 % 2[/code] te dá [code]1[/code]. Isso porque [code]1[/code] dividido por [code]2[/code] é igual a [code]0[/code], e o resto da divisão é [code]1[/code]. Assim como nas operações de divisão, o único caso em que você não pode usar o módulo é com um divisor de [code]0[/code].
ru: Обратите внимание, что делитель при определении остатка от деления может быть больше, чем делимое. Например, [code]1 % 2[/code] даёт вам [code]1[/code]. Всё потому что деление [code]1[/code] на [code]2[/code] даёт нам [code]0[/code] в результате и [code]1[/code] в остатке. Как и при обычном делении, единственное число, которое вы не можете использовать в качестве делителя — это [code]0[/code].
tr: Mod alma sayısının, uygulandığı sayıdan daha büyük olabileceğine dikkat et. Örneğin, [code]1 % 2[/code] işlemi sana [code]1[/code] verir. Bunun nedeni [code]1[/code]'in içinde [code]2[/code] yoktur, yani bölüm [code]0[/code] ve kalan [code]1[/code] olur. Bölme işlemlerinde olduğu gibi, mod almayı kullanamayacağın tek durum, [code]0[/code] ile bölmedir.
zh_hans: 注意模数如何大于它影响的数字。例如，[code]1 % 2[/code] 为您提供 [code]1[/code]。这是因为 [code]1[/code] 除以 [code]2[/code] 等于 [code]0[/code]，余数为 [code]1[/code]。 与除法一样，唯一不能使用模数的情况是除数为 [code]0[/code]。
