Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-3-standing-on-shoulders-of-giants.po
Languages: hu, pl, pt, sk, sv, tr, zh_hans

source: The robot was turned by [code]-0.5[/code] radians. You need to make it upright by calling the [code]rotate()[/code] function.
hu: A robot el lett forgatva [code]-0.5[/code] radiánnal. Fel kell állítanod a [code]rotate()[/code] függvény segítségével.

source: Please call [code]rotate()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
hu: Kérlek hívd a [code]rotate()[/code] függvényt a [code]run()[/code] függvényen belül, a [code]2.[/code] sorban, és hagyd meg a [code]Tab[/code] karaktert a sor elején. A számítógépnek szüksége van rá, hogy megértse a kódod.

source: The robot is turned sideways. Help it straighten up with a function call.
hu: A robot oldalra fordult. Segíts neki felállni egy függvényhívással.
pl: Robot jest obrócony na bok. Pomóż mu się wyprostować wywołując odpowiednią funkcję.
pt: O robô está virado de lado. Ajude ele a se endireitar com uma chamada de função.
sv: Roboten är sned. Hjälp den att räta upp sig med ett funktionsanrop.
tr: Robot yan döndü. Onu doğrultmak için bir fonksiyon çağrısı kullanın.
zh_hans: 这个机器人歪了。 通过函数调用帮助它站直。

source: We Stand on the Shoulders of Giants
hu: Óriások vállán állunk
pl: Stojąc na barkach gigantów
pt: Sobre os Ombros de Gigantes
tr: Devlerin Omuzlarında Yükseliyoruz
zh_hans: 我们站在巨人的肩膀上

source: We use parentheses to call functions because you can give the function [i]arguments[/i] inside the parentheses when calling it.
sk: Keď voláme funkcie používame zátvorky, pretože do nich je možné vložiť [i]argumenty[/i] volanej funkcie.

source: It calls the function named "show".
sk: Volá funkciu s názvom "show".
tr: "show" isimli fonksiyonu çağırır.
zh_hans: 它调用名为“show”的函数。

source: As programmers, we rely on a lot of code created by others before us. Every programming language comes with a wealth of features created by other programmers to save you time. We call a bundle of code created by fellow developers a [i]library[/i]. It's a bunch of code sitting there, waiting for you to use it. Game engines like Godot bundle many libraries together. They provide a massive toolset to save you time when making games.
pt: Como programador, contamos muito com código feito por outros programadores que o criaram antes de nós. Toda linguagem de programação vem com uma grande variedade de recursos criados por outros programadores que servem para ajudar a economizar o seu tempo. Chamamos esse código criado por outros programadores de [i]biblioteca[/i]. É um monte de código que está lá guardados, à espera que o use. Motores de jogos (as engines) como a Godot juntam muitas bibliotecas. Elas fornecem-lhe um conjunto enorme de ferramentas que o ajudam a economizar tempo quando for criar os seus jogos.
sv: Som programmerare förlitar vi oss mycket på kod skapad av andra före oss. Varje programmeringsspråk kommer med en mängd funktioner skapade av andra programmerare för att spara dig tid. Vi kallar ett kodpaket skapat av andra utvecklare för ett [i]bibliotek[/i]. Det är en massa kod som bara sitter där och väntar på att du ska använda den. Spelmotorer som Godot innehåller många bibliotek. De ger dig en enorm verktygslåda för att spara dig tid när du gör spel.
tr: Programcılar olarak, bizden önce gelen başkalarının yazdığı bir sürü koda bağlı durumdayız. Her programlama dili, size zaman kazandırmak amacıyla, diğer programcılar tarafından yazılmış bol miktarda özellik ile gelir. Bu tarz, meslektaş geliştiriciler tarafından yazılmış, kod paketlerini [i]kütüphane[/i] olarak isimlendiriyoruz. Bunlar, oturup sizin onları kullanmanızı bekleyen kod yığınlarıdır. Godot gibi oyun motorları birçok kütüphane ile birlikte gelir. Size, oyun yaparken zaman kazandırmak amacıyla devasa bir alet takımı sunar.
zh_hans: 作为程序员，我们依赖于前人创建的大量代码。 每种编程语言都有其他程序员已经做好了的丰富的功能，可以节省你的时间。 我们将由其他开发人员创建的代码包称为[i]库[/i]。 它是一堆现成的代码，等待你使用。 像 Godot 这样的游戏引擎将许多库捆绑在一起。它们提供了一个庞大的工具集，可以在制作游戏时节省你的时间。

source: When coding, you always use a lot of code from developers who came before you. In a moment, you'll write your first code. You'll use [i]functions[/i] created by the Godot developers. A function is a list of instructions with an exact name. We can tell the computer to execute all the instructions in sequence with that name.
pt: Quando programa, sempre usa um monte de código de programadores que o criaram antes de nós. Daqui a pouco, vai escrever o seu primeiro código. Vai usar [i]funções[/i] criadas pelos programadores da Godot. Uma função é uma lista de instruções com um nome exato. Podemos falar com o computador para executar todas as instruções em sequencia com aquele nome.
sv: När du kodar använder du alltid mycket kod från utvecklare som kom före dig. Om ett ögonblick kommer du att skriva din första kod. Du kommer att använda [i]funktioner[/i] skapade av Godot-utvecklarna. En funktion är en lista med instruktioner med ett exakt namn. Med det namnet kan vi instruera datorn att utföra alla instruktioner i listan i tur och ordning.
tr: Kodlama yaparken, her zaman, sizden önce gelen geliştiricilerden kalma çok fazla kod kullanacaksınız. Kısa sürede, ilk kodunuzu yazmış olacaksınız. Godot geliştiricileri tarafından yazılmış [i]fonksiyonlar[/i] kullanacaksınız. Bir fonksiyon, belirli bir isim altında toplanmış talimatlar listesidir. Bilgisayara, bu isme sahip tüm talimatları sırayla çalıştırmasını söyleyebiliriz.
zh_hans: 在编码时，你总会用上很多来自你之前的开发人员的代码。 稍后，你将编写你的第一个代码。 会用到 Godot 开发人员创建的[i]函数[/i]。 函数是具有确切名称的一系列指令。 使用该名称会命令计算机按顺序执行一系列的指令。

source: When you tell the computer to execute a function, we say you [i]call[/i] the function. To call a function, you write its [i]exact[/i] name followed by an open and closed parenthesis. To call the function named "show", you would write [code]show()[/code].
pt: Quando fala com o computador para ele executar uma função, dizemos que [i]chama[/i] a função. Para chamar uma função, escrevo o nome [i]exato[/i] dela seguido por uma abertura e um fechamento de parêntese. Para chamar uma função chamada "show", deve escrever [code]show()[/code].
sv: När du säger åt datorn att köra en funktion säger vi att du [i]anropar[/i] funktionen. För att anropa en funktion skriver du funktionens [i]exakta[/i] namn följt av en öppen och stängd parentes. För att anropa funktionen som heter "show", skulle du skriva [code]show()[/code].
tr: Bilgisayara bir fonksiyonu çalıştırmasını söylediğinizde, fonksiyonu [i]çağırdınız[/i] diyebiliriz. Bir fonksiyonu çağırmak için, onun [i]tam[/i] ismini ve ardından açık ve kapalı parantezleri yazarsınız. "show" (göster) isimli fonksiyonu çağırmak için, [code]show()[/code] yazmanız gerekir.
zh_hans: 当你告诉计算机执行一个函数时，我们说你[i]调用[/i]这个函数。 要调用一个函数，你可以写下它的[i]确切的[/i]名称，后跟一个左括号和右括号。 要调用名为“show”的函数，你可以编写 [code]show()[/code]。

source: In Godot, calling [code]show()[/code] makes something visible, like a character or item. The complementary [code]hide()[/code] function hides the entity. Once an entity is visible, calling [code]show()[/code] again doesn't have any effect. Similarly, once you hide something, calling [code]hide()[/code] again doesn't change anything. [i]Click the Run button on any example below to execute the code listing.[/i]
pl: W Godocie wywołanie [code]show()[/code] sprawia, że coś jest widoczne (może być to na przykład nasza postać bądź przedmiot). Uzupełniająca ją funkcja [code]hide()[/code] sprawi, że ta sama rzecz zostanie ukryta. Gdy już raz uczynimy dany element widocznym, ponowne wywołanie [code]show()[/code] nie da żadnego efektu. Tak samo jest w przypadku, gdy coś zostanie ukryte. Ponowne wywołanie [code]hide()[/code] niczego nie zmieni. [i]Kliknij przycisk Uruchom na dowolnym przykładzie poniżej, aby uruchomić znajdujący się tam kod.[/i]
pt: Na Godot, chamar [code]show()[/code] faz com que algo fique visível, como uma personagem ou um item. Já a função [code]hide()[/code] esconde a entidade. Uma vez que a entidade está visível, chamar novamente [code]show()[/code] não tem mais efeito nenhum. Da mesma forma, uma vez que escondeu algo, chamar [code]hide()[/code] novamente não muda nada. [i]Clique no botão Executar em qualquer exemplo abaixo para executar o código listado.[/i]
sv: Om du anropar [code]show()[/code] i Godot blir något synligt, som ett tecken eller objekt. Den kompletterande funktionen [code]hide()[/code] döljer enheten. När en entitet väl är synlig har det ingen effekt att anropa [code]show()[/code] igen. På samma sätt, när du väl döljer något, ändrar inte något att anropa [code]hide()[/code] igen. [i]Klicka på knappen Kör i valfritt exempel nedan för att köra kodlistan.[/i]
tr: Godot'da [code]show()[/code] çağırmak bir şeyi görünür yapar; mesela bir karakter ya da öğe. Karşılık gelen [code]hide()[/code] ise bir varlığı gizler. Bir varlık bir kez görünür olduğunda, tekrar [code]show()[/code] kullanmanızın bir etkisi olmaz. Aynı şekilde, bir şeyi gizlediğinizde, tekrar [code]hide()[/code] kullanmak bir şeyi değiştirmez. [i]Aşağıdaki örneklerden herhangi birinde kod listesini işlemek için çalıştır, veya "run()", tuşuna basın.[/i] (Sıfırlamak için "Reset")
zh_hans: 在 Godot 中，调用 [code]show()[/code] 可以使某些东西可见，例如字符或物体。与之相反的 [code]hide()[/code] 函数可以隐藏实体。 一旦实体可见，再次调用 [code]show()[/code] 不会有任何效果。 同样，一旦你隐藏了某些东西，再次调用 [code]hide()[/code] 并不会起到任何变化。 [i]单击下面任何示例上的“运行”按钮以执行代码清单。[/i]

source: In GDScript, unlike in some other languages, we must write our code inside of custom functions. You'll learn what functions are and how they work in great detail in the course, but here's a quick look at them if you're curious. A function is a bundle of code you can execute anytime. It's a named list of instructions. To define a function, you need to write the [code]func[/code] keyword, the function's name, parentheses, and a colon: [code]func run():[/code] defines a function named [code]run()[/code]. You then go to the next line to write the function's body. That's the instructions of the function. Notice how each instruction starts with a leading [code]Tab[/code] character. The computer uses that to know which lines are part of the function. Throughout the course, you'll see many functions called [code]run()[/code]. Those are functions we created to give you interactive examples.
pl: W GDScript, w przeciwieństwie do niektórych innych języków, musimy pisać nasz kod wewnątrz funkcji niestandardowych. W trakcie kursu szczegółowo dowiesz się, czym są funkcje i jak one działają, ale jeśli jesteś ciekawy, tutaj znajdziesz pokrótkie wytłumaczenie. Funkcja to pakiet kodu, który możesz wykonać w dowolnym momencie. To nazwana lista instrukcji. Aby zdefiniować funkcję, musisz napisać słowo kluczowe [code]func[/code], nazwę funkcji, nawiasy i dwukropek: stąd [code]func run():[/code] definiuje funkcję o nazwie [code]run()[/code]. Następnie musisz przejść do następnej linii i w niej napisać treść funkcji. Wszystkie napisane tam przez ciebie linie staną się instrukcjami funkcji. Zwróć uwagę, że każda instrukcja zaczyna się od wiodącego znaku [code]TAB[/code]. Komputer używa przesunięć, aby wiedzieć, które linie są częścią danej funkcji. W trakcie kursu zobaczysz wiele funkcji o nazwie [code]run()[/code]. Funkcje te są stworzone przez nas i mają na celu ukazanie ci interaktywnych przykładów.
pt: No GDScript, diferente de outras linguagens, precisamos escrever o nosso código numa função personalizada. Vai aprender o que são funções e como elas funcionam em detalhes no curso, mas aqui está um breve exemplo caso esteja curioso. Uma função é um conjunto de código que pode executar a qualquer momento. É uma lista de instruções que contém um nome. Para definir uma função, precisa escrever a palavra-chave [code]func[/code], seguido pelo nome da função, o parêntese e o sinal de dois pontos: [code]func run():[/code] define uma função chamada [code]run()[/code]. Então vai à próxima linha para escrever o corpo da função. O corpo é onde fica as instruções da função. Repare como cada instrução começa com um [code]caractere de tabulação (espaço em branco na esquerda)[/code]. O computador usa isso para saber qual linha faz parte da função. Ao longo do curso, vai ver várias funções chamadas [code]run()[/code]. Essas funções foram criadas por nós para dar-lhe exemplos interativos.
sv: I GDScript, till skillnad från i vissa andra språk, måste vi skriva vår kod inuti anpassade funktioner. Du kommer att lära dig vad funktioner är och hur de fungerar i detalj i kursen, men här är en snabb titt på dem om du är nyfiken. En funktion är en kodsnutt som du kan köra när som helst. Det är en namngiven lista med instruktioner. För att definiera en funktion måste du skriva kommandot [code]func[/code], funktionens namn, parenteser och ett kolon: [code]func run():[/code] definierar en funktion som heter [code]run ()[/code]. Du går sedan till nästa rad för att skriva funktionens kropp. Det är instruktionerna för funktionen. Lägg märke till hur varje instruktion börjar med ett inledande [code]Tab[/code]-tecken. Datorn använder det för att veta vilka linjer som ingår i funktionen. Under hela kursen kommer du att se många funktioner som kallas [code]run()[/code]. Det är funktioner vi skapat för att ge dig interaktiva exempel.
tr: GDScript'te, diğer bazı dillerden farklı olarak, kodlarımızı özel fonksiyonların içine yazmamız gerekir. Fonksiyonların ne olduklarını ve nasıl çalıştıklarını, kurs boyunca detaylı olarak öğreneceksiniz, ama şimdilik merakınızı gidermek için hızlıca bir göz atalım. Bir fonksiyon, herhangi bir zamanda çalıştırabileceğiniz kod yığınlarıdır. Talimat listelerinin isim verilmiş halidir. Bir fonksiyonu tanımlamak için, önce [code]func[/code] kelimesi, fonksiyonun ismi, parantezler, ve iki nokta üstüste yazmanız gerekir: [code]func run():[/code] kod parçası [code]run()[/code] isminde bir fonksiyonu tanımlar. Daha sonra, fonksiyonun gövdesini yazmak için sonraki satıra geçersiniz. Bu da fonksiyonun talimatlarıdır. Dikkatle bakarsanız her talimatın başında bir [code]Sekme[/code] (içe doğru girinti) karakteri görürsünüz. Bilgisayar bunu, hangi satırların fonksiyona ait olduğunu anlamak için kullanır. Kurs boyunca, [code]run()[/code] çağrısı yapan pek çok fonksiyon göreceksiniz. Bunlar, size etkileşimli örnekler sunmak için oluşturduğumuz fonksiyonlardır.
zh_hans: 在 GDScript 中，与其他一些语言不同，我们必须在自定义函数中编写代码。 你将在课程中详细了解函数是什么以及它们如何工作，但如果你好奇，可以快速浏览一下它们。 函数是你可以随时执行的代码包。 这是一个命名的指令列表。 要定义一个函数，你需要编写 [code]func[/code] 关键字、函数名称、括号和冒号： [code]func run():[/code] 定义了一个名为 [code]run()[/code] 的函数。 然后转到下一行来编写函数体，就是该函数中所包含的指令。 请注意每条指令如何以前导[code]制表符[/code]开头。 计算机使用它来知道哪些行是函数的一部分。 在整个课程中，你将看到许多称为 [code]run()[/code] 的函数。 这些是我们为给你提供交互式示例而创建的函数。

source: We use parentheses to call functions because you can give the function [i]arguments[/i] inside the parentheses when calling it. Here's a [i]sprite[/i] standing straight. If we call the [code]rotate(0.3)[/code] function, the character [i]sprite[/i] turns by 0.3 units.
pt: Usamos parênteses para chamar funções porque pode dar à função [i]argumentos[/i] dentro desses parêntesis quando a chamamos. Aqui temos uma [i]sprite[/i] que está reta. Se chamarmos a função [code]rotate(0.3)[/code], a [i]sprite[/i] da personagem vai girar 0.3 unidades.

source: The [code]0.3[/code] part between the parentheses is the function's [i]argument[/i]. Arguments are values (numbers, bits of text, and more) that change how the function behaves. Arguments let you fine-tune the effect of the function call. They can be optional at times, but functions often require arguments in order to work. For example, calling [code]rotate()[/code] without any argument would result in an error. Without an argument, Godot doesn't know by [i]how much[/i] you intend to rotate the [i]sprite[/i]. Don't worry about memorizing what arguments each function requires or accepts! As a programmer, the documentation will always be close by for you to refer to. Finally, notice how we use a dot in the number [code]0.3[/code] above: you need to use a dot like this to represent decimal numbers. You can't use commas as they have a different purpose in code.
pl: Część [code]0.3[/code] między nawiasami jest [i]argumentem[/i] funkcji. Argumenty to wartości (liczby, części tekstu i inne), które zmieniają zachowanie funkcji. Argumenty pozwalają precyzyjnie dostroić efekt wywołania funkcji. Czasami mogą być opcjonalne, jednak niektóre z funkcji wymagają argumentów do działania. Na przykład wywołanie funkcji [code]rotate()[/code] (obróć) bez żadnego argumentu spowoduje błąd. Bez argumentu Godot nie wie, [i]jak bardzo[/i] zamierzasz obrócić swój [i]sprite[/i]. Nie martw się, nie musisz zapamiętywać jakich argumentów każda funkcja wymaga lub jakie z nich akceptuje! Jako programista, dokumentację będziesz miał zawsze pod ręką, aby móc się do niej odwołać. Na koniec zwróć uwagę, w jaki sposób została używa kropka w numerze [code]0.3[/code] powyżej: do reprezentowania liczb dziesiętnych musisz używać właśnie kropki. Nie możesz używać przecinków, ponieważ mają one inne przeznaczenie w kodzie.
pt: A parte [code]0.3[/code] entre o parêntese é o [i]argumento[/i] da função. Argumento são valores (números, a parte de um texto entre outras coisas) que mudam o comportamento da função. Argumentos permitem que ajuste o efeito da chamada da função. Eles às vezes podem ser opcionais. mas geralmente as funções vão exigir argumentos para poder funcionar. Por exemplo, chamando a função [code]rotate()[/code] sem nenhum argumento pode resultar num erro. Sem um argumento, a Godot não sabe [i]por quanto[/i] pretende rotacionar a [i]sprite[/i]. Não se preocupe em memorizar quais argumentos cada função exige ou aceita! Como programador(a), a documentação sempre estará por perto para se poder referenciar. Finalmente, repare que usamos um sinal de ponto no número [code]0.3[/code] acima: precisa usar o ponto para representar números decimais. Não pode usar vírgulas porque elas tem um propósito diferente em código.
sv: [code]0.3[/code] delen mellan parenteserna är funktionens [i]argument[/i]. Argument är värden (siffror, textsnuttar och annat) som ändrar hur funktionen beter sig. Argument låter dig finjustera effekten av funktionsanropet. De kan vara valfria ibland, men funktioner kräver ofta argument för att fungera. Om du till exempel anropar [code]rotate()[/code] utan något argument skulle det resultera i ett fel. Utan argument vet inte Godot med [i]hur mycket[/i] du tänker rotera [i]sprite[/i]. Oroa dig inte för att memorera vilka argument varje funktion kräver eller accepterar! Som programmerare finns dokumentationen alltid nära till hands för att påminna dig. Lägg till sist märke till hur vi använder en punkt i talet [code]0.3[/code] ovan: du måste använda en punkt i decimaltal. Du kan inte använda kommatecken eftersom de används till annat i koden.
tr: Parantez içindeki [code]0.3[/code] kısmı fonksiyonun [i]girdi değişkeni[/i]dir. Girdi değişkenleri, fonksiyonun nasıl çalışacağını değiştiren değerlerdir (sayılar, bir parça yazı, ya da daha fazlası). Girdi değişkenleri, fonksiyon çağırmanın yapacağı etkiyi ince ayarlamanıza yardımcı olur. Arada isteğe bağlı olurlar, ama genellikle fonksiyonların çalışması için gereklidirler. Örneğin, [code]rotate()[/code] çağrısını değişken girdisi olmadan yapmak hata ile sonuçlanır. Girdi değişkeni olmadan Godot, [i]grafik öğe[/i]nin [i]ne kadar[/i] dönmesini amaçladığınızı bilemez. Her fonksiyona neyin gerektiği ya da neyi kabul ettiğini hafızanızda tutmaya çalışmayın. Bir programcı olarak, ihtiyaç duyunca bakacağınız belgelendirmeler her zaman size yakın bir yerde olacaktır. Son olarak, yukarıdaki [code]0.3[/code] sayısında nokta kullandığımıza dikkat edin: ondalık sayıları belirtmek için bu şekilde nokta kullanıyoruz. Ondalık sayılar için virgül kullanmıyoruz çünkü kod içinde onun çok daha farklı amaçları var.
zh_hans: 括号之间的 [code]0.3[/code] 部分是函数的[i]参数[/i]。 参数是改变函数行为方式的值（数字、文本位等）。 参数可让你微调函数调用的效果。 它们有时是可选的，但函数通常需要参数才能工作。 例如，不带任何参数调用 [code]rotate()[/code] 会导致错误。 如果没有参数，Godot 不知道你打算把[i]精灵[/i]旋转[i]多少度[/i]。 不要担心记住每个函数需要或接受的参数！作为程序员，文档将始终在你身边供你参考。 最后，请注意我们如何在上面的数字 [code]0.3[/code] 中使用点：你需要使用这样的点来表示小数。 你不能使用逗号，因为它们在代码中有不同的用途。
