Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-6-multiple-function-parameters.po
Languages: da, hu, pl, sk, sv, tr, uk, zh_hans

source: You can give parameters any name. How you name functions and parameters is up to you.
hu: A paramétereket bárhogy elnevezheted. Csak rajtad áll, hogy nevezed el a függvényeid és paramétereid.
sk: Parametrom môžete dať ľubovoľný názov. Je na vás, ako pomenujete funkcie a parametre.

source: Just remember that names cannot contain spaces. To write parameter names with multiple words, you need to use underscores.
hu: Ne felejtsd el , hogy a nevek nem tartlmazhatnak szóközt. Több szóból álló paraméterekhez használj aláhúzásjelet..
sk: Len nezabudnite, že názvy nesmú obsahovať medzery. Ak chcete napísať názvy parametrov s viacerými slovami, musíte použiť podčiarkovníky.

source: Parameters make your code easier to reuse.
hu: A paraméterek egyszerűbbé teszik, hogy újrafelhasználd a kódod.
sk: Parametre uľahčujú opakované použitie vášho kódu.

source: Here's an example with a function to draw any square. Use the slider to change the value passed to the function and draw squares of different sizes.
hu: Itt egy példa függvény, amivel bármekkora négyzet rajzolható. használd a csúszkát, hogy megváltoztasd a függvénynek átadott értéket, és rajzolj különböző méretű négyzeteket.
sk: Tu je príklad s funkciou na vykreslenie ľubovoľného štvorca. Pomocou posuvníka môžete meniť hodnotu odovzdanú funkcii a kresliť štvorce rôznych veľkostí.

source: You can use multiple parameters in a function. In fact, you can use as many as you [i]need[/i].
hu: Több paramétert is használhatsz egy függvényben. Valójában, annyit használhatsz, amennyire csak [i]szükséged[/i] van.
sk: Vo funkcii môžete použiť viacero parametrov. V skutočnosti ich môžete použiť toľko, koľko [i]potrebujete[/i].

source: To separate the function parameters, you need to write a comma between them.
hu: A függvény paramétereinek különválasztásához vesszőt kell használnod.
sk: Ak chcete parametre funkcie oddeliť, musíte medzi ne napísať čiarku.

source: The following example defines a function that uses two parameters to move an entity on both the X and Y axes.
hu: A következő példa létrehoz egy függvényt, aminek 2 paramétere van, amivel egy dolgot mozgat az X és Y tengelyen.
pl: W poniższym przykładzie zdefiniowano funkcję, która używa dwóch parametrów do przenoszenia jednostki na obu osiach X i Y.
sk: Nasledujúci príklad definuje funkciu, ktorá používa dva parametre na presun entity na osi X a Y.
sv: Följande exempel definierar en funktion som använder två parametrar för att flytta en entitet på både X- och Y-axeln.
zh_hans: 以下示例定义了一个函数，该函数使用两个参数在 X 轴和 Y 轴上移动实体。

source: Now it's your turn to create a function with multiple parameters: a function to draw rectangles of any size.
hu: Most a te feladatod lesz elkészíteni egy függvényt, ami több paraméterrel rendelkezik: egy függvényt, ami bármilyen méretű téglalapot tud rajzolni.
pl: Teraz twoja kolej, żeby utworzyć funkcję z wieloma parametrami: funkcję do rysowania prostokątów o dowolnym rozmiarze.
sk: Teraz je rad na vás, aby ste vytvorili funkciu s viacerými parametrami: funkciu na kreslenie obdĺžnikov ľubovoľnej veľkosti.
sv: Nu är det din tur att skapa en funktion med flera parametrar: en funktion för att rita rektanglar av valfri storlek.
zh_hans: 现在轮到你创建一个具有多个参数的函数了：一个绘制任意大小矩形的函数。

source: Before we create a rectangle of any size, let's first see how we can use parameters to draw simpler shapes.
hu: Mielőtt készítenénk egy tetszőleges méretű téglalapot, először nézzük meg, hogyan használhatjuk a paramétereket egyszerűbb alakzatok rajzolására.
sk: Skôr ako vytvoríme obdĺžnik ľubovoľnej veľkosti, pozrime sa najprv, ako môžeme použiť parametre na kreslenie jednoduchších tvarov.

source: Here we have an incomplete function that will draw corners with lines of any length, but it's missing its [code]length[/code] parameter.
hu: Itt egy befejezetlen függvény, ami sarkokat rajzol, tetszőleges vonal hosszúsággal, de hiányzik belőle a [code]length[/code] paraméter.
sk: Máme tu neúplnú funkciu, ktorá nakreslí rohy s čiarami ľubovoľnej dĺžky, ale chýba jej parameter [code]length[/code].

source: The function will move the turtle forward an amount defined by the parameter [code]length[/code], turn [code]90[/code] degrees, then move forward [code]length[/code] pixels.
hu: A függvény előre mozdítja a teknőst a [code]length[/code] paraméterben megadott értékkel, elfordítja [code]90[/code] fokkal, majd ismét előre mozdítja a [code]length[/code] értékével.
sk: Funkcia posunie korytnačku dopredu o hodnotu definovanú parametrom [code]length[/code], otočí sa o [code]90[/code] stupňov a potom sa posunie o [code]length[/code] pixelov dopredu.

source: Complete the [code]draw_corner()[/code] function so it uses the [code]length[/code] parameter to draw corners.
hu: Fejezd be a [code]draw_corner()[/code] függvényt, hogy a [code]length[/code] paramétert használja a sarkok rajzolásához.
sk: Doplňte funkciu [code]draw_corner()[/code] tak, aby na kreslenie rohov používala parameter [code]length[/code].

source: In this practice, we'll improve our [code]draw_corner()[/code] function so the angle can also vary.
hu: Ebben a gyakorlatban feljavítjuk a [code]draw_corner()[/code] függvényünket, hogy a szöget is meg lehessen adni.
sk: V tomto praktickom príklade zlepšíme našu funkciu [code]draw_corner()[/code] tak, aby sa mohol meniť aj uhol.

source: Add the [code]angle[/code] parameter after the [code]length[/code] parameter in the [code]draw_corner()[/code] function and use it to draw corners of varying angles.
hu: Hozd létre az [code]angle[/code] paramétert a [code]length[/code] paraméter után, a [code]draw_corner()[/code] függvényben és rajzolj vele különböző szögű sarkokat.
sk: Vo funkcii [code]draw_corner()[/code] pridajte parameter [code]angle[/code] za parameter [code]length[/code] a použite ho na kreslenie rohov s rôznym uhlom.

source: We want a function to draw squares of any size.
hu: Egy olyan függvényre van szükségünk, ami bármekkora négyzetet tud rajzolni.
sk: Chceme funkciu na kreslenie štvorcov ľubovoľnej veľkosti.

source: We could use these squares as outlines when selecting units in a tactical game, as a frame for items in an inventory, and more.
hu: Használhatjuk ezeket a négyzeteket egységek kijelöléséhez egy stratégiai játékban, egy eszköztár elemeinek a keretéhez, és még sok más dologhoz.
sk: Tieto štvorce by sme mohli použiť ako obrysy pri výbere jednotiek v taktickej hre, ako rám pre predmety v inventári a podobne.

source: Create a function named [code]draw_square()[/code] that takes one parameter: the [code]length[/code] of the square's sides.
hu: Készíts egy [code]draw_square()[/code] nevű függvényt, aminek egy paramétere van: a [code]length[/code], ami a négyzet oldalának a hossza.
sk: Vytvorte funkciu s názvom [code]draw_square()[/code], ktorá má jeden parameter: [code]length[/code] dĺžku strany štvorca.

source: [b]The turtle should face towards the right when starting or completing a square.[/b]
hu: [b]A teknős nézzen jobbra, amikor elkezd vagy befejez egy négyzetet.[/b]
sk: [b] Korytnačka by mala pri začatí alebo dokončení štvorca smerovať doprava[/b].

source: Be sure to call [b]turn_right(90)[/b] enough times in your function to do so.
hu: Győződj meg róla, hogy elégszer hívod a [b]turn_right(90)[/b] függvényt, hogy ez megtörténjen.
sk: Uistite sa, že ste vo svojej funkcii zapísali [b]turn_right(90)[/b] dostatočne veľakrát, aby ste tak urobili.

source: Let's make our square drawing function more flexible to include rectangles of varying sizes.
hu: Tegyük még inkább sokoldalúvá a függvényünket, hogy tetszőleges méretű téglalapokat is tudjon rajzolni.
sk: Urobme našu funkciu kreslenia štvorcov flexibilnejšou, aby zahŕňala obdĺžniky rôznych veľkostí.

source: Your job is to code a function named [code]draw_rectangle()[/code] that takes two parameters: the [code]length[/code] and the [code]height[/code] of the rectangle.
hu: A feladatod, hogy készíts egy [code]draw_rectangle()[/code] nevű függvényt, ami két paramétert fogad: a téglalap hosszát - [code]length[/code], és magasságát - [code]height[/code].
sk: Vašou úlohou je nakódovať funkciu s názvom [code]draw_rectangle()[/code], ktorá má dva parametre: [code]length[/code] a [code]height[/code] - dĺžku a výšku obdĺžnika.

source: [b]The turtle should face towards the right when starting or completing a rectangle.[/b]
hu: [b]A teknős nézzen jobbra, amikor elkezd vagy befejez egy négyzetet.[/b]
sk: [b]Pri začatí alebo dokončení obdĺžnika by mala korytnačka smerovať doprava[/b].

source: Note that we could still draw a square with [code]draw_rectangle()[/code] by having the [code]length[/code] and [code]height[/code] equal the same value.
hu: Megjegyzés: a [code]draw_rectangle()[/code] fügvénnyel továbbra is rajzolhatunk négyzeteket, ha a [code]length[/code] és a [code]height[/code] értéke megegyezik.
sk: Všimnite si, že pomocou [code]draw_rectangle()[/code] by sme mohli nakresliť aj štvorec, ak by sa hodnoty [code]length[/code] a [code]height[/code] rovnali rovnakej hodnote.

source: Can I rotate in both directions?
pl: Czy mogę obracać się w obie strony?
sk: Môžem otáčať oboma smermi?
zh_hans: 我可以向两个方向旋转吗？

source: func function_name(parameter_1, parameter_2, ...):
da: func funktion_navn(parameter_1, parameter_2,...):
pl: func nazwa_funkcji(parameter_1, parameter_2, ...):
sv: func funktion_namn(parameter_1, parameter_2, ...):
tr: func fonksiyon_ismi(alinan_deger_1, alinan_deger_2, ...):
zh_hans: func 函数名（参数_1，参数_2，...）：

source: func function_name(parameter_1 parameter_2 ...):
da: func funktion_navn(parameter_1 parameter_2 ...):
pl: func nazwa_funkcji(parameter_1 parameter_2 ...):
sv: func funktion_namn(parameter_1 parameter_2 ...):
tr: func fonksiyon_ismi(alinan_deger_1 alinan_deger_2 ...):
zh_hans: func 函数名（参数_1 参数_2 ...）：

source: func function_name(): parameter_1, parameter_2, ...
da: func funktion_navn(): parameter_1, parameter_2, ...
pl: func nazwa_funkcji(): parameter_1, parameter_2, ...
sv: func funktion_namn(): parameter_1, parameter_2, ...
tr: func fonksiyon_ismi(): alinan_deger_1, alinan_deger_2, ...
zh_hans: func 函数名（）：参数_1，参数_2，...

source: In the previous part, you created a function to draw a square of a fixed size. This function is a bit limiting. Instead, it would be much better if we had a function to draw a square of [i]any[/i] size. Or better: any kind of rectangle (a square is a specific kind of rectangle). In previous lessons, you used the [code]rotate()[/code] function and gave it an [i]argument[/i].
pl: W poprzedniej części stworzyłeś funkcję do rysowania kwadratu o stałym rozmiarze. Ta funkcja jest jednak trochę ograniczająca. Zamiast tego o wiele lepiej byłoby mieć funkcję do rysowania kwadratu o [i]dowolnym[/i] rozmiarze. A jeszcze lepiej: dowolnego prostokąta (kwadrat to szczególny przypadek prostokąta). We wcześniejszych lekcjach używałeś funkcji [code]rotate()[/code] i przekazywałeś jej [i]argument[/i].
zh_hans: 在上一部分中，您创建了一个函数来绘制一个固定大小的正方形。 这个功能有点限制。 相反，如果我们有一个函数来绘制一个 [i]任意[/i] 大小的正方形会更好。 或者更好：任何类型的矩形（正方形是特定类型的矩形）。 在之前的课程中，您使用了 [code]rotate()[/code] 函数并给了它一个 [i] 参数[/i]。

source: For now, please focus on the first line: [code]func rotate(radians)[/code]. When you call [code]rotate(0.5)[/code], the computer binds the value [code]0.5[/code] to the label [code]radians[/code]. Wherever the computer sees the identifier [code]radians[/code] inside the function, it replaces it with the [code]0.5[/code] value. The parameter name is always a label you use to refer to a [i]value[/i]. The value in question can be a number, text, or anything else. For now, we'll stick to numbers as we have yet to see other value types.
pl: Na ten moment skupmy się na pierwszym wierszu: [code]func rotate(radians)[/code]. Gdy wywołujemy [code]rotate(0.5)[/code], komputer wiąże wartość [code]0.5[/code] z etykietą [code]radians[/code]. Wszędzie tam, gdzie komputer widzi identyfikator [code]radians[/code] wewnątrz funkcji, zastępuje go wartością [code]0.5[/code]. Nazwa parametru jest zawsze etykietą, której używasz do odwoływania się do [i]wartości[/i]. Dana wartość może być liczbą, tekstem lub dowolną inną wartością. Na razie będziemy trzymać się liczb, ponieważ nie mieliśmy jeszcze do czynienia z innymi typami wartości.
sv: För tillfället, vänligen fokusera på den första raden: [code]func rotate(radians)[/code]. När du anropar [code]rotate(0.5)[/code] binder datorn värdet [code]0.5[/code] till etiketten [code]radians[/code]. Varhelst datorn ser identifieraren [code]radians[/code] inuti funktionen, ersätter datorn den med värdet [code]0,5[/code]. Parameternamnet är alltid en etikett som du använder för att referera till ett [i]värde[/i]. Värdet i fråga kan vara ett nummer, text eller något annat. För närvarande kommer vi att hålla oss till siffror eftersom vi ännu inte har sett andra värdetyper.
zh_hans: 现在，请关注第一行：[code]func rotate(radians)[/code]。 当您调用 [code]rotate(0.5)[/code] 时，计算机会将值 [code]0.5[/code] 绑定到标签 [code]radians[/code]。 无论计算机在函数内何处看到标识符 [code]radians[/code]，都会将其替换为 [code]0.5[/code] 值。 参数名称始终是您用来引用 [i] 值[/i] 的标签。 有问题的值可以是数字、文本或其他任何内容。 目前，我们将坚持使用数字，因为我们还没有看到其他值类型。

source: A parameter is a label that represents a value. The value in question can change: it depends on what you put in parentheses when calling a function.
pl: Parametry to etykiety reprezentujące wartość. Wartość, o której mowa, może się zmieniać: zależy ona od tego, co umieścisz w nawiasach podczas wywoływania funkcji.
sv: En parameter är en etikett som representerar ett värde. Värdet i fråga kan ändras: det beror på vad du sätter inom parentes när du anropar en funktion.
zh_hans: 参数是表示值的标签。 有问题的值可能会改变：这取决于您在调用函数时放入括号中的内容。

source: You can give your function parameters when writing its [i]definition[/i] (the line starting with the [code]func[/code] keyword). To do so, you add a name inside of the parentheses.
pl: Możesz podać swojej funkcji parametry podczas pisania jej [i]definicji[/i] (linii rozpoczynającej się od słowa kluczowego [code]func[/code]). Aby to zrobić, musisz dodać nazwę odpowiadającej parametrowi w nawiasach.
sv: Du kan ge dina funktionsparametrar när du skriver dess [i]definition[/i] (raden som börjar med nyckelordet [code]func[/code]). För att göra det lägger du till ett namn inom parentesen.
zh_hans: 您可以在编写函数的 [i]definition[/i]（以 [code]func[/code] 关键字开头的行）时提供函数参数。 为此，您在括号内添加一个名称。

source: You can give parameters any name. How you name functions and parameters is up to you. Just remember that names cannot contain spaces. To write parameter names with multiple words, you need to use underscores. The following function definition is exactly equivalent to the previous one.
pl: Możesz nadać parametrom dowolną nazwę. To, jak nazwiesz funkcje i parametry, zależy tylko od ciebie. Pamiętaj tylko, że nazwy nie mogą zawierać spacji. Aby stworzyć nazwę parametru wykorzystującej wiele słów, musisz użyć podkreśleń. Poniższa definicja funkcji jest dokładnie równoważna tej pokazanej poprzednio.
sv: Du kan ge parametrar vilket namn som helst. Hur du namnger funktioner och parametrar är upp till dig. Kom bara ihåg att namn inte kan innehålla mellanslag. För att skriva parameternamn med flera ord måste du använda understreck. Följande funktionsdefinition är exakt likvärdig med den föregående.
zh_hans: 您可以为参数指定任何名称。 如何命名函数和参数取决于您。 请记住，名称不能包含空格。 要用多个单词编写参数名称，您需要使用下划线。 下面的函数定义与前一个完全相同。

source: Parameters make your code easier to reuse. Here's an example with a function to draw any square. Use the slider to change the value passed to the function and draw squares of different sizes.
pl: Parametry ułatwiają ponowne użycie kodu. Spójrz na przykład z funkcją rysowania dowolnego kwadratu. Użyj suwaka, aby zmienić wartość przekazywaną do funkcji i narysuj kwadraty o różnych rozmiarach.
sv: Parametrar gör din kod lättare att återanvända. Här är ett exempel med en funktion för att rita valfri kvadrat. Använd skjutreglaget för att ändra värdet som skickas till funktionen och rita rutor av olika storlekar.
zh_hans: 参数使您的代码更易于重用。 这是一个带有绘制任何正方形的函数的示例。 使用滑块更改传递给函数的值并绘制不同大小的正方形。

source: To define a function, you need to start with the [code]func[/code] keyword followed by a space, the [code]function_name[/code], and optional parameters inside parentheses. You must end the line with a colon, which defines a new code block. We'll see moving forward that keywords other than [code]func[/code] require a colon at the end of the line.
pl: Aby zdefiniować funkcję, musisz zacząć od słowa kluczowego [code]func[/code], po którym następuje spacja, [code]nazwa_funkcji[/code] i opcjonalne parametry w nawiasach. Musisz zakończyć linię dwukropkiem, który definiuje nowy blok kodu. Zauważ, że słowa kluczowe inne niż [code]func[/code] wymagają dwukropka na końcu wiersza.
sv: För att definiera en funktion måste du börja med nyckelordet [code]func[/code] följt av ett mellanslag, [code]function_name[/code] och valfria parametrar inom parentes. Du måste avsluta raden med ett kolon, som definierar ett nytt kodblock. Vi kommer att se framåt att andra sökord än [code]func[/code] kräver ett kolon i slutet av raden.
zh_hans: 要定义一个函数，您需要以 [code]func[/code] 关键字开头，后跟一个空格、[code]function_name[/code] 和括号内的可选参数。 您必须以冒号结束该行，它定义了一个新的代码块。 我们将看到除 [code]func[/code] 以外的关键字在行尾需要冒号。

source: You can use multiple parameters in a function. In fact, you can use as many as you [i]need[/i]. To separate the function parameters, you need to write a comma between them.
pl: W funkcji możemy używać wielu parametrów. Tak po prawdziwe możesz użyć tylu parametrów, ilu tylko [i]potrzebujesz[/i]. Aby oddzielić od siebie parametry funkcji, należy wpisać pomiędzy nie wpisać przecinek.
sv: Du kan använda flera parametrar i en funktion. Faktum är att du kan använda så många du [i]behöver[/i]. För att separera funktionsparametrarna måste du skriva ett kommatecken mellan dem.
zh_hans: 您可以在一个函数中使用多个参数。 事实上，您可以使用 [i] 需要 [/i] 的任意数量。 要分隔函数参数，您需要在它们之间写一个逗号。

source: Must I write spaces between function parameters?
zh_hans: 我必须在函数参数之间写空格吗？

source: In a function definition, you must have a space between the [code]func[/code] keyword and the function name. However, because we use the comma to separate parameters, it doesn't matter if you use spaces between parameters. As long as you have the comma, either syntax is correct. We often use spaces after the comma for readability.
pl: W definicji funkcji musisz umieścić spację między słowem kluczowym [code]func[/code] a nazwą funkcji. Ponieważ jednak używamy przecinka do oddzielania parametrów, nie ma znaczenia, czy pomiędzy poszczególnymi parametrami użyjesz spacji. Dopóki znajduje się tam przecinek, każda składnia jest poprawna. Spacji po przecinku używamy wyłącznie dla czytelności. Wcale nie musi tam być.
sv: I en funktionsdefinition måste du ha ett mellanslag mellan nyckelordet [code]func[/code] och funktionsnamnet. Men eftersom vi använder kommatecken för att separera parametrar, spelar det ingen roll om du använder mellanslag mellan parametrarna. Så länge du har kommatecken är endera syntaxen korrekt. Vi använder ofta mellanslag efter kommatecken för läsbarhet.
zh_hans: 在函数定义中，[code]func[/code] 关键字和函数名之间必须有一个空格。 但是，因为我们使用逗号分隔参数，所以参数之间是否使用空格无关紧要。 只要你有逗号，任何一种语法都是正确的。 为了便于阅读，我们经常在逗号后使用空格。

source: The names of functions, parameters, or other things in your code are entirely up to you. They are written by us programmers for other programmers. You want to use the names that make the most sense to you and fellow programmers. You could absolutely write single-letter names like in maths classes: [code]a[/code], [code]b[/code], [code]f[/code]. You can also write abbreviated names like [code]pos[/code] for position, [code]bg[/code] for background, and so on. Many programmers do either or both of the above. At GDQuest, we favor complete and explicit names. We generally try to write code that is explicit and relatively easy to read. Right now, you have to enter every letter when you code, so long names may feel inconvenient. However, this is good for learning: it trains your fingers to [ignore]type precisely. Then, after you finish this course, you will see that the computer assists you a lot when you code real games with a feature called auto-completion. Based on a few characters you [ignore]type, it will offer you to complete long names.
sv: Namnen på funktioner, parametrar eller andra saker i din kod är helt upp till dig. De är skrivna av oss programmerare för andra programmerare. Du vill använda sådana namn som verkar mest meningsfulla för dig och andra programmerare. Du kan absolut skriva enbokstavsnamn som i matematikklasser: [code]a[/code], [code]b[/code], [code]f[/code]. Du kan också skriva förkortade namn som [code]pos[/code] för position, [code]bg[/code] för bakgrund och så vidare. Många programmerare gör endera eller båda av ovanstående. På GDQuest föredrar vi fullständiga och explicita namn. Vi försöker i allmänhet att skriva kod som är explicit och relativt lätt att läsa. Just nu måste du skriva varje bokstav när du kodar, så långa namn kan kännas obekväma. Detta är dock bra för att inlärningen: det tränar fingrarna att skriva exakt. Senare, efter att du är klar med den här kursen, kommer du att märka att datorn hjälper dig en hel del när du kodar riktiga spel, genom en funktion som kallas autokomplettering. Baserat på de första tecknen du skriver, kan datorn erbjuda dig att automatiskt fylla i resten av det långa namnet.
zh_hans: 代码中的函数、参数或其他内容的名称完全取决于您。 它们是我们程序员为其他程序员编写的。您应该使用对您和其他程序员最有意义的名称。 你绝对可以像在数学课中那样写单字母名称：[code]a[/code]、[code]b[/code]、[code]f[/code]。 您还可以写缩写名称，例如 [code]pos[/code] 表示位置，[code]bg[/code] 表示背景，等等。 许多程序员都使用上述任何一种或两种方式。 在 GDQuest，我们倾向于完整和明确的名称。 我们通常会尝试编写明确且相对容易阅读的代码。 现在，您必须在编码时输入每个字母，因此长名称可能会让人感到不便。 但是，这对学习有好处：它可以训练您的手指精确打字。 然后，在您完成本课程后，您会发现当您实际编写游戏时，计算机会使用称为自动补全的功能为您提供很多帮助。 根据您键入的几个字符，它会为您补完完整的长名称。

source: Before we create a rectangle of any size, let's first see how we can use parameters to draw simpler shapes. Here we have an incomplete function that will draw corners with lines of any length, but it's missing its [code]length[/code] parameter. The function will move the turtle forward an amount defined by the parameter [code]length[/code], turn [code]90[/code] degrees, then move forward [code]length[/code] pixels. Complete the [code]draw_corner()[/code] function so it uses the [code]length[/code] parameter to draw corners.
pl: Nim stworzymy prostokąt o dowolnym rozmiarze, zobaczmy najpierw, jak możemy użyć parametrów do narysowania prostszych kształtów. Przed sobą masz niekompletną funkcję, która w założeniu ma rysować rogi liniami o dowolnej długości, jednak brakuje jej parametru [code]length[/code] odpowiadającej za długość linii. Funkcja ma przesunąć żółwika do przodu o wartość określoną przez parametr [code]length[/code], obrócić go o [code]90[/code] stopni, a następnie przesunąć do przodu o [code]length[/code] pikseli. Uzupełnij funkcję [code]draw_corner()[/code] tak, aby używała ona parametru [code]length[/code] do rysowania rogów.
sv: Innan vi skapar en rektangel av valfri storlek, låt oss först se hur vi kan använda parametrar för att rita enklare former. Här har vi en ofullständig funktion som kommer att rita hörn med linjer av valfri längd, men den saknar parametern [code]length[/code]. Funktionen flyttar sköldpaddan framåt ett belopp som definieras av parametern [code]length[/code], vrider [code]90[/code] grader och flyttar sedan framåt [code]length[/code] pixlar. Fyll i funktionen [code]draw_corner()[/code] så att den använder parametern [code]length[/code] för att rita hörn.
zh_hans: 在我们创建任意大小的矩形之前，让我们先看看如何使用参数来绘制更简单的形状。 这里我们有一个不完整的函数，它可以用任意长度的线绘制角，但是它缺少它的 [code]length[/code] 参数。 该函数将把海龟向前移动一个由参数 [code]length[/code] 定义的量，转动 [code]90[/code] 度，然后向前移动 [code]length[/code] 个像素。 完成 [code]draw_corner()[/code] 函数，使其使用 [code]length[/code] 参数绘制角。
