Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-14-multiplying.po
Languages: hu, nl, pl, tr, uk, zh_hans

source: When our robot's [code]level[/code] is [code]3[/code] or more, we want it to take a lot less damage. Add to the [code]take_damage()[/code] function so the following happens: - [code]if[/code] the robot's [code]level[/code] is greater than [code]2[/code], reduce the damage [code]amount[/code] by 50% The robot is level 3. An enemy is going to attack for 10 damage. This damage should reduce to 5.
hu: Ha a robotunk [code]level[/code] értéke [code]3[/code] vagy annál több, szeretnénk, ha kevesebb sebzést szenvedne el. Egészítsd ki a [code]take_damage()[/code] függvényt a következőképpen: - ha ([code]if[/code]) a [code]level[/code] értéke nagyobb, mint [code]2[/code], csöökentsd az [code]amount[/code] értékét 50%-kal. A robot 3. szintű. Egy ellenfél 10 sebzéssel támad. Ennek a sebzésnek 5-re kell csökkennie.
nl: Wanneer het [code]level[/code] van onze robot [code]3[/code] of hoger is, willen we dat hij veel minder schade oploopt. Vul de functie [code]take_damage()[/code] aan zodat het volgende gebeurt: - Als ([code]if[/code]) het [code]level[/code] van de robot hoger is dan [code]2[/code], verminder de [code]amount[/code] aan schade met 50%. De robot is van niveau 3. Een vijand zal aanvallen met 10 schade. Deze schade moet worden teruggebracht tot 5.
pl: Gdy [code]level[/code] naszego robota wynosi [code]3[/code] lub więcej, chcemy, aby odnosił znacznie mniej obrażeń. Dodaj do funkcji [code]take_damage()[/code] odpowiedni kod, aby wydarzyło się co następuje: - używając warunku [code]if[/code] spraw, że jeśli [code]level[/code] robota wyniesie niż [code]2[/code], wówczas zmniejszy się wartość otrzymywanych obrażeń ([code]amount[/code]) o 50% Robot ma poziom 3. Wróg zaatakuje zadając 10 obrażeń. Obrażenia te powinny zmniejszyć się do 5.
tr: Robotumuzun seviyesi, [code]level[/code], [code] 3[/code] veya daha fazla olduğunda, çok daha az hasar alsın istiyoruz. [code]take_damage()[/code] fonksiyonuna, aşağıdakileri gerçekleştirmek için ekleme yap: - eğer, [code]if[/code], robotun seviyesi, [code]level[/code], [code]2[/code]'den büyükse, hasar miktarını, [code]amount[/code], %50 oranında azalt Robot seviyesi 3. Bir düşman, 10 hasar vermek için saldırmak üzere. Bu hasarın miktarı 5'e düşmeli.
zh_hans: 当机器人的 [code]level[/code] 为 [code]3[/code] 或大于3时，我们希望它受到的伤害更少。 添加新代码到 [code]take_damage()[/code] 函数，以实现下述功能： - [code]如果（if）[/code]机器人的[code]level[/code]大于[code]2[/code]，伤害[code]amount[/code] 的量减少50% 机器人 3 级的时候。一次敌人的攻击会造成 10 点伤害。那么这个伤害应该减少到5。

source: In this lesson, we'll just focus on increasing the robot's [code]max_health[/code]. The variable [code]max_health[/code] is the maximum amount the robot's [code]health[/code] can be. We change our [code]take_damage()[/code] function to use this variable.
pl: W tej lekcji skupimy się tylko na zwiększaniu [code]max_health[/code] robota. Zmienna [code]max_health[/code] to maksymalna wartość, jaką może wynosić [code]health[/code] robota. Zmieńmy naszą funkcję [code]take_damage()[/code], aby używała tej zmiennej.
