Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-26-looping-over-dictionaries.po
Languages: da, es, fr, nl, pl, tr, uk, zh_hans

source: We can also use a dictionary to map units to their position on a game board. That's how you'd typically code a board game, a grid-based RPG, or a tactical RPG. While we focused on [code]String[/code] keys so far, GDScript dictionaries accept any value type as a key, allowing you to map anything to anything. The only limitation is that every key must be unique.
es: También podemos utilizar un diccionario para mapear unidades a su posición en un tablero de juego. Así es como normalmente codificarías un juego de mesa, un RPG basado en cuadrículas o un RPG táctico. Aunque hasta ahora nos hemos centrado en las claves [code]String[/code], los diccionarios GDScript aceptan cualquier tipo de valor como clave, lo que te permite mapear cualquier cosa a cualquier cosa. La única limitación es que cada clave debe ser única.
fr: Nous pouvons également utiliser un dictionnaire pour mapper des unités à leur position sur un plateau de jeu. C'est ainsi que vous codez généralement un jeu de plateau, un RPG basé sur une grille ou un RPG tactique. Bien que nous nous soyons concentrés sur les clés [code]String[/code] jusqu'à présent, les dictionnaires GDScript acceptent n'importe quel type de valeur comme clé, ce qui vous permet de mapper n'importe quoi à n'importe quoi. La seule limitation est que chaque clé doit être unique.
nl: We kunnen ook een dictionary gebruiken om eenheden te koppelen aan hun positie op een bord. Zo zou je een bordspel, een raster-gebaseerde RPG of een tactische RPG coderen. Tot nu toe hebben we ons gericht op [code]String[/code] sleutels, maar GDScript dictionaries accepteren elk type waarde als sleutel, waardoor je alles aan alles kunt koppelen. De enige beperking is dat elke sleutel uniek moet zijn.
tr: Birimleri, bir oyun tahtasındaki konumlarına eşlemek için bir sözlük de kullanabiliriz. Genellikle bir masa oyununu, ızgara tabanlı bir RPG'yi, veya taktiksel bir RPG'yi bu şekilde kodlarsın. Şimdiye kadar dize tipinde ([code]String[/code]) anahtarlarına odaklanmış olsak da, GDScript sözlükleri herhangi bir değer tipini anahtar olarak kabul edebilir, ve herhangi bir şeyi herhangi başka bir şeyle eşlemene olanak tanır. Tek sınırlama, her anahtarın benzersiz olması gerektiğidir.
zh_hans: 在棋盘网格上，用字典还可以将单位和他们所在的位置用映射关系联系起来。 通常，这是编写棋盘游戏、或者基于网格的RPG、战术RPG游戏的方式。 虽然现目前我们主要用的是[code]String[/code]（字符串）键，但 GDScript 的字典接受任何值类型的键，任何类型的键都可以映射给任何类型的值。 唯一的限制是，每个键都必须是唯一的。

source: We use a dictionary to represent the player's inventory in this game. The dictionary keys are the name of items, and they map to the number of items that the player owns. You need to loop over the dictionary and display the name and amount of every item in the inventory. To do so, call the [code]display_item()[/code] function. It takes two arguments: the item name and the amount.
es: Utilizamos un diccionario para representar el inventario del jugador en este juego. Las claves del diccionario son los nombres de los objetos y se mapean al número de objetos que posee el jugador. Tienes que hacer un bucle sobre el diccionario y mostrar el nombre y la cantidad de cada objeto del inventario. Para ello, llama a la función [code]display_item()[/code]. Esta toma dos argumentos: el nombre del objeto y la cantidad.
fr: Nous utilisons un dictionnaire pour représenter l'inventaire du joueur dans ce jeu. Les clés du dictionnaire sont les noms des objets, et elles sont mappées au nombre d'objets que le joueur possède. Vous devez effectuer une boucle sur le dictionnaire et afficher le nom et la quantité de chaque article de l'inventaire. Pour ce faire, appelez la fonction [code]display_item()[/code]. Elle prend deux arguments : le nom de l'objet et la quantité.
nl: We gebruiken een dictionary om de inventaris van de speler in dit spel voor te stellen. De sleutels van de dictionary zijn de namen van voorwerpen en ze staan voor het aantal voorwerpen dat de speler bezit. Je moet de dictionary doorlopen en de naam en het aantal van elk voorwerp in de inventaris weergeven. Roep hiervoor de functie [code]display_item()[/code] aan. Deze neemt twee argumenten: de voorwerpnaam en het aantal.
tr: Bu oyunda, oyuncunun envanterini temsil etmek için bir sözlük kullanıyoruz (inventory). Sözlüğün anahtarları öğelerin isimleridir ve oyuncunun sahip olduğu öğe sayılarıyla eşlenir. Sözlüğün üzerinde döngü yapman ve envanterdeki her öğenin adını ve miktarını görüntülemen gerekiyor. Bunu yapmak için [code]display_item()[/code] (görüntüle_öğe) fonksiyonunu çağır. Bu fonksiyon iki girdi değişkeni gerektirir: öğenin ismi ve miktarı.
zh_hans: 我们使用字典来代表玩家在这个游戏中的背包库存。字典的键是物品的名称，映射的值是玩家拥有的对应物品的数量。 你的任务是遍历字典并显示背包中每个物品的名称和数量。 为此，请调用 [code]display_item()[/code]（显示物品）函数。它有两个参数：物品名称和数量。

source: We need to display the player's inventory on the screen but lack the code to do so. Use a loop to display every item.
es: Necesitamos mostrar el inventario del jugador en la pantalla, pero nos falta el código para hacerlo. Utiliza un bucle para mostrar cada objeto.
fr: Nous devons afficher l'inventaire du joueur à l'écran mais il nous manque le code pour le faire. Utilisez une boucle pour afficher chaque objet.
nl: We moeten de inventaris van de speler tonen op het scherm, maar we missen de code om dat te doen. Gebruik een lus om elk voorwerp weer te geven.
tr: Oyuncunun envanterini ekranda göstermemiz gerekiyor, ancak bunu yapmak için kodumuz yok. Her öğeyi görüntülemek için bir döngü kullan.
zh_hans: 我们需要在屏幕上显示玩家有什么物品，但是现在缺少能执行此操作的代码。用循环代码显示出每个物品。

source: We have a dictionary named [code]units[/code] that maps a cell position on the grid to a unit to put there. Using a for loop and the [code]place_unit()[/code] function, place every unit in the units dictionary at the desired position on the game board.
es: Tenemos un diccionario llamado [code]units[/code] que mapea una posición de celda de la cuadrícula a una unidad para ponerla allí. Utilizando un bucle for y la función [code]place_unit()[/code], coloca cada unidad del diccionario de unidades en la posición deseada del tablero de juego.
fr: Nous avons un dictionnaire nommé [code]units[/code] qui fait correspondre une position de case sur la grille à une unité à placer là. À l'aide d'une boucle for et de la fonction [code]place_unit()[/code], placez chaque unité du dictionnaire d'unités à la position souhaitée sur le plateau de jeu.
nl: We hebben een dictionary genaamd [code]units[/code] die een celpositie op het raster koppelt aan een spelstuk om daar te plaatsen. Met behulp van een for-lus en de functie [code]place_unit()[/code] plaats je elk spelstuk in het dictionary op de gewenste positie op het bord.
tr: [code]units[/code] adında (birimler), ızgaradaki bir hücre konumunu, oraya koyacağımız bir birimle eşleyen bir sözlüğümüz var. Bir for döngüsü ve [code]place_unit()[/code] (yerleştir_birim) fonksiyonunu kullanarak, birimler sözlüğündeki her birimi oyun tahtasında istenen konuma yerleştir.
zh_hans: 我们有一个名为[code]units[/code]（单元）的字典，它将网格上的一个位置和要放在那里的单位映射起来。 使用 for 循环和 [code]place_unit()[/code]（放置单位）函数，将units字典中的所有单位放置在游戏棋盘上正确的位置是上。

source: We want to populate our game board with units at the start of every battle. Loop over the dictionary to place units on the board.
es: Queremos poblar nuestro tablero de juego con unidades al comienzo de cada batalla. Haz un bucle sobre el diccionario para colocar las unidades en el tablero.
fr: Nous voulons peupler notre plateau de jeu avec des unités au début de chaque bataille. Faites une boucle sur le dictionnaire pour placer les unités sur le plateau.
nl: We willen ons spelbord vullen met spelstukken aan het begin van elk gevecht. Loop door de dictionary om spelstukken op het bord te plaatsen.
tr: Her savaşın başında, oyun tahtamızı birimlerle doldurmak istiyoruz. Birimleri tahtaya yerleştirmek için sözlüğün üzerinde döngü yap.
zh_hans: 我们想在每场战斗开始时用单位填充我们的游戏棋盘。 循环遍历字典以将单位放置在棋盘上。

source: But it's something we do so much that you don't need to call the function. Instead, you can directly [ignore]type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
fr: Mais c'est quelque chose que nous faisons tellement qu'il n'est pas nécessaire d'appeler la fonction. Au lieu de cela, vous pouvez taper directement le nom de la variable dans une boucle [code]for[/code] après le mot-clé [code]in[/code]. Le langage comprend que vous voulez implicitement boucler sur les clés du dictionnaire.
nl: Maar dit is iets wat we zo vaak doen dat je de functie niet hoeft aan te roepen. In plaats daarvan kun je de variabelenaam direct [ignore]typen in een [code]for[/code] lus na het [code]in[/code] sleutelwoord. De taal begrijpt dat je impliciet over de sleutels van de dictionary wilt lussen.
zh_hans: 但这个功能我们用的太频繁了，以至于现在都不需要调用该函数。 相反，可以在[code]for[/code] 循环的 [code]in[/code] 关键字之后直接键入变量名称（如下）。编程语言懂你在暗示想要遍历字典的键。
