Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-23-append-to-arrays.po
Languages: da, fr, hu, it, nl, pt, pt_br, tr, uk, zh_hans

source: In the example below, customers order meals that end up in a waiting line (a queue). You need to prepare them in the kitchen. We simulate orders arriving and getting completed over time.
da: I eksemplet nedenfor bestiller kunder måltider, der ender i kø. Du skal tilberede dem i køkkenet. Vi simulerer, at ordrer ankommer og bliver færdiggjort over tid.
uk: У наведеному нижче прикладі клієнти замовляють страви, які потрапляють у список очікування (чергу). Вам потрібно приготувати їх на кухні. Ми моделюємо надходження замовлень і їх виконання з плином часу.

source: When a customer purchases a meal, you want to [i]append[/i] (add) it to the array. Then, as you complete a meal in the kitchen and serve it, you want to remove it from the array.
da: Når en kunde køber et måltid, skal du [i]tilføje[/i] det til arrayet. Når du derefter færdiggør et måltid i køkkenet og serverer det, skal du fjerne det fra arrayet.
uk: Коли клієнт купує страву, ви хочете [i]додати[/i] її до масиву. Потім, коли ви завершуєте страву на кухні та подаєте її, ви хочете видалити її з масиву.

source: You can use the [code]append()[/code] function to add values at the end of an array. To remove values from the start, you can use the [code]pop_front()[/code] function. We call it "pop" because the value jumps out of the array.
da: Du kan bruge funktionen [code]append()[/code] til at tilføje værdier i slutningen af et array. For at fjerne værdier fra starten kan du bruge funktionen [code]pop_front()[/code]. Vi kalder det "pop", fordi værdien springer ud af arrayet.
uk: Ви можете використовувати функцію [code]append()[/code] для додавання значень в кінець масиву. Щоб видалити значення з початку, ви можете використовувати функцію [code]pop_front()[/code]. Ми називаємо її «pop», тому що значення вискакує з масиву.

source: Notice how we call some functions by writing a dot after a variable name. Just like some values have variables you can access with a dot (like the [code]x[/code] variable in [code]position.x[/code]), they can also have their own functions.
da: Bemærk hvordan vi kalder nogle funktioner ved at skrive et punktum efter et variabelnavn. Ligesom nogle værdier har variabler du kan tilgå med et punktum (som variablen [code]x[/code] i [code]position.x[/code]), kan de også have deres egne funktioner.
uk: Зверніть увагу, як ми викликаємо деякі функції, пишучи крапку після імені змінної. Так само, як деякі значення мають змінні, до яких можна отримати доступ за допомогою крапки (наприклад, змінна [code]x[/code] в [code]position.x[/code]), вони також можуть мати свої власні функції.

source: Functions like [code]append()[/code] and [code]pop_front()[/code] only exist on arrays. To call them, we need to write the array name, then a dot, then the function: [code]array_name.append()[/code].
da: Funktioner som [code]append()[/code] og [code]pop_front()[/code] findes kun på arrays. For at kalde dem skal vi skrive arraynavnet, derefter et punktum og derefter funktionen: [code]array_name.append()[/code].
uk: Такі функції, як [code]append()[/code] і [code]pop_front()[/code] існують лише для масивів. Ось чому, щоб викликати їх, нам потрібно отримати до нього доступ із масиву за допомогою крапки: [code]array.append()[/code].

source: Let's break down the code. We add orders to the [code]waiting_orders[/code] array by appending them.
da: Lad os gennemgå koden. Vi tilføjer ordrer til [code]waiting_orders[/code] arrayet ved at "appende" dem.
uk: Ми ставимо замовлення в чергу в масиві [code]waiting_orders[/code], додаючи їх до масиву.

source: When we use an array this way, we call it a [i]queue[/i]: the first element we add to the array is the first one we remove. It's like a waiting line at a store.
da: Når vi bruger et array på denne måde, kalder vi det en [i]kø[/i]: det første element, vi tilføjer til arrayet, er det første, vi fjerner. Det er ligesom en ventekø i en butik.
uk: Коли ми використовуємо масив таким чином, ми називаємо його [i]чергою[/i]: перший елемент, який ми додаємо до масиву, є першим, який ми видаляємо. Це як черга в магазині.

source: We write [code]#...[/code] to show that there is more code here. The three dots mean "we are not showing all the code." We use this to break down code examples and make them easier to learn from.
da: Vi skriver [kode]#...[/kode] for at vise, at der er mere kode her. De tre prikker betyder "vi viser ikke al koden." Vi bruger dette til at opdele kodeeksempler og gøre dem nemmere at lære af.
uk: Ми пишемо [code]#...[/code], щоб показати, що тут є ще код. Три крапки означають «ми не показуємо весь код». Ми використовуємо це, щоб розбити приклади коду на частини і полегшити їх вивчення.

source: The hash sign ([code]#[/code]) marks the start of a code comment. It's a line the computer will ignore, which is why it typically appears in grey.
da: Hash-tegnet ([code]#[/code]) markerer starten på en kodekommentar. Det er en linje, som computeren ignorerer, hvilket er grunden til, at den typisk vises med gråt.
uk: Знак решітки ([code]#[/code]) позначає початок коментаря до коду. Це рядок, який комп'ютер ігнорує, тому він зазвичай відображається сірим кольором.

source: Like [code]pop_front()[/code], the function returns the value removed from the array. You will often store that value in a variable. This value could be the crate's content, which you can then use to give resources to the player.
da: Ligesom [code]pop_front()[/code] returnerer funktionen den værdi, der er fjernet fra arrayet. Du gemmer ofte denne værdi i en variabel. Denne værdi kan være kassens indhold, som du derefter kan bruge til at give ressourcer til spilleren.
uk: Як і [code]pop_front()[/code], ця функція повертає значення, видалене з масиву. Зазвичай це значення зберігається у змінній. Це значення може бути вмістом контейнера, який потім можна використовувати для надання ресурсів гравцеві.

source: When we use an array this way, we call it a [i]stack[/i]: the last element we add is the first one we remove. It's like a pile of plates where you take from the top.
da: Når vi bruger et array på denne måde, kalder vi det en [i]stak[/i]: det sidste element, vi tilføjer, er det første, vi fjerner. Det er som en bunke plader, hvor man tager fra toppen.
uk: Коли ми використовуємо масив таким чином, ми називаємо його [i]стеком[/i]: останній елемент, який ми додаємо, є першим, який ми видаляємо. Це як стос тарілок, з якого ви берете зверху.

source: [b]Careful![/b] If you write the while loop incorrectly, you can freeze the program.
da: [b]Pas på![/b] Hvis du skriver while-løkken forkert, kan du fryse programmet.
uk: [b]Будьте обережні![/b] Якщо ви неправильно напишете цикл while, програма може зависнути.

source: You can check if the [code]crates[/code] array still has values by writing [code]while crates:[/code]. This works because an empty array counts as [code]false[/code], and an array with items counts as [code]true[/code].
da: Du kan tjekke om [code]crates[/code]-arrayet stadig har værdier ved at skrive [code]while crates:[/code]. Dette fungerer, fordi et tomt array tæller som [code]false[/code], og et array med elementer tæller som [code]true[/code].
uk: Ви можете перевірити, чи масив [code]crates[/code] все ще містить значення, написавши [code]while crates:[/code]. Це працює, оскільки порожній масив вважається [code]false[/code], а масив з елементами вважається [code]true[/code].

source: In previous lessons, you learned how to create arrays to store lists of values and how to loop over them. It's nice, but you won't go far with only that. The real strength of arrays is that you can add and remove values from them at any time. It allows you to [i]queue[/i] or [i]stack[/i] data.
fr: Dans les leçons précédentes, vous avez appris à créer des tableaux pour stocker des listes de valeurs et à les parcourir en boucle. C'est très bien, mais vous n'irez pas loin avec seulement ça. La vraie force des tableaux est que vous pouvez y ajouter et en supprimer des valeurs à tout moment. Cela vous permet de mettre en [i]file d'attente[/i] ou [i]d'empiler[/i] des données.
it: Nelle lezioni precedenti, hai imparato come si creano gli array per conservare liste di variabili e per ciclarvi attraverso. Fanno comodo, ma non andrai molto lontano solo con questo. La vera forza degli array sta nel fatto che puoi aggiungere rimuovere valori all'interno di questi quando vuoi. Ti permette di [i]accodare[/i] o [i]impilare[/i] dati.
nl: In de vorige lessen heb je geleerd hoe je arrays kunt maken om lijsten met waarden op te slaan en hoe je er doorheen kunt lussen. Dat is leuk, maar met alleen dat kom je niet ver. De echte kracht van arrays is dat je er op elk moment waarden aan toe kunt voegen en uit kunt verwijderen. Hierdoor kun je gegevens in een [i]wachtrij[/i] plaatsen of [i]stapelen[/i].
pt: Nas lições anteriores, aprendeu como criar arrays para armazenar listas de valores e como fazer um loop sobre eles. É útil, mas não vai longe só com isso. A verdadeira força dos arrays é que pode adicionar e remover valores deles a qualquer momento. Permite-lhe [i]enfileirar[/i] ou [i]empilhar[/i] dados.
pt_br: Nas lições anteriores, você aprendeu como criar arrays para armazenar listas de valores e como fazer um loop sobre eles. É útil, mas você não vai longe só com isso. A verdadeira força dos arrays é que você pode adicionar e remover valores deles a qualquer momento. Ele permite você [i]enfileirar[/i] ou [i]empilhar[/i] dados.
tr: Önceki derslerde, değer listelerini saklamak için diziler oluşturmayı ve bunlar üzerinde nasıl döngü yapacağını öğrendin. Bu güzel, ancak sadece bununla çok fazla ileri gidemezsin. Dizilerin gerçek gücü, onlara istediğin zaman değer ekleyip çıkarabilmendir. Bu sayede [i]arkasına ekleme[/i] (queue) veya [i]üstüste yığma[/i] (stack) şeklinde veri ekleyebilirsin.
zh_hans: 在之前的课程中，你学了如何创建数组来存储一系列的值，以及如何循环遍历数组。 数组很棒，但是只会这点皮毛不能帮到你太多。 数组的真正优势在于，可以随时在其中添加或删除值。 允许你对数据进行 [i]queue[/i] （队列）或 [i]stack[/i] （堆栈）操作。

source: You're making a restaurant management game where customers place orders, and you need to handle them as they come. In this game, customers order meals that end up in a queue. You need to prepare them in the kitchen. In this example, we simulate orders arriving and getting completed over time.
fr: Vous créez un jeu de gestion de restaurant où les clients passent des commandes et vous devez les gérer au fur et à mesure qu'elles arrivent. Dans ce jeu, les clients commandent des repas qui se retrouvent dans une file d'attente. Vous devez les préparer dans la cuisine. Dans cet exemple, nous simulons des commandes qui arrivent et qui sont complétées au fil du temps.
it: Stai facendo un gioco gestionale riguardo un ristorante in cui i clienti piazzano degli ordini e tu devi gestirli mano a mano che arrivano. In questo gioco, i clienti ordinano dei pasti che finiscono in una lista d'attesa. Devi prepararli nella cucina. In questo esempio, simuliamo gli ordini che arrivano e che vengono completati con il tempo.
nl: Je maakt een restaurantmanagementspel waarin klanten bestellingen plaatsen en jij ze moet afhandelen. In dit spel bestellen klanten maaltijden die in een wachtrij belanden. Jij moet ze bereiden in de keuken. In dit voorbeeld simuleren we bestellingen die binnenkomen en na verloop van tijd klaar zijn.
pt: Está a fazer um jogo de gestão de restaurante onde os clientes fazem pedidos e precisa lidar com eles à medida que eles chegam. Nesse jogo, os clientes pedem refeições que acabam numa fila. Precisa prepará-las na cozinha. Nesse exemplo, simulamos pedidos chegando e sendo concluídos ao longo do tempo.
pt_br: Você está fazendo um jogo de gerenciamento de restaurante onde os clientes fazem pedidos e você precisa lidar com eles à medida que eles chegam. Nesse jogo, os clientes pedem refeições que acabam em uma fila. Você precisa prepará-las na cozinha. Nesse exemplo, simulamos pedidos chegando e sendo concluídos ao longo do tempo.
tr: Müşterilerin sipariş verdiği bir lokanta yönetimi oyunu yapıyorsun, ve siparişler geldikçe onlarla ilgilenmen gerekiyor. Bu oyunda, müşterilerin verdikleri yemek siparişleri bir sıraya alınıyor. Onları mutfakta hazırlaman gerekiyor. Bu örnekte, zaman içinde gelen ve tamamlanan siparişlerin benzeşimini yapıyoruz (simülasyon).
zh_hans: 假设你正在制作一个餐厅管理游戏，顾客在餐厅下单了食物，你需要在出餐时候送过去。 在这个游戏中，顾客点餐完了会排成长队等待。 你需要在厨房里准备他们的食物。 这个例子中，我们模拟了一种订单模式，按时间推移会出现订单，紧接着会被完成。

source: How do you keep track of pending and completed orders? With an array! When a customer purchases a meal, you want to [i]append[/i] it to the array. Then, as you complete a meal in the kitchen and serve it, you want to remove it from the array. You can do that with the [code]append()[/code] and the [code]pop_front()[/code] functions of the array, respectively. Try to read the code below before moving on. Don't worry if not everything makes sense, as we'll break it all down.
fr: Comment faites-vous le suivi des commandes en attente et terminées ? Avec un tableau ! Lorsqu'un client achète un repas, vous voudriez [i]l'ajouter[/i] au tableau. Ensuite, lorsque vous terminez un repas dans la cuisine et que vous le servez, vous voudriez le supprimer du tableau. Vous pouvez le faire avec les fonctions [code]append()[/code] et [code]pop_front()[/code] du tableau, respectivement. Essayez de lire le code ci-dessous avant de continuer. Ne vous inquiétez pas si tout n'a pas de sens, car nous allons tout décomposer.
it: Come fai a gestire la lista di tutti gli ordini da completare e completati? Con un array! Quando un cliente compra un pasto, lo vuoi [i]accodare[/i] all'array. Dopo, man mano che completi un pasto in cucina e lo servi, lo vuoi rimuovere dall'array. Puoi fare ciò con le funzioni per array [code]append()[/code] e [code]pop_front()[/code], rispettivamente. Prova a leggere il codice qua sotto prima di andare avanti. Non ti preoccupare se qualcosa non la riesci a capire, tratteremo tutto in questa lezione.
nl: Hoe houd je wachtende en afgehandelde bestellingen bij? Met een array! Wanneer een klant een maaltijd koopt, wil je deze [i]toevoegen[/i] aan de array. Vervolgens, wanneer je een maaltijd voltooit in de keuken en serveert, wil je deze verwijderen uit de array. Je kunt dat doen met respectievelijk de functies [code]append()[/code] en [code]pop_front()[/code] van de array. Probeer de onderstaande code te lezen voordat je verder gaat. Maak je geen zorgen als niet alles duidelijk is, want we zullen het allemaal uitleggen.
pt: Como controla os pedidos pendentes e concluídos? Com um array! Quando um cliente compra uma refeição, você deseja [i]adiciona-la[/i] no array. Então, ao completar uma refeição na cozinha e servi-la, deseja removê-la do array. Pode fazer isso com as funções [code]append()[/code] e [code]pop_front()[/code] do array, respectivamente. Tente ler o código abaixo antes de prosseguir. Não se preocupe se nem tudo fizer sentido, porque vamos entrar em detalhes para explicar.
pt_br: Como você acompanha os pedidos pendentes e concluídos? Com um array! Quando um cliente compra uma refeição, você deseja [i]adiciona-la[/i] no array. Então, ao completar uma refeição na cozinha e servi-la, você deseja removê-la do array. Você pode fazer isso com as funções [code]append()[/code] e [code]pop_front()[/code] do array, respectivamente. Tente ler o código abaixo antes de prosseguir. Não se preocupe se nem tudo fizer sentido, porque vamos entrar em detalhes para explicar.
tr: Bekleyen ve tamamlanan siparişleri nasıl takip edersin? Bir dizi ile! Bir müşteri bir yemek satın aldığında, yemeği diziye [i]eklemek[/i] istersin. Daha sonra, mutfakta bir yemeği tamamlayıp servis edince, onu diziden [i]çıkarmak[/i] istersin. Bunu sırasıyla dizinin [code]append()[/code] (arkaya_ekle) ve [code]pop_front()[/code] (çıkart_baştaki) fonksiyonları ile yapabilirsin. Devam etmeden önce aşağıdaki kodu okumaya çalış. Her şey mantıklı gelmiyorsa endişelenme, çünkü hepsini açıklayacağız.
zh_hans: 该怎样跟踪待处理和已完成的订单？用上数组！ 当客户购买餐点时，你得将它 [i]追加[/i] 到数组中（append）。 然后，当你在厨房完成一餐并出餐时，需要将其从数组中移除。 你可以分别使用数组的 [code]append()[/code] （列尾追加）和 [code]pop_front()[/code]（首格出列）函数来做到这一点。 在继续之前，先试试看阅读下面的代码。 如果不能一下就看懂，请不要担心，因为我们会分开讲解。

source: Notice how we call some functions by writing a dot after a variable name. Like a given value type can have sub-variables, it can also have its own functions. Functions like [code]append()[/code] and [code]pop_front()[/code] only exist on arrays. That's why to call them, we need to access it from the array using the dot: [code]array.append()[/code].
fr: Remarquez comment nous appelons certaines fonctions en écrivant un point après le nom d'une variable. Comme un type de valeur donné peut avoir des sous-variables, il peut aussi avoir ses propres fonctions. Des fonctions comme [code]append()[/code] et [code]pop_front()[/code] n'existent que sur les tableaux. C'est pourquoi pour les appeler, nous devons y accéder depuis le tableau en utilisant le point : [code]array.append()[/code].
it: Osserva come chiamiamo delle funzioni inserendo un punto dopo il nome della variabile. Come un particolare tipo di variabile può avere delle sotto-variabili, può anche avere le sue funzioni. Le funzioni come [code]append()[/code] e [code]pop_front()[/code] esistono soltanto sugli array. Questo è il motivo per cui, per chiamarle dobbiamo inserire un punto davanti l'array: [code]array.append()[/code].
nl: Merk op hoe we sommige functies aanroepen door een punt achter een variabelennaam te schrijven. Zoals een gegeven waardentype deelvariabelen kan hebben, kan het ook zijn eigen functies hebben. Functies zoals [code]append()[/code] en [code]pop_front()[/code] bestaan alleen bij arrays. Daarom moeten we, om ze aan te roepen, de punt gebruiken: [code]array.append()[/code].
pt: Observe como chamamos algumas funções escrevendo um ponto final após o nome de uma variável. Assim como um determinado tipo de valor pode ter sub-variáveis, um array também pode ter funções próprias. Funções como [code]append()[/code] e [code]pop_front()[/code] só existem em arrays. É por isso que para chamá-las, precisamos acessá-las no array usando o ponto final: [code]array.append()[/code].
pt_br: Observe como chamamos algumas funções escrevendo um ponto final após o nome de uma variável. Assim como um determinado tipo de valor pode ter sub-variáveis, um array também pode ter suas próprias funções. Funções como [code]append()[/code] e [code]pop_front()[/code] só existem em arrays. É por isso que para chamá-las, precisamos acessá-las no array usando o ponto final: [code]array.append()[/code].
tr: Farkettiysen bazı fonksiyonları, değişken adından sonra nokta yazarak çağırıyoruz. Belirli bir değer tipinin alt-değişkenleri olabileceği gibi, kendi fonksiyonları da olabilir. [code]append()[/code] ve [code]pop_front()[/code] gibi fonksiyonlar sadece diziler üzerinde mevcuttur. Bu yüzden, onları çağırmak için nokta kullanarak dizi üzeriden erişmemiz gerekir: [code]array.append()[/code].
zh_hans: 注意，在变量名后写一个点可以调用一些函数。 就像给定的值类型可以有子变量一样，它也可以有自己的函数。 [code]append()[/code] 和 [code]pop_front()[/code] 之类的函数只存在于数组中。 调用它们就是为了处理数组，我们得用点才能从数组中访问到：[code]array.append()[/code]。

source: Let's break down the code. We queue orders in the [code]waiting_orders[/code] array by appending them to the array.
fr: Décomposons le code. Nous mettons les commandes en file d'attente dans le tableau [code]waiting_orders[/code] en les ajoutant au tableau.
it: Analizziamo un po' il codice. Accodiamo gli ordini nell'array [code]waiting_orders[/code] aggiungendoli all'array.
nl: Laten we de code ontleden. We plaatsen orders in de wachtrij in de array [code]waiting_orders[/code] door ze toe te voegen aan de array.
pt: Vamos analisar em detalhes o código. Enfileiramos pedidos no array [code]waiting_orders[/code] anexando os pedidos nele.
pt_br: Vamos analisar em detalhes o código. Enfileiramos pedidos no array [code]waiting_orders[/code] anexando os pedidos nele.
tr: Hadi kodu parçalarına ayıralım. Siparişleri [code]waiting_orders[/code] (bekleniyor_sipariş) dizisine ekleyerek sıraya koyuyoruz.
zh_hans: 让我们来一步步分解代码。 我们让订单在 [code]waiting_orders[/code] （候餐）数组中排好队，用到了“追加（append）到数组”的方式。

source: We write [code]#...[/code] to represent ellipses in the code. It means "we're completing the function's code." We use that to break down code examples and make them easier to learn from. The hash sign itself marks the start of a code comment. It's a line the computer will ignore, which is why it typically appears in grey.
fr: Nous écrivons [code]#...[/code] pour représenter des ellipses dans le code. Cela signifie « nous sommes en train de compléter le code de la fonction ». Nous utilisons cela pour décomposer les exemples de code et les rendre plus faciles à apprendre. Le signe dièse lui-même marque le début d'un commentaire de code. C'est une ligne que l'ordinateur ignorera, c'est pourquoi elle apparaît généralement en gris.
it: Scriviamo [code]#...[/code] per rappresentare dei punti di sospensione. Significa "stiamo completando il codice della funzione". Lo usiamo per spiegare gli esempi di codice e per renderli più facili da comprendere. Il simbolo di hash segnala l'inizio di una riga commentata. Questa è una riga che il computer ignorerà, questo è il motivo per cui tipicamente viene colorata in grigio.
nl: We schrijven [code]#...[/code] om weglatingen in de code weer te geven. Het betekent "we vullen de code van de functie aan". We gebruiken dat om codevoorbeelden op te splitsen en het makkelijker te maken om ervan te leren. Het hekje zelf markeert het begin van codecommentaar. Het is een regel die de computer zal negeren, daarom wordt deze meestal grijs weergegeven.
pt: Escrevemos [code]#...[/code] para representar elipses no código. Significa "estamos a completar o código da função". Usamos isso para detalhar exemplos de código e torná-los mais fáceis de aprender. O próprio sinal de hash (jogo da velha) marca o início de um comentário de código. É uma linha que o computador vai ignorar e é por isso que normalmente aparece em cinzento.
pt_br: Escrevemos [code]#...[/code] para representar elipses no código. Significa "estamos completando o código da função". Usamos isso para detalhar exemplos de código e torná-los mais fáceis de aprender. O próprio sinal de hash (jogo da velha) marca o início de um comentário de código. É uma linha que o computador vai ignorar, e é por isso que normalmente aparece em cinza.
tr: Koddaki boşlukları temsil etmek için [code]#...[/code] yazıyoruz. Bu, "fonksiyonun kodunu tamamlıyoruz" anlamına gelir. Bunu kod örneklerini parçalamak ve öğrenmeyi kolaylaştırmak için kullanırız. (burada, daha önce verdiğimiz parçaya eklemek yapıyoruz). Kare işaretinin kendisi, bir kod yorumunun başlangıcını işaret eder. Bilgisayarın görmezden geleceği bir satırdır, bu yüzden genellikle gri renkte görünür.
zh_hans: 我们用 [code]#...[/code] 来表示代码中的省略部分。 代表“假设这块函数的功能是写完了的”。 用它来分解代码示例，更便于学习。 #井号本身标志着“代码注释”的开始。 #号后面一整行会被计算机忽略，这就是它通常显示为灰色的原因。
