Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-7-member-variables.po
Languages: hu, it, ja, pl, pt, tr, zh_hans

source: This may be confusing if you only saw the y-axis pointing up in math classes. However, in math, axes go in any direction. They don't even have to be perpendicular. On the computer, the position (0, 0) happens to correspond to the top-left of your computer screen. It then makes sense for coordinates to be positive when going towards the bottom-right corner. This leads to another question: why is position zero the top left of the screen? This is due to computer and TV displays history: they would calculate and display pixels starting from the top left corner and moving towards the bottom right corner.
hu: Ez kicsit zavaró lehet, ha csak felfelé mutató Y tengelyt láttál matek órán. Azonban a matekban a tengelyek bármilyen irányba mutathatnak. Még csak merőlegesnek sem kell lenniük. A számítógépen, a (0, 0) pozíció a monitor bal felső sarkára esik. Így már értelmet nyer miért pozitívak az értékek, ahogy haladunk a jobb alsó sarok felé. Ez azonban felvet egy másik kérdést: miért van a kezdőpont a bal felső sarokban? Ennek a megoldása a TV-k és monitorok működésében rejlik: a pixelek a bal felső saroktól számoljál és kezdik el kirajzolni, onnan haladva a jobb alsó sarok felé..
it: Questo potrebbe essere confusionario se avessi visto, in matematica, l'asse y andare solo verso l'alto. Tuttavia, in matematica, le assi vanno in ogni direzione. Non devono neanche essere perpendicolari. Sul computer, la posizione (0, 0) corrisponde all'angolo in alto a sinistra sul tuo schermo. Ha dunque senso per le coordinate di essere positive andando verso l'angolo in basso a destra. Questo scaturisce un'altra domanda: perchè la posizione iniziale è l'angolo in alto a sinistra? Questo è dovuto alla storia dei computer e degli schermi TV: all'inizio calcolavano e mostravano i pixel a partire dall'angolo in alto a sinistra muovendosi verso la posizione in basso a destra.
ja: 数学の授業で Y 軸が上を向いていることしか見たことがない場合は、混乱するかもしれません。 ただし、数学では軸は任意の方向に進みます。 垂直である必要さえありません。 コンピューターでは、位置 (0, 0) はコンピューター画面の左上に対応します。 したがって、右下隅に向かうときに座標が正になるのは理にかなっています。 これにより、別の疑問が生じます。なぜ位置 0 が画面の左上なのか? これは、コンピュータとテレビのディスプレイの歴史によるものです。コンピュータやテレビでは、左上隅から右下隅に向かってピクセルが計算されて表示されます。
pl: Może być to dla ciebie mylące, gdyż oś y na lekcjach matematyki jest skierowana w górę. Jednak w samej matematyce osie mogą iść w dowolnym kierunku. Nie muszą nawet być prostopadłe. Na komputerze pozycja (0, 0) odpowiada lewemu górnemu rogu ekranu. Przez to sensownym jest, żeby współrzędne były dodatnie podczas przechodzenia w prawy dolny róg. To prowadzi do kolejnego pytania: dlaczego pozycja zero znajduje się w lewym górnym rogu ekranu? Wynika to z historii wyświetlaczy komputerowych i telewizyjnych: obliczały one i wyświetlały piksele, zaczynając od lewego górnego rogu i przesuwając się w kierunku prawego dolnego rogu.
pt: Isso pode ser confuso se só viu o eixo y apontando para cima nas aulas de matemática. No entanto, em matemática, os eixos vão em qualquer direção. Eles nem precisam ser perpendiculares. No computador, a posição (0, 0) corresponde ao canto superior esquerdo do seu monitor. Então, faz sentido que as coordenadas sejam positivas ao ir para o canto inferior direito. Isso nos leva a outra pergunta: por que a posição zero é o canto superior esquerdo do ecrã? Isso se deve a história de como eram feitos os monitores e as TVs: eles calculam e exibem pixels começando no canto superior esquerdo e se move em direção ao canto inferior direito.
tr: Eğer matematik derslerinde y-ekseninin sadece yukarı baktığını gördüyseniz, bu size kafa karıştırıcı gelebilir. Ancak, matematikte, eksenler herhangi bir yöne gidebilir. Hatta birbirine dik olmaları bile gerekmez. Bilgisayarda, (0, 0) konumu, bilgisayar ekranının sol üst köşesine karşılık gelir. Bu yüzden sağ alt köşeye doğru giderken koordinatların pozitif olması mantıklıdır. Bu da başka bir soruya yol açmaktadır: sıfır konumu neden ekranın sol üst köşesidir? Bunun nedeni bilgisayar ve TV ekranlarının geçmişidir: piksellerin hesabını, sol üst köşeden başlayarak sağ alt köşeye doğru yaparlardı.
zh_hans: 如果您只在数学课上看到 y 轴指向上方，这可能会令人困惑。 但是，在数学中，轴可以朝任何方向移动。 它们甚至不必垂直。 在计算机上，位置 (0, 0) 恰好对应于计算机屏幕的左上角。 然后，当朝向右下角时，坐标为正是有意义的。 这就引出了另一个问题：为什么屏幕左上角的位置为零？ 这是由于计算机和电视显示历史：它们会计算并显示从左上角开始向右下角移动的像素。

source: Let's look at one last example before moving on to the practice. The following code makes the character 1.5 times its starting size.
hu: Nézzünk még egy utolsó példát, mielőtt rátérnénk a gyakorlatra. Az alábbi kódot a játékost az eredeti méretének 1.5-szeresére növeli.
it: Vediamo un ultimo esempio prima di andare a fare pratica. Il seguente codice rende il personaggio 1.5 volte la sua dimensione iniziale.
ja: 実践に移る前に、最後の例を見てみましょう。 次のコードは、文字を開始時のサイズの 1.5 倍にします。
pl: Rzućmy okiem jeszcze na ostatni przykład, nim przejdziemy do ćwiczeń. Poniższy kod sprawia, że postać staje się 1,5 raza większa od swojego początkowego rozmiaru.
pt: Vamos ver um último exemplo antes de passar à prática. O código a seguir faz a personagem ficar 1,5 vezes maior do que o tamanho inicial dele.
tr: Alıştırmaya geçmeden önce son bir örneğe bakalım. Aşağıdaki kod, karakteri, başlangıç boyutunun 1.5 katı yapar.
zh_hans: 在继续练习之前，让我们看最后一个例子。 以下代码使字符成为其起始大小的 1.5 倍。

source: How do you access sub-variables?
hu: Hogyan éred el az alváltozókat?
it: Come accedi alle sotto-variabili?
ja: サブ変数にはどのようにアクセスしますか?
pl: Jak uzyskać dostęp do zmiennych podrzędnych?
pt: Como acessa sub-variáveis?
tr: Alt değişkenlere nasıl erişirsiniz?
zh_hans: 你如何访问子变量？

source: Variables often hold sub-values, like the [code]position[/code] has two sub-variables: [code]x[/code] and [code]y[/code]. How would you access the [code]x[/code], for example?
hu: A változóknak gyakran vannak alváltozói, például a [code]position[/code]-nek 2 alváltozója van: [code]x[/code] és [code]y[/code]. Hogyan érnéd el például az [code]x[/code]-et?
it: Spesso le variabili contengono sotto-valori, come la [code]position[/code] ha le due sotto-variabili: [code]x[/code] e [code]y[/code]. Come accederesti alla sotto-variabile [code]x[/code], per esempio?
ja: 変数は、 [code]position[/code] が [code]x[/code] と [code]y[/code] の 2 つのサブ変数を持つように、サブ値を保持することがよくあります。たとえば、[code]x[/code]にどのようにアクセスしますか?
pl: Zmienne często przechowują wartości podrzędne, na przykład [code]position[/code] zawiera w sobie dwie podzmienne: [code]x[/code] i [code]y[/code]. W jaki sposób możesz uzyskać dostęp do na przykład [code]x[/code]?
pt: As variáveis geralmente contêm sub-valores, igual a variável [code]position[/code] que tem duas sub-variáveis: [code]x[/code] e [code]y[/code]. Como acessaria a sub-variável [code]x[/code], por exemplo?
tr: Değişkenler genellikle alt-değerleri tutarlar, örneğin konumun, [code]position[/code], iki alt-değişkeni vardır: [code]x[/code] ve [code]y[/code]. Mesela, [code]x[/code] değişkenine nasıl erişirdiniz?
zh_hans: 变量通常包含子值，例如 [code]position[/code] 有两个子变量：[code]x[/code] 和 [code]y[/code]。 例如，您将如何访问 [code]x[/code]？

source: To access a sub-variable, you need to write a dot between the parent variable name and the sub-variable name. For example, to access the [code]x[/code] sub-variable of the [code]position[/code] variable, you'll write [code]position.x[/code].
hu: Ahhoz, hogy elérj egy alváltozót, egy pontot kell tenned a változó és az alváltozó közé.. Például, ahhoz, hogy elérd az [code]x[/code] alváltozóját a[code]position[/code] változónak, azt írod, hogy: [code]position.x[/code].
it: Per accedere ad una sotto-variabile, devi inserire un punto tra il nome della variabile parente e il nome della sotto-variabile. Per esempio, per accedere alla sotto-variabile [code]x[/code] della variabile [code]position[/code], scriverai [code]position.x[/code].
ja: サブ変数にアクセスするには、親変数名とサブ変数名の間にドットを書き込む必要があります。 たとえば、[code]position[/code] 変数の [code]x[/code] サブ変数にアクセスするには、[code]position.x[/code] と記述します。
pl: Aby uzyskać dostęp do podzmiennej, musisz wpisać kropkę między nazwą zmiennej nadrzędnej a nazwą podzmiennej. Na przykład, aby uzyskać dostęp do zmiennej podrzędnej [code]x[/code] należącej do zmiennej [code]position[/code], napiszesz [code]position.x[/code].
pt: Para acessar uma sub-variável, precisa escrever um ponto final entre o nome da variável pai e o nome da sub-variável. Por exemplo, para acessar a sub-variável [code]x[/code] da variável [code]position[/code], vai escrever [code]position.x[/code].
tr: Bir alt-değişkene erişmek için, ana değişkenin ismi ile alt-değişkenin ismi arasına bir nokta koymanız gerekir. Örneğin, [code]position[/code] değişkeninin [code]x[/code] alt-değişkenine erişmek için, [code]position.x[/code] yazacaksınız.
zh_hans: 要访问子变量，您需要在父变量名称和子变量名称之间写一个点。 例如，要访问 [code]position[/code] 变量的 [code]x[/code] 子变量，您将编写 [code]position.x[/code]。

source: You write a dot (".") between the variable and the sub-variable name.
hu: Írsz egy pontot (".") a változó és az alváltozó közé.
it: Scrivi un punto (".") tra la variabile e il nome della sotto-variabile.
ja: 変数とサブ変数名の間にドット (".") を書き込みます。
pl: Wpisując kropkę („.”) pomiędzy nazwą zmiennej a podzmiennej.
pt: Escreve um ponto final (".") entre a variável e o nome da sub-variável.
tr: Değişken ve alt-değişken ismi arasına bir nokta (".") yazarsınız.
zh_hans: 您在变量和子变量名称之间写一个点（“.”）。

source: You write an arrow ("->") between the variable and the sub-variable name.
hu: Írsz egy nyilat ("->") a változó és az alváltozó közé.
it: Scrivi una freccia ("->") tra la variabile e il nome della sotto-variabile.
ja: 変数とサブ変数名の間に矢印 ("->") を書き込みます。
pl: Wpisując strzałkę („->”) pomiędzy nazwą zmiennej a podzmiennej.
pt: Escreve uma seta ("->") entre a variável e o nome da sub-variável.
tr: Değişken ile alt-değişken ismi arasına bir ok ("->") yazarsınız.
zh_hans: 在变量和子变量名称之间写一个箭头（“->”）。

source: You write a slash ("/") between the variable and the sub-variable name.
hu: Írsz egy per jelet ("/") a változó és az alváltozó közé.
it: Scrivi uno slash ("/") tra la variabile e il nome della sotto-variabile.
ja: 変数とサブ変数名の間にスラッシュ ("/") を書き込みます。
pl: Wpisując ukośnik („/”) pomiędzy nazwą zmiennej a podzmiennej.
pt: Escreve uma barra ("/") entre a variável e o nome da sub-variável.
tr: Değişken ve alt-değişken ismi arasına bir eğik çizgi ("/") yazarsınız.
zh_hans: 在变量和子变量名称之间写一个斜杠（“/”）。

source: In a future lesson, we'll explain why and how those variables have sub-variables. For now, just know you can use the dot to access them. We'll tell you which variables have sub-components and what their names are. In the next lessons, you'll create your own variables and do operations on them to add or remove [code]score[/code], [code]health[/code], you name it. For now, let's practice accessing variables.
hu: Egy későbbi leckében kitérünk rá, hogyan és miért vannak alváltozói ezeknek a változóknak. Egyelőre legyen elég annyi, hogy a ponttal éred el őket. Megtanítjuk. hogy mely változóknak vannak alváltozóik és azoknak mi a neve. A következő leckékben, elkészíted majd a saját változóid és műveleteket hajtassz végre rajtuk, hogy növeld vagy csökkentsd a [code]score[/code], [code]health[/code], vagy bármi más értékét. Egyelőre gyakoroljuk a változók elérését..
it: In una lezione futura, spiegheremo perchè e come quelle variabili possiedono sotto-variabili. Per ora, sappi soltanto che puoi usare il punto per accedervi. Ti diremo quali variabili possiedono sotto-componenti e quali sono i loro nomi successivamente. Nelle prossimi lezioni, creerai le tue variabili e farai operazioni su queste per aggiungere o rimuovere [code]punteggio[/code], [code]vita[/code] e così via. Per ora, facciamo pratica accedendo a delle variabili.
ja: 今後のレッスンでは、これらの変数にサブ変数がある理由と方法について説明します。 今のところ、ドットを使用してそれらにアクセスできることを知っておいてください。 どの変数にサブコンポーネントがあり、その名前が何であるかを説明します。 次のレッスンでは、独自の変数を作成し、それらに対して操作を実行して、[code]score[/code]、[code]health[/code]などを追加または削除します。 とりあえず、変数へのアクセスを練習しましょう。
pl: W przyszłych lekcjach wyjaśnimy, dlaczego i w jaki sposób te zmienne mają swoje podzmienne. Na razie po prostu miej świadomość, że możesz użyć kropki, aby uzyskać do nich dostęp. Powiemy ci, które zmienne mają podkomponenty i jakie są ich nazwy. W następnych lekcjach utworzysz własne zmienne i wykonasz na nich operacje, aby dodać lub usunąć [code]score[/code] (wynik), [code]health[/code] (zdrowie), czy wartość dowolnie nazwanych przez siebie zmiennych. Na ten moment przećwiczmy jednak uzyskiwanie dostępu do zmiennych.
pt: Numa lição futura, vamos explicar por que e como essas variáveis têm sub-variáveis. Por enquanto, apenas saiba que pode usar o ponto final para acessá-las. Vamos dizer-lhe quais variáveis têm subcomponentes e quais são os nomes deles. Nas próximas lições, vai criar as suas próprias variáveis e vai fazer operações nelas para adicionar ou remover coisas como: [code]score[/code] (pontos), [code]health[/code] (vida) ou qualquer outra coisa. Por enquanto, vamos praticar o acesso a variáveis.
tr: İleri bir derste, bu değişkenlerin neden ve nasıl alt-değişkenlere sahip olduğunu açıklayacağız. Şimdilik, onlara erişmek için noktayı kullanabileceğini bilseniz yeter. Hangi değişkenlerin alt-bileşenleri olduğunu ve bunların isimlerinin ne olduğunu size söyleyeceğiz. Sonraki derslerde, kendi değişkenlerinizi oluşturacak, ve [code]score[/code] (puan), [code]health[/code] (sağlık) değerleri eklemek veya kaldırmak için üzerlerinde işlemler yapacaksınız. Şimdilik, hadi değişkenlere erişme alıştırması yapalım.
zh_hans: 在以后的课程中，我们将解释这些变量为什么以及如何具有子变量。 现在，只知道您可以使用点来访问它们。 我们将告诉您哪些变量具有子组件以及它们的名称。 在接下来的课程中，您将创建自己的变量并对它们进行操作以添加或删除 [code]score[/code]、[code]health[/code]，您可以命名它。 现在，让我们练习访问变量。

source: Draw a rectangle at a precise position
hu: Rajzolj egy téglalapot az adott pozíción
it: Disegna un rettangolo in una posizione precisa
ja: 正確な位置に矩形を描画する
pl: Narysuj prostokąt o dokładnej pozycji
pt: Desenhe um retângulo numa posição precisa
tr: Kesin bir konuma bir dikdörtgen çizin
zh_hans: 在精确位置绘制一个矩形

source: Draw a rectangle of 200 by 120 pixels at the X position of 120 pixels and Y position of 100 pixels. You need to replace the numbers in the code editor to draw the correct rectangle.
hu: Rajzolj egy 200 piel széles, 120 pixel magas téglalpot, a 120 X és 100 Y pozíciónál. Át kell írnod a változókat a példában, hogy a megfelelő téglalapot rajzold ki.
it: Disegna un rettangolo di 200 x 120 pixel alla posizione x di 120 pixel e alla posizione y di 100 pixel. Devi rimpiazzare i numeri nell'editor di codice per disegnare il rettangolo corretto.
ja: X 位置 120 ピクセル、Y 位置 100 ピクセルに 200 x 120 ピクセルの四角形を描画します。 正しい四角形を描画するには、コード エディターで数値を置き換える必要があります。
pl: Narysuj prostokąt o wielkości 200 na 120 pikseli w pozycji X 120 pikseli i Y 100 pikseli. Aby narysować poprawny prostokąt, musisz odpowiednio zmienić liczby przypisane w edytorze kodu.
pt: Desenhe um retângulo de 200 pixels de comprimento por 120 pixels de altura na posição X de 120 pixels e na posição Y de 100 pixels. Precisa substituir os números no editor de código para desenhar o retângulo correto.
tr: X konumu 120 piksel ve Y konumu 100 piksel olan, 200'e 120 boyutlarında bir dikdörtgen çiziz. Doğru dikdörtgeni çizmek için, sayıları kod düzenleyicide yerleştirmeniz gerekiyor.
zh_hans: 在 120 像素的 X 位置和 100 像素的 Y 位置绘制一个 200 x 120 像素的矩形。 您需要替换代码编辑器中的数字以绘制正确的矩形。

source: Use the position member variable and its sub-variables to change the rectangle's position.
hu: Használd a position member változót és alváltozóit, hogy megváltoztasd a téglalap pozícióját.
it: Usa la variabile membro position e le sue sotto-variabili per cambiare la posizione del rettangolo.
ja: position メンバー変数とそのサブ変数を使用して、四角形の位置を変更します。
pl: Użyj zmiennej składowej odpowiadającej za pozycję i jej zmiennych podrzędnych, aby zmienić położenie prostokąta.
pt: Use a variável membro "position" e as sub-variáveis deles para alterar a posição do retângulo.
tr: Dikdörtgenin konumunu değiştirmek için, "position" üye değişkeni ile onun alt değişkenlerini kullanın.
zh_hans: 使用 position 成员变量及其子变量来改变矩形的位置。

source: Draw squares at different positions
hu: Rajzolj téglalapokat különböző helyekre
it: Disegna quadrati a posizioni differenti
ja: さまざまな位置に正方形を描画する
pt: Desenhe quadrados em diferentes posições
tr: Farklı konumlarda kareler çizin
zh_hans: 在不同位置绘制多个矩形

source: Draw three squares of size 100 by 100 that are 100 pixels apart on the horizontal axis. In other words, there should be a 100-pixel gap between two squares. You should draw the squares starting at the position (100, 100). This means you should position the first square at 100 on the X axis and 100 on the Y axis. Remember you need to use the equal sign ([code]=[/code]) to change the value of a variable, like the turtle's position. Write your code inside the [code]run()[/code] function so the computer can recognize it. Use the provided [code]draw_rectangle()[/code] function to draw each square.
it: Disegna tre quadrati di dimensioni 100 x 100 distanti 100 pixel sull'asse orizzontale. In altre parole, deve esserci uno spazio di 100 pixel tra due quadrati. I quadrati devono essere disegnati a partire dalla posizione (100, 100). Ciò significa che si deve posizionare il primo quadrato a 100 sull'asse X e a 100 sull'asse Y. Ricordate che dovete usare il segno di uguale ([code]=[/code]) per cambiare il valore di una variabile, come la posizione della tartaruga. Scrivete il codice all'interno della funzione [code]run()[/code] in modo che il computer possa riconoscerlo. Utilizzate la funzione [code]draw_rectangle()[/code] per disegnare ogni quadrato.
ja: 水平軸上に 100 ピクセル間隔でサイズが 100 x 100 の正方形を 3 つ描画します。つまり、2 つの正方形の間に 100 ピクセルのギャップが必要です。 位置 (100, 100) から正方形を描画する必要があります。つまり、最初の正方形を X 軸に 100、Y 軸に 100 を配置する必要があります。 カメの位置など、変数の値を変更するには等号([code]=[/code])を使用する必要があることを忘れないでください。 [code]run()[/code]関数内にコードを記述して、コンピューターが認識できるようにします。 提供されている[code]draw_rectangle()[/code]関数を使用して、各正方形を描画します。
tr: Yatay eksende (X ekseni) 100 piksel aralıkla, 100'e 100 boyutunda üç kare çizin. Başka bir deyişle, iki kare arasında 100 piksellik bir boşluk olmalıdır. Kareleri, (100, 100) konumundan (position) başlayarak çizmelisiniz. Bunun anlamı, ilk kareyi, X ekseninde 100 ve Y ekseninde 100 konumuna koymalısınız. Kaplumbağanın konumu gibi bir değişkenin değerini değiştirmek için, eşittir işaretini ([code]=[/code]) kullanmanız gerektiğini unutmayın. Bilgisayarın tanıyabilmesi için, kodunuzu, [code]run()[/code] fonksiyonu içine yazın. Her bir kareyi çizmek için, size verdiğimiz [code]draw_rectangle()[/code] fonksiyonunu kullanın.

source: Now you can place and draw one shape, but how about drawing several? In this practice, you'll place three squares side by side to really get the hang of properties.
hu: Már el tudsz helyezni és ki tudsz rajzolni egy formát, de mi lenne, ha többet is rajzolnál? Ebben a gyakorlatban, három négyzetet fogsz egymás mellé helyezni, hogy igazán ráérezz a változókra.
it: Ora puoi piazzare e disegnare una figura, ma ché ne pensi di disegnarne diverse? In questa pratica, piazzerai tre quadrati uno a fianco all'altro per prendere bene la mano con le proprietà.
ja: これで 1 つの図形を配置して描画できますが、複数描画するのはどうでしょうか。この演習では、3 つの正方形を並べて配置し、プロパティのコツをつかみます。
pt: Agora pode pôr e desenhar uma forma, mas que tal desenhar várias? Neste exercício, pôrá três quadrados lado a lado para realmente compreender o jeito de propriedades.
tr: Şimdi bir şekli konumlandırabilir ve çizebilirsiniz, peki ya birkaç tane çizmeye ne dersiniz? Bu alıştırmada, özellikleri gerçekten kavramak için üç kareyi yan yana yerleştireceksiniz.
zh_hans: 现在你可以放置和绘制一个矩形，但如何放置几个呢？在这一练习中，你将并排放置三个矩形来真正掌握属性的使用。

source: Introduction to Member Variables
hu: Bevezetés a member változók használatába
it: Introduzione alle Variabili Membro
ja: メンバー変数の概要
pl: Wprowadzenie do zmiennych składowych
pt: Introdução às variáveis membro
tr: Üye Değişkenlere Giriş
zh_hans: 成员变量简介

source: Note that in games, assuming your character's position starts at (0, 0), the code above moves the entity [code]200[/code] pixels to the right and [code]250[/code] pixels down. In math, the y-axis is generally positive going up by convention. The convention is the [i]opposite[/i] in video games and many computer applications: the y-axis is positive going down.
ja: ゲームでは、キャラクターの位置が (0, 0) から始まると仮定すると、上記のコードはエンティティを [code]200[/code] ピクセル右に、[code]250[/code] ピクセル下に移動します。 数学では、慣例により、y 軸は一般に正の値になります。 ビデオ ゲームや多くのコンピューター アプリケーションでは、この規則は[i]逆[/i]です。y 軸は下に行くほど正になります。
tr: Dikkat ederseniz oyunlarda, karakterinin (0, 0) konumundan başladığını varsayarsak, yukarıdaki kod onu [code]180[/code] piksel sağa ve [code]120[/code] piksel aşağıya taşıyor. Matematikte, genelde, y-ekseni yukarı doğru pozitif artacak şekildedir. Video oyunlarında ve birçok bilgisayar uygulamasında bunun [i]tam tersi[/i] geçerlidir: y-ekseni aşağıya doğru pozitif artar.

source: In video games, you will see many member variables that have sub-values. For example, the [code]position[/code] we mentioned has two coordinates: [code]x[/code] and [code]y[/code]. It's the same for the [code]scale[/code]: it has [code]x[/code] and [code]y[/code] sub-variables. They respectively control the horizontal and vertical size of the game entity. To access those X and Y sub-components, you add a dot (".") after the variable name. The code below places the entity at [code]180[/code] pixels on the x-axis and [code]120[/code] pixels on the y-axis.
hu: A játékokban sok olyan változóval találkozol mely rendelkezik alváltozókkal is. Például a [code]position[/code], amiről már beszéltünk két koordinátával rendelkezik: [code]x[/code] és [code]y[/code]. Ugyanez igaz a [code]scale[/code]-re is: ennek is [code]x[/code] és [code]y[/code] alváltozói vannak. Ezek befojásolják a dolog vízszintes és függőleges méretét. Ahhoz, hogy elérd ezt az X és Y komponenst, egy pontot (".") kell írnod a változó neve után. Az alábbi kód az X tengelyen [code]180[/code] pixelhez, az Y tengelyen pedig [code]120[/code] pixelhez helyezi az adott dolgot.
pt: Nos jogos, vai ver muitas variáveis membro que possuem sub-valores. Por exemplo, a [code]position[/code] que mencionamos tem duas coordenadas: [code]x[/code] e [code]y[/code]. É o mesmo para a [code]scale[/code]: tem as sub-variáveis [code]x[/code] e [code]y[/code]. Elas controlam respectivamente o tamanho horizontal e vertical da entidade do jogo. Para acessar esses subcomponentes X e Y, adicione um ponto final (".") após o nome da variável. O código abaixo coloca a entidade em [code]180[/code] pixels no eixo x e [code]120[/code] pixels no eixo y.
