Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-5-your-first-function.po
Languages: hu, it, ja, nl, pl, ru, sv, tr, zh_hans

source: Function identifiers cannot contain spaces. In general, names in programming languages cannot contain spaces. The computer uses spaces to detect the separation between different keywords and identifiers. Instead of spaces, in GDScript, we use underscores ("_"). You saw this already with functions like [code]move_forward()[/code] or [code]move_local_x()[/code]. This is the convention we follow in GDScript. There's another convention programmers use in some other programming languages. Instead of using underscores, they start words with capital letters except for the first one. With that convention, you'd write function names like [code]moveForward()[/code] or [code]moveLocalX()[/code] Identifiers also [i]have[/i] to start with a letter or an underscore; You [i]can't[/i] begin with a number, but you can use numbers after the first character.
it: Gli identificatori delle funzioni non possono contenere spazi. In generale, i nomi nei linguaggi di programmazione non possono contenere spazi. Il computer usa gli spazi per identificare la separazione tra parole chiavi e nomi. Al posto degli spazi, in GDScript, usiamo i trattini bassi ("_"). L'hai già potuto vedere con funzioni come [code]move_forward()[/code] o [code]move_local_x()[/code]. Questa è la convenzione, chiamata snake_case che viene usata in GDScript. Ci sono altre convenzioni che vengono usate dai programmatori in altri linguaggi. Al posto di utilizzare i trattini bassi, iniziano le parole con la lettera maiuscola tranne per la prima parola. Con questa convenzione, scriveresti il nome delle funzioni come [code]moveForward()[/code] o [code]moveLocalX()[/code]. Gli identificatori [i]devono[/i] pure iniziare con una lettera o con un trattino basso; [i]Non[/i] puoi iniziare con un numero, ma puoi usare i numeri dopo il primo carattere.
ja: 関数識別子にはスペースを含めることはできません。 一般に、プログラミング言語の名前にはスペースを含めることはできません。 コンピューターはスペースを使用して、さまざまなキーワードと識別子の間の区切りを検出します。 GDScript では、スペースの代わりにアンダースコア (「_」) を使用します。 これは、[code]move_forward()[/code] や [code]move_local_x()[/code] などの関数ですでに確認済みです。 これは、GDScript で従う規則です。 他のプログラミング言語では、プログラマが使用する別の規則があります。 アンダースコアを使用する代わりに、最初の文字を除いて単語を大文字で始めます。 この規則では、[code]moveForward()[/code] や [code]moveLocalX()[/code] のような関数名を記述します。 識別子は文字またはアンダースコアで始めることも[i]あります[/i]。 数字で始めることは[i]できません[/i]が、最初の文字の後に数字を使用することはできます。
nl: Functie-identifiers kunnen geen spaties bevatten. In het algemeen kunnen namen in programmeertalen geen spaties bevatten. De computer gebruikt spaties om de scheiding tussen verschillende sleutelwoorden en identifiers aan te geven. In GDScript gebruiken we in plaats van spaties lage streepjes ("_"). Je zag dit al bij functies als [code]move_forward()[/code] of [code]move_local_x()[/code]. Dit is de conventie die we volgen in GDScript. In sommige andere programmeertalen gebruiken programmeurs nog een andere conventie. In plaats van underscores te gebruiken, beginnen ze woorden met hoofdletters, behalve de eerste. Met die conventie zou je functienamen schrijven als [code]moveForward()[/code] of [code]moveLocalX()[/code]. Identifiers [i]moeten[/i] ook beginnen met een letter of een underscore; ze [i]kunnen niet[/i] beginnen met een cijfer, maar je kunt wel cijfers gebruiken na het eerste teken.
ru: Идентификаторы функций не могут содержать пробелы. В целом, имена в языках программирования не могут содержать пробелы. Компьютер использует пробелы для распознавания разделений между разными ключевыми словами и идентификаторами. Вместо пробелов в GDScript мы используем нижнее подчёркивание («_»). Вы уже видели его в названиях функций [code]move_forward()[/code] и [code]move_local_x()[/code]. Это соглашение, которому мы следуем в GDScript. Существуют и другие соглашения которым следуют программисты в других языках программирования. Вместо использования нижнего подчеркивания, они начинают все слова в идентификаторах, кроме первого, с заглавных букв. Если бы мы придерживались этого соглашения, то имена функций выглядели бы так: [code]moveForward()[/code] или [code]moveLocalX()[/code] Идентификаторы также [i]должны[/i] начинаться с буквы или нижнего подчеркивания; Вы [i]не можете[/i] начать идентификатор с числа, но числа могут использоваться после первого символа.
sv: Funktionsidentifierare kan inte innehålla mellanslag. I allmänhet kan inga namn i programmeringsspråk innehålla mellanslag. Datorn använder mellanslag för att skilja på olika nyckelord och identifierare. I stället för mellanslag använder vi understreck ("_") i GDScript. Du såg detta redan med funktioner som [code]move_forward()[/code] eller [code]move_local_x()[/code]. Detta är konventionen vi följer i GDScript. Det finns en annan konvention som programmerare använder i vissa andra programmeringsspråk. Istället för att använda understreck börjar de ord med versaler förutom det första ordet. Med den konventionen skulle du skriva funktionsnamn som [code]moveForward()[/code] eller [code]moveLocalX()[/code] Identifierare [i]måste[/i] börja med en bokstav eller ett understreck; Du [i]kan inte[/i] börja med ett nummer, men du kan använda siffror efter det första tecknet.
tr: Fonksiyon tanımlayıcılar boşluk içeremez. Genel olarak, programlama dillerindeki isimler boşluk içeremezler. Bilgisayar, farklı anahtar kelimeler ve tanımlayıcıları birbirinden ayırt etmek için boşluk karakterini kullanır. GDScript'te, boşlukların yerine alt çizgi ("_") kullanıyoruz. Bunu zaten [code]move_forward()[/code] ya da [code]move_local_x()[/code] fonsiyonlarında gördün. GDScript'te takip ettiğimiz düzen budur. Programcıların, bazı diğer programlama dillerinde kullandığı bir başka düzen daha var. Alt çizgi kullanmak yerine, ilk harf hariç, kelimelerin ilk harflerini büyük yazarak birleştirirler. Bu düzene uyacak olursak, fonksiyon isimlerini [code]moveForward()[/code] ya da [code]moveLocalX()[/code] şeklinde yazardın. Ayrıca, tanımlayıcılar bir harf ve ya alt çizgi ile başlamak [i]zorundadır[/i]. Bir numara ile [i]başlayamazsın[/i], ama ilk harften sonra numaralar kullanabilirsin.
zh_hans: 函数标识符不能包含空格。 通常，编程语言中的名称不能包含空格。 计算机使用空格来检测不同关键字和标识符之间的分隔。 在 GDScript 中，我们使用下划线（“_”）代替空格。 你已经通过 [code]move_forward()[/code] 或 [code]move_local_x()[/code] 等函数看到了这一点。 这是我们在 GDScript 中遵循的约定。 程序员在其他一些编程语言中使用了另一种约定。 它们不使用下划线，而是以大写字母开头，第一个除外。 使用该约定，你将编写函数名称，如 [code]moveForward()[/code] 或 [code]moveLocalX()[/code] 标识符也 [i]have[/i] 以字母或下划线开头； 你[i]不能[/i]以数字开头，但你可以在第一个字符之后使用数字。

source: You can't name a function [code]move forward[/code] because it contains a space. Names in code cannot contain spaces. They can't start with numbers either, which is why [code]45_degree_turn[/code] is also invalid. However, having numbers elsewhere in a function name is fine. That's why [code]make3NewCharacters[/code] works.
it: Non puoi chiamare una funzione [code]move forward[/code] perché contiene uno spazio. I nomi nel codice non possono contenere spazi. Non possono neanche iniziare con numeri ed è per questo che [code]45_degree_turn[/code] è pure invalido. Tuttavia, avere numeri in qualsiasi altra parte all'interno di un nome di una funzione è ok. Quindi usare [code]make3NewCharacters[/code] va bene.
ja: スペースが含まれているため、関数に [code]move forward[/code] という名前を付けることはできません。 コード内の名前にはスペースを含めることはできません。 数字で始めることもできないため、[code]45_degree_turn[/code] も無効です。 ただし、関数名の他の場所に数字を含めても問題ありません。 これが、[code]make3NewCharacters[/code] が機能する理由です。
nl: Je kunt een functie niet [code]move forward[/code] noemen omdat er een spatie in staat. Namen in code kunnen geen spaties bevatten. Ze kunnen ook niet beginnen met getallen, daarom is [code]45_degree_turn[/code] ook ongeldig. Maar cijfers elders in een functienaam zijn wel toegestaan. Daarom werkt [code]make3NewCharacters[/code] wel.
ru: Вы не можете назвать функцию [code]move forward[/code] потому что это название содержит пробел. Имена в коде не могут содержать пробелы. Так же, они не могут начинаться с чисел, поэтому название [code]45_degree_turn[/code] является некорректным. Однако иметь числа в другом месте имени функции — это нормально. Вот почему [code]make3NewCharacters[/code] является корректным именем.
sv: Du kan inte namnge en funktion [code]move forward[/code] eftersom den innehåller ett mellanslag. Namn i koden får inte innehålla mellanslag. De kan inte heller börja med siffror. Därför är [code]45_degree_turn[/code] också ogiltigt. Det går dock bra att ha nummer någon annanstans i ett funktionsnamn. Det är därför [code]make3NewCharacters[/code] fungerar.
tr: Bir fonksiyona, [code]move forward[/code] ismini veremezsin çünkü içinde boşluk var. Kodun içindeki isimler boşluk içeremez. İsimler, numaralarla da başlayamazlar, bu nedenle [code]45_degree_turn[/code] de geçersizdir. Ancak ismin diğer yerlerinde numara olmasında sorun yoktur. [code]make3NewCharacters[/code] isminin işe yaramasının sebebi bu.
zh_hans: 你不能命名一个函数为 [code]move forward[/code] 因为它包含一个空格。 代码中的名称不能包含空格。 函数也不能以数字开头，这就是为什么 [code]45_degree_turn[/code] 也是无效的。 但是，在函数名的其他地方有数字是可以的。 这就是 [code]make3NewCharacters[/code] 合规的原因。

source: move forward
ru: идти вперёд

source: In order to draw multiple squares in different positions, we introduce a new function for our turtle to use. The [code]jump()[/code] function picks up the turtle and places it relative to where it is. So calling [code]jump(-100, 50)[/code] moves the turtle by 100 pixels to the [b]left[/b] and 50 pixels [b]down[/b] without drawing any lines.
it: Per disegnare molti quadrati in posizioni diverse, introduciamo una nuova funzione che la nostra tartaruga utilizzerà. La funzione [code]jump()[/code] prende la tartaruga e la sposta relativamente a dove si trova. Dunque chiamare [code]jump(-100, 50)[/code] muoverà la tartaruga di 100 pixel sulla sua [b]sinistra[/b] e 50 pixel vero il [b]basso[/b] senza disegnare alcuna linea.
ja: 異なる位置に複数の正方形を描画するために、カメが使用する新しい関数を導入します。 [code]jump()[/code] 関数は、カメを選択し、カメがいる場所に相対的に配置します。 したがって、[code]jump(-100, 50)[/code] を呼び出すと、線を描画せずにカメを [b]左[/b]に 100 ピクセル、[b]下[/b]に 50 ピクセル移動します。
nl: Om meerdere vierkanten op verschillende plekken te tekenen, introduceren we een nieuwe functie die onze schildpad kan gebruiken. De [code]jump()[/code] functie pakt de schildpad op en plaatst hem relatief ten opzichte van waar hij was. Dus als je [code]jump(-100, 50)[/code] oproept, wordt de schildpad 100 pixels naar [b]links[/b] en 50 pixels naar [b]beneden[/b] verplaatst zonder lijnen te tekenen.
ru: Для того, чтобы нарисовать несколько квадратов в разных местах, представляем вам новую функцию для управления нашей черепашкой. Функция [code]jump()[/code] поднимает черепашку и располагает её куда-то относительно места, где она находится на данный момент. Вызов [code]jump(-100, 50)[/code] перемещает черепашку на 100 пикселей [b]влево[/b] и 50 пикселей [b]вниз[/b] без отрисовки новых линий.
sv: För att rita flera kvadrater i olika positioner introducerar vi en ny funktion för vår sköldpadda att använda. Funktionen [code]jump()[/code] plockar upp sköldpaddan och placerar den, relativt till var den för tillfället är. Genom att anropa [code]jump(-100, 50)[/code] flyttas sköldpaddan med 100 pixlar till [b]vänster[/b] och 50 pixlar [b]ned[/b] utan att dra några linjer.
tr: Farklı konumlarda bir sürü kare çizmek için, kaplumbağamızın kullanacağı yeni bir fonksiyon tanıtıyoruz. [code]jump()[/code] (zıpla) fonksiyonu kaplumbağayı alıp, bulunduğu yere yakın başka bir yere taşır. Yani [code]jump(-100, 50)[/code] çağırması, kaplumbağayı, hiç bir çizgi çizmeden, 100 piksel [b]sola[/b] ve 50 piksel [b]aşağıya[/b] taşıyor.
zh_hans: 为了在不同位置绘制多个正方形，我们引入了一个新函数供我们的海龟使用。 [code]jump()[/code] 函数捡起海龟并将其放置在相对位置上。 因此，调用 [code]jump(-100, 50)[/code] 会将海龟 [b]向左[/b] 移动 100 像素，以及[b]向下[/b] 移动 50 像素，而不绘制任何线条。

source: Code a function named [code]draw_square()[/code] to draw one square of length 200 pixels. The function should take no parameters. Use the [code]move_forward()[/code] and [code]turn_right()[/code] functions to instruct the turtle. In the following practice, you'll use the [code]draw_square()[/code] function to draw multiple squares by calling your own function.
it: Scrivi una funzione chiamata[code]draw_square()[/code] per disegnare un quadrato avente lato 200 pixel. La funzione non dovrebbe prendere alcun parametro. Usa le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] peer istruire la tartaruga. Nella seguente pratica, userai la funzione [code]draw_square()[/code] per disegnare vari quadrati chiamando la tua funzione.
ja: [code]draw_square()[/code] という名前の関数をコーディングして、長さ 200 ピクセルの正方形を 1 つ描画します。 関数はパラメータを取らないでください。 [code]move_forward()[/code] 関数と [code]turn_right()[/code] 関数を使用してカメに指示します。 次の演習では、[code]draw_square()[/code] 関数を使用して、独自の関数を呼び出して複数の正方形を描画します。
nl: Schrijf een functie met de naam [code]draw_square()[/code] om een vierkant met een lengte van 200 pixels te tekenen. De functie hoeft geen parameters aan te nemen. Gebruik de functies [code]move_forward()[/code] en [code]turn_right()[/code] om de schildpad te aan te sturen. In de volgende oefening gebruik je de functie [code]draw_square()[/code] om meerdere vierkanten te tekenen door je eigen functie aan te roepen.
ru: Напишите функцию с именем [code]draw_square()[/code] чтобы нарисовать один квадрат длинной в 200 пикселей. Функция не должна принимать никаких параметров. Используйте функции [code]move_forward()[/code] и [code]turn_right()[/code] для управления черепашкой. В следующем практическом упражнении, вы будете использовать свою собственную функцию [code]draw_square()[/code] для создания нескольких квадратов.
sv: Koda en funktion som heter [code]draw_square()[/code] och som ritar en kvadrat med längden 200 pixlar. Funktionen har inga argument. Använd funktionerna [code]move_forward()[/code] och [code]turn_right()[/code] för att instruera sköldpaddan. I nästa övning kommer du att använda funktionen [code]draw_square()[/code] för att rita flera kvadrater genom att anropa din egen funktion.
tr: 200 piksel uzunluğunda bir kare çizen, [code]draw_square()[/code] (çiz_kare) isimli bir fonksiyon kodla. Fonksiyon, hiç bir girdi değişkeni almasın. Kaplumbağaya talimat vermek için, [code]move_forward()[/code] ve [code]turn_right()[/code] fonksiyonlarını kullan. Sıradaki alıştırmada, çoklu kareler çizmek için kendi fonksiyonunu çağırırken, [code]draw_square()[/code] fonksiyonunu kullanacaksın.
zh_hans: 编写一个名为 [code]draw_square()[/code] 的函数来绘制一个长度为 200 像素的正方形。 该函数不需要带任何参数。 使用 [code]move_forward()[/code] 和 [code]turn_right()[/code] 函数来指示海龟。 在下面的练习中，你将使用 [code]draw_square()[/code] 函数通过调用你自己写的函数来绘制多个正方形。

source: You have a function to draw one square: [code]draw_square()[/code]. Use it to draw three squares. We already created [code]draw_square()[/code] for you. Create a function named [code]draw_three_squares[/code] that calls [code]draw_square()[/code] three times. If you just call the function, all three squares will overlap. To stack them diagonally, call [code]jump(300, 300)[/code] between two calls to [code]draw_square()[/code]. Calling [code]jump(300, 300)[/code] makes the turtle jump by 300 pixels to the right and 300 pixels down without drawing any lines.
it: Hai una funzione per disegnare un quadrato: [code]draw_square()[/code]. Usala per disegnare tre quadrati. Abbiamo già creato [code]draw_square()[/code] per te. Crea una funzione chiamata [code]draw_three_squares[/code] che chiama [code]draw_square()[/code] tre volte. Se chiami solamente la funzione, i tre quadrati si sovrapporranno. per impilarli diagonalmente, chiama [code]jump(300, 300)[/code] tra due chiamate di [code]draw_square()[/code]. Chiamare [code]jump(300, 300)[/code] fa si che la tartaruga salti di 300 pixel a destra e 300 pixel in basso senza disegnare alcuna linea.
ja: 1 つの正方形を描画する関数があります: [code]draw_square()[/code]。 それを使用して 3 つの正方形を描きます。 [code]draw_square()[/code] はすでに作成されています。 [code]draw_square()[/code] を 3 回呼び出す [code]draw_three_squares[/code] という名前の関数を作成します。 関数を呼び出すだけだと、3 つの正方形がすべて重なり合います。 それらを斜めに積み重ねるには、[code]draw_square()[/code] の 2 つの呼び出しの間に [code]jump(300, 300)[/code] を呼び出します。 [code]jump(300, 300)[/code] を呼び出すと、カメは線を描画せずに右に 300 ピクセル、下に 300 ピクセルずつジャンプします。
nl: Je hebt een functie om een vierkant te tekenen: [code]draw_square()[/code]. Gebruik deze functie om drie vierkanten te tekenen. We hebben [code]draw_square()[/code] al voor je gemaakt. Maak een functie met de naam [code]draw_three_squares[/code] die [code]draw_square()[/code] drie keer aanroept. Als je alleen de functie aanroept, zullen alle drie de vierkanten overlappen. Om ze diagonaal te stapelen, roep je [code]jump(300, 300)[/code] aan tussen twee aanroepen van [code]draw_square()[/code]. Door [code]jump(300, 300)[/code] aan te roepen springt de schildpad 300 pixels naar rechts en 300 pixels naar beneden zonder lijnen te tekenen.
ru: У вас есть функция для того чтобы нарисовать один квадрат: [code]draw_square()[/code]. Используйте её, чтобы нарисовать три квадрата. Мы уже создали [code]draw_square()[/code] для вас. Создайте функцию с именем [code]draw_three_squares[/code] которая сможет вызвать [code]draw_square()[/code] три раза. Если вы просто вызовете функцию, все три квадрата нарисуются друг поверх друга. Чтобы разместить их по диагонали, вызовите [code]jump(300, 300)[/code] между вызовами [code]draw_square()[/code]. Вызов [code]jump(300,300)[/code] заставляет черепашку прыгнуть на 300 пикселей вправо и 300 пикселей вниз, без отрисовки новых линий.
sv: Du har en funktion för att rita en kvadrat: [code]draw_square()[/code]. Använd den för att rita tre rutor. Vi har redan skapat [code]draw_square()[/code] åt dig. Skapa en funktion som heter [code]draw_three_squares[/code] som anropar [code]draw_square()[/code] tre gånger. Om du bara anropar funktionen kommer alla tre rutor att överlappa varandra. För att stapla dem diagonalt ska du anropa [code]jump(300, 300)[/code] mellan två anrop till [code]draw_square()[/code]. Att anropa [code]jump(300, 300)[/code] får sköldpaddan att hoppa 300 pixlar åt höger och 300 pixlar ner utan att dra några linjer.
tr: Elinde bir tane kare çizebilen bir fonksiyon var: [code]draw_square()[/code]. Bunu kullanarak üç tane kare çiz. [code]draw_square()[/code] fonksiyonunu senin için biz oluşturduk. Senin işin, üç defa [code]draw_square()[/code] çağrısı yapan, [code]draw_three_squares[/code] (çiz_üç_kare) isimli bir fonksiyon oluşturmak. Eğer fonksiyonu öylesine çağırırsan, üç kare birbiri üzerine gelecektir. Bunları köşegen doğrultusunda istiflemek için, her iki [code]draw_square()[/code] çağrısı arasına bir [code]jump(300, 300)[/code] çağırmalısın. [code]jump(300, 300)[/code] çağrısı, kaplumbağayı alıp, herhangi bir çizgi çizmeden 300 piksel sağa ve 300 piksel aşağıya zıplatır.
zh_hans: 你有这个绘制一个正方形的函数：[code]draw_square()[/code]。 用它来画三个正方形。 我们已经为你创建了 [code]draw_square()[/code]。 创建一个名为 [code]draw_three_squares[/code] 的函数，该函数会调用三次 [code]draw_square()[/code]。 如果你只是调用该函数，这三个正方形会重叠。 要想沿对角线依次放置它们，请在两次调用 [code]draw_square()[/code] 之间调用 [code]jump(300, 300)[/code]。 调用 [code]jump(300, 300)[/code] 会使海龟向右跳跃 300 像素，向下跳跃 300 像素，而不绘制任何线条。
