Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-17-while-loops.po
Languages: ja, nl, pt, pt_br, ru, tr, zh_hans

source: At first, you will not need [code]while[/code] loops often. Even the code we show here has more efficient alternatives. Also, there's a safer kind of loop, [code]for[/code] loops, which we'll look at in the next lesson. Yet, [code]while[/code] loops have important intermediate to advanced-level uses, so you at least need to know they exist and how to use them. We use [code]while[/code] loops every time we need to loop an unknown number of times. For example, games run in a loop that typically generates sixty images per second until the user closes the game. This is possible thanks to [code]while[/code] loops. There are other good uses for [code]while[/code] loops: - Reading and processing a file, like a text document, line by line. - Processing a constant stream of data, like someone recording audio with a microphone. - Reading code and converting it into instructions the computer understands. - Various intermediate to advanced-level algorithms, like finding paths around a map for AI.
ja: 最初は、[code]while[/code]ループを頻繁に必要としません。ここで紹介するコードにも、より効率的な代替手段があります。 また、より安全な種類のループである [code]for[/code] ループもありますが、これについては次のレッスンで説明します。 しかし、[code]while[/code]ループには中級から上級レベルの重要な用途があるため、少なくともその存在と使用方法を知っておく必要があります。 [code]while[/code]ループは、未知の回数ループする必要があるたびに使用します。 たとえば、ゲームは、ユーザーがゲームを閉じるまで、通常、毎秒 60 枚の画像を生成するループで実行されます。これは、[code]while[/code]ループのおかげで可能です。 [code]while[/code]ループには他にも良い使い方があります。 - テキスト文書などのファイルを行ごとに読み取って処理する。 - マイクで音声を録音する人など、一定のデータストリームを処理する。 - コードを読み取り、コンピュータが理解できる命令に変換する。 - 中級レベルから上級レベルのさまざまなアルゴリズム (AI 用のマップの周りのパスの検索など)。
nl: In het begin zul je [code]while[/code] lussen niet vaak nodig hebben. Zelfs de code die we hier laten zien heeft efficiëntere alternatieven. Er is ook een veiliger soort lus, [code]for[/code]-lussen, die we in de volgende les zullen bekijken. Toch hebben [code]while[/code]-lussen belangrijke toepassingen op gemiddeld tot gevorderd niveau, dus je moet op zijn minst weten dat ze bestaan en hoe ze te gebruiken. We gebruiken [code]while[/code]-lussen elke keer dat we een onbekend aantal keren moeten herhalen. Spellen draaien bijvoorbeeld in een lus die meestal zestig afbeeldingen per seconde genereert totdat de gebruiker het spel sluit. Dit is mogelijk dankzij [code]while[/code] lussen. Er zijn andere goede toepassingen voor [code]while[/code]-lussen: - Het lezen en verwerken van een bestand, zoals een tekstdocument, regel voor regel. - Het verwerken van een voortdurende stroom gegevens, zoals iemand die geluid opneemt met een microfoon. - Code lezen en omzetten in instructies die de computer begrijpt. - Verschillende algoritmes van gemiddeld tot gevorderd niveau, zoals het vinden van paden op een kaart voor kunstmatige intelligentie.
pt: A princípio, não vai precisar de usar loops [code]while[/code] com muita frequência. Até o código que mostramos aqui tem alternativas mais eficientes. Além disso, há um tipo de loop mais seguro, loops [code]for[/code], que veremos na próxima lição. No entanto, os loops [code]while[/code] têm usos intermediários a avançados importantes, portanto, precisa pelo menos saber que existem e como usá-los. Usamos loops [code]while[/code] toda vez que precisamos repetir algum bloco de código por uma quantidade indeterminada de vezes. Por exemplo, os jogos são executados num loop que normalmente gera 60 imagens por segundo até que o utilizador feche o jogo. Isso é possível graças aos loops [code]while[/code]. Existem outros usos bons para o loop de [code]while[/code]: - Ler e processar um ficheiro, como um ficheiro de texto por exemplo, linha por linha. - Processar um fluxo constante de dados, como alguém a gravar áudio com um microfone. - Ler código e convertê-lo em instruções que o computador entenda. - Vários algoritmos de nível intermediário a avançado, como encontrar caminhos à volta de um mapa para Inteligência Artificial.
pt_br: A princípio, você não vai precisar usar loops [code]while[/code] com muita frequência. Até o código que mostramos aqui tem alternativas mais eficientes. Além disso, há um tipo de loop mais seguro, loops [code]for[/code], que veremos na próxima lição. No entanto, os loops [code]while[/code] têm usos intermediários a avançados importantes, portanto, você precisa pelo menos saber que eles existem e como usá-los. Usamos loops [code]while[/code] toda vez que precisamos repetir algum bloco de código por um número indeterminado de vezes. Por exemplo, os jogos são executados em um loop que normalmente gera 60 imagens por segundo até que o usuário feche o jogo. Isso é possível graças aos loops [code]while[/code]. Existem outros bons usos para o loop [code]while[/code]: - Ler e processar um arquivo, como um arquivo de texto por exemplo, linha por linha. - Processar um fluxo constante de dados, como alguém gravando áudio com um microfone. - Ler códigos e convertê-los em instruções que o computador entenda. - Vários algoritmos de nível intermediário a avançado, como encontrar caminhos ao redor de um mapa para Inteligência Artificial.
ru: Сперва циклы [code]while[/code] вам не понадобятся. Даже код, который мы здесь показываем, имеет более эффективные альтернативы. Кроме того, существует более безопасный вид цикла — цикл [code]for[/code], который мы рассмотрим в следующем уроке. Тем не менее, циклы [code]while[/code] имеют важное значение для среднего и продвинутого уровней, поэтому вам, по крайней мере, нужно знать, что они существуют и как их использовать. Мы используем циклы [code]while[/code] каждый раз, когда нам требуется выполнить цикл неизвестное количество раз. Например, игры запускаются в цикле, который обычно генерирует шестьдесят изображений в секунду, пока пользователь не закроет игру. Это возможно благодаря циклам [code]while[/code]. Есть и другие полезные способы применения циклов [code]while[/code]: - Чтение и обработка файла, например, текстового документа, построчно. - Обработка постоянного потока данных, например, при записи звука с помощью микрофона. - Чтение кода и преобразование его в инструкции, понятные компьютеру. - Различные алгоритмы среднего и продвинутого уровней, такие как поиск пути на карте для ИИ.
tr: Başlangıçta, [code]while[/code] döngülerine çok sık ihtiyaç duymayacaksın. Burada gösterdiğimiz kodun bile daha verimli alternatifleri var. Ayrıca, bir sonraki derste inceleyeceğimiz gibi, [code]for[/code] döngüleri gibi daha güvenli bir döngü türü de var. Yine de, [code]while[/code] döngülerinin orta ve ileri düzeyde önemli kullanımları vardır, bu nedenle en azından var olduklarını ve nasıl kullanılacaklarını bilmen gerekir. Bilinmeyen bir sayıda yinelemeye ihtiyaç duyduğumuz her seferde [code]while[/code] döngülerini kullanırız. Örneğin oyunlar, kullanıcı oyunu kapatana kadar genellikle saniyede altmış görüntü üreten bir döngü içinde çalışır. Bunu yapmak, [code]while[/code] döngüleri sayesinde mümkündür. [code]while[/code] döngülerinin başka iyi kullanımları da var: - Metin belgesi gibi bir dosyanın, satır satır okuyup işlemek. - Mikrofonla ses kaydı yapan biri gibi, sürekli bir veri akışını işlemek. - Bir kodu okumak ve içindekileri bilgisayarın anlayacağı talimatlara dönüştürmek. - Yapay zeka için bir haritanın etrafındaki yolları bulmak gibi çeşitli orta ve ileri düzey algoritmalar.
zh_hans: 刚开始学的时候，不太需要经常使用 [code]while[/code] 循环。甚至我们在这里展示的代码也有更高效的替代方案。 不仅如此，还有一种更稳妥的循环，[code]for[/code] 循环，我们将在下一课中介绍。 但是，[code]while[/code] 循环在中到高级的情况中有重要用途，因此你至少需要知道有这么回事儿，以及如何使用它。 每当我们需要循环的次数未知时，我们都会使用 [code]while[/code] 循环。 例如，游戏以循环的形式运行，在关闭游戏前，通常每秒都会生成 60 张图像。这要归功于 [code]while[/code] 循环。 [code]while[/code] 循环还有很多其他好用途： - 逐行读取和处理文件，如一行一行处理文本文档。 - 处理源源不断的数据流，例如用麦克风录制音频。 - 解读代码并将其转换为计算机可以理解的指令。 - 各种中到高级的算法，例如为围绕一个地图为 AI 寻找路径。

source: Let's practice some [code]while[/code] loops, as they're useful to know. It's also an excellent opportunity to practice 2D vectors. Then, we'll move on to the safer [code]for[/code] loops in the following lesson.
ja: 知っておくと便利なので、いくつかの[code]while[/code]ループを練習しましょう。また、2Dベクトルを練習する絶好の機会でもあります。 次に、次のレッスンで、より安全な [code]for[/code] ループに移ります。
nl: Laten we wat met [code]while[/code]-lussen oefenen, want die zijn handig om te kennen. Het is ook een uitstekende gelegenheid om te oefenen met 2D vectoren. Daarna gaan we verder met de veiligere [code]for[/code]-lussen in de volgende les.
pt: Vamos praticar loops de [code]while[/code] rapidamente, pois são úteis de os conhecer. É também uma excelente oportunidade de praticar vetores 2D. Depois, passaremos para os loops de [code]for[/code], que são mais seguros de usar, na lição a seguir.
pt_br: Vamos praticar loops [code]while[/code] rapidamente, pois eles são úteis para se conhecer. É também uma excelente oportunidade para praticar vetores 2D. Depois, passaremos para os loops [code]for[/code], que são mais seguros de se usar, na lição a seguir.
ru: Давайте поупражняемся в использовании циклов [code]while[/code], так как их полезно знать. Также это отличная возможность попрактиковаться в работе с 2D-векторами. В следующем уроке мы перейдём к более безопасным циклам [code]for[/code].
tr: Hadi bir kaç [code]while[/code] döngüsü üzerinde pratik yapalım, çünkü bunları bilmek faydalıdır. Bu aynı zamanda 2B vektörlerle pratik yapmak için de mükemmel bir fırsat. Ardından, bir sonraki derste, daha güvenli olan[code]for[/code] döngülerine geçeceğiz.
zh_hans: 让我们练习写一些 [code]while[/code] 循环，了解它们很有用。这也是练习 2D 向量（2D vectors）的绝佳机会。 在这之后，下一课我们会继续学习更安全的 [code]for[/code] 循环。

source: Moving to the end of a board
ja: ボードの末尾に移動する
nl: Naar het einde van een bord bewegen
pt: Mover para o final de um tabuleiro
pt_br: Movendo para o final de um tabuleiro
ru: Движение до конца доски
tr: Bir tahtanın sonuna gitmek
zh_hans: 移动到格子棋盘的终点

source: Our robot has decided to stand at the top of the board. Complete the [code]move_to_bottom()[/code] function so the robot moves to the bottom of the board. The board size is determined by the [code]Vector2[/code] [code]board_size[/code]. The robot's current cell is [code]Vector2(2, 0)[/code]. Make sure to use a [code]while[/code] loop so the function works for any board size.
ja: 私たちのロボットは、ボードの一番上に立つことにしました。 [code]move_to_bottom()[/code]機能を完了して、ロボットがボードの下部に移動します。 ボードサイズは [code]Vector2[/code] [code]board_size[/code] で決まります。 ロボットの現在のセルは [code]Vector2(2, 0)[/code] です。 関数が任意のボードサイズで動作するように、[code]while[/code]ループを必ず使用してください。
nl: Onze robot heeft besloten om bovenaan het bord te gaan staan. Vul de functie [code]move_to_bottom()[/code] aan zodat de robot naar de onderkant van het bord beweegt. De grootte van het bord is bepaald door de [code]Vector2[/code] [code]board_size[/code]. De huidige cel van de robot is [code]Vector2(2, 0)[/code]. Zorg ervoor dat je een [code]while[/code]-lus gebruikt zodat de functie werkt voor elke bordgrootte.
pt: O nosso robô decidiu ficar na parte de cima do tabuleiro. Complete a função [code]move_to_bottom()[/code] para que o robô se mova para a parte inferior do tabuleiro. O tamanho do tabuleiro é determinado pelo [code]Vector2[/code] [code]board_size[/code]. A célula atual do robô é [code]Vector2(2, 0)[/code]. Certifique-se de usar um loop [code]while[/code] para que a função funcione para qualquer tamanho de tabuleiro.
pt_br: Nosso robô decidiu ficar na parte de cima do tabuleiro. Complete a função [code]move_to_bottom()[/code] para que o robô se mova para a parte inferior do tabuleiro. O tamanho do tabuleiro é determinado pelo [code]Vector2[/code] [code]board_size[/code]. A célula atual do robô é [code]Vector2(2, 0)[/code]. Certifique-se de usar um loop [code]while[/code] para que a função funcione para qualquer tamanho de tabuleiro.
ru: Наш робот решил остановиться в верхней части доски. Доработайте функцию [code]move_to_bottom()[/code], чтобы робот перешёл в нижнюю часть доски. Размер доски определяется переменной типа [code]Vector2[/code] — [code]board_size[/code]. Сейчас робот находится в ячейке [code]Vector2(2, 0)[/code]. Убедитесь, что используете цикл [code]while[/code], чтобы функция работала для досок любого размера.
tr: Robotumuz, tahtanın en tepesinde durmaya karar verdi. Robotun, tahtanın en altına doğru hareket etmesi için, [code]move_to_bottom()[/code] (ilerle_en_alta) fonksiyonunu tamamla. Tahtanın boyutu [code]Vector2[/code] tipinde [code]board_size[/code] (tahta_boyu) tarafından belirlenir. Robotun şu an durduğu hücrenin, cell, konum değeri [code]Vector2(2, 0)[/code]. Fonksiyonun, herhangi bir tahta boyutuyla çalışması için [code]while[/code] döngüsünü kullandığından emin ol.
zh_hans: 我们的机器人决定站在棋盘的顶端。 写好 [code]move_to_bottom()[/code] 函数，使机器人移动到棋盘底部。 棋盘大小由变量 [code]Vector2[/code] [code]board_size[/code]（棋盘大小） 决定。 机器人当前的单元格是在 [code]Vector2(2, 0)[/code]。 确保用到了 [code]while[/code] 循环，以便该函数适用于任何尺寸的棋盘。

source: Use a while loop to have our robot move from the top of the board to the bottom.
ja: while ループを使用して、ロボットをボードの上から下に移動します。
nl: Gebruik een while-lus om onze robot van de bovenkant van het bord naar de onderkant te laten bewegen.
pt: Use um loop while para que nosso robô se mova da parte superior do tabuleiro para a parte inferior.
pt_br: Use um loop while para que nosso robô se mova da parte superior do tabuleiro para a parte inferior.
ru: Используйте цикл while для перемещения робота из верхней части доски в нижнюю.
tr: Robotumuzun tahtanın en üstünden en altına doğru hareket etmesini sağlamak için bir while döngüsü kullan.
zh_hans: 用 while 循环让机器人从棋盘的顶部移动到底部。

source: Introduction to While Loops
ja: Whileループの紹介
nl: Inleiding tot while-lussen
pt: Introdução aos loops de while
pt_br: Introdução aos loops while
ru: Введение в циклы while
tr: While Döngülerine Giriş
zh_hans: While循环入门
