Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-21-strings.po
Languages: de, fr, zh_hans

source: Throughout this course, we've mostly stored numbers in variables. But what if we wanted to store a player's name? This is where strings help us. Strings are instrumental in games and applications. We use them to display information such as the description of a spell or the name of a character.
de: Während dieses Kurses haben wir hauptsächlich Zahlen in Variablen gespeichert. Aber was wäre, wenn wir den Namen eines Spielers speichern wollten? Hier helfen uns Strings. Strings sind ein essenzieller Teil aller Videospiele und anderen Anwendungen. Wir verwenden sie, um Informationen wie die Beschreibung eines Zauberspruchs oder den Namen eines Charakters anzuzeigen.
fr: Tout au long de ce cours, nous avons principalement stocké des nombres dans des variables. Mais que faire si nous voulions stocker le nom d'un joueur ? C'est là que les chaînes de caractères nous aident. Les chaînes de caractères sont essentielles dans les jeux et les applications. Nous les utilisons pour afficher des informations telles que la description d'un sort ou le nom d'un personnage.
zh_hans: 在前面的课程中，我们主要用到的是数字，用变量存储。但是如果要存储一个玩家的名字呢？ 这就是字符串派上用场的时候了。 字符串（string）在游戏和应用程序中非常有用。用来显示咒语描述或者角色名称之类的信息。

source: What are strings
de: Was sind Strings
fr: Que sont les chaînes de caractères
zh_hans: 什么是字符串（string）

source: A [code]String[/code] is a value type which holds text. To create a [code]String[/code], you write text wrapped in quotation marks ([code]""[/code]). For example: [code]"This is a text string."[/code] The quotation marks differentiate strings from other value types and function names. You may remember we've used strings before in previous lessons.
de: Ein [code]String[/code] ist ein Werttyp, der Text enthält. Um einen [code]String[/code] zu erstellen, schreiben wir den gewünschten Text in Anführungszeichen ([code]""[/code]). Beispiel: [code]"Das ist ein String." [/code] Die Anführungszeichen unterscheiden Strings von anderen Werttypen und Funktionsnamen. Vielleicht erinnerst du dich daran, dass wir in früheren Lektionen bereits Zeichenfolgen verwendet haben.
fr: Une chaîne de caractères, ou [code]String[/code], est un type de valeur qui contient du texte. Pour créer un [code]String[/code], vous écrivez du texte entouré de guillemets ([code]""[/code]). Par exemple : [code] "Ceci est une chaîne de texte."[/code] Les guillemets différencient les chaînes de caractères des autres types de valeurs et noms de fonctions. Vous vous souvenez peut-être que nous avons déjà utilisé des chaînes de caractères dans des leçons précédentes.
zh_hans: [code]String[/code]（字符串） 是一种保存文本的值类型。要创建 [code]String[/code]，编写一段文本，用引号括起来 ([code]""[/code])。例如：[code]"这是一个文本字符串。"[/code] 英文引号（""）将字符串与其他值类型或者函数名称区分开来。 你可能还记得在之前的课程中用过的字符串。

source: Under the hood, strings are arrays of characters. In fact, we can use a [code]for[/code] loop to loop through the characters of a [code]String[/code] as we would with any other array.
de: Technisch gesehen sind Strings Arrays von Zeichen, also mehrere einzelne Zeichen die aneinander gehängt werden. Tatsächlich können wir die Zeichen eines [code]String[/code] auf die gleiche Weise wie Arrays durchlaufen, indem wir eine [code]for[/code]-Schleife verwenden.
fr: Sous le capot, les chaînes de caractères sont des tableaux de caractères. En fait, nous pouvons utiliser une boucle [code]for[/code] pour parcourir les caractères d'un [code]String[/code] comme nous le ferions avec n'importe quel autre tableau.
zh_hans: 在计算机底层，字符串其实是字符数组。事实上，我们可以使用 [code]for[/code] 循环来遍历[code]String[/code] 的字符，就像对其他类型的数组一样遍历。

source: Which of these are strings?
de: Wobei handelt es sich um Strings?
fr: Lesquels de ces éléments sont des chaînes de caractères ?
zh_hans: 下列哪些是字符串？

source: [code]"1"[/code] and [code]"name"[/code] are strings. [code]"1"[/code] only contains a character and [i]doesn't[/i] represent the number [code]1[/code]. [code]"name"[/code] is made up of four different characters.
de: [code]"1"[/code] und [code]"name"[/code] sind Strings. [code]"1"[/code] enthält nur ein Zeichen und [i]stellt nicht[/i] die Zahl [code]1[/code] dar. [code]"name"[/code] besteht aus vier verschiedenen Zeichen.
fr: [code]"1"[/code] et [code]"name"[/code] sont des chaînes de caractères. [code]"1"[/code] contient uniquement un caractère et [i]ne représente pas[/i] le nombre [code]1[/code]. [code]"name"[/code] est composé de quatre caractères différents.
zh_hans: [code]"1"[/code] 和 [code]"name"[/code] 是字符串。 [code]"1"[/code] 只包含一个字符"1"，[i]不[/i] 代表数字 [code]1[/code]。 [code]"name"[/code] 由四个不同的字符组成。

source: Why we use strings
de: Warum wir Strings verwenden
fr: Pourquoi nous utilisons des chaînes de caractères
zh_hans: 为什么要用字符串

source: Every piece of text you see in this app is a string that Godot is displaying for us. Much like how [code]Vector2[/code] variables make calculations easier, [code]string[/code] variables come with many helper functions and tricks we can use. We can use arrays to store strings too. This is useful for chaining animations. In this example, the [code]play_animation()[/code] plays a specific animation.
de: Jeglicher Text, den du in dieser App siehst, ist eine String, den Godot für uns anzeigt. Ähnlich wie [code]Vector2[/code] Variablen Berechnungen erleichtern, kommen [code]string[/code]-Variablen mit vielen Hilfsfunktionen und Tricks, die wir verwenden können. Wir können auch Arrays zum Speichern von Strings verwenden. Dies ist nützlich für das Aneinanderhängen von Animationen. In diesem Beispiel spielt [code]play_animation()[/code] eine bestimmte Animation ab.
fr: Chaque morceau de texte que vous voyez dans cette application est une chaîne de caractères que Godot affiche pour nous. Tout comme les variables [code]Vector2[/code] facilitent les calculs, les variables [code]string[/code] sont accompagnées de nombreuses fonctions auxiliaires et d'astuces que nous pouvons utiliser. Nous pouvons également utiliser des tableaux pour stocker des chaînes de caractères. Ceci est utile pour enchaîner des animations. Dans cet exemple, la fonction [code]play_animation()[/code] joue une animation spécifique.
zh_hans: 这个课程应用中，你看到的每一条文本都是 Godot 显示出来的字符串。 就像 [code]Vector2[/code] 变量能使计算更容易，[code]string[/code] 变量有许多好用的辅助函数和技巧。 甚至可以用数组来存储字符串。这对于链接不同的动画很有用。在此示例中，[code]play_animation()[/code] 会播放特定的一系列动画。

source: In the next few practices, we'll use strings in combination with different concepts from earlier lessons.
de: In den nächsten Übungen werden wir Strings in Kombination mit verschiedenen Konzepten aus früheren Lektionen verwenden.
fr: Dans les exercices suivants, nous utiliserons des chaînes de caractères en combinaison avec différents concepts des leçons précédentes.
zh_hans: 在接下来的几个练习中，我们将结合前面课程中的各种内容，练习使用字符串。

source: Creating string variables
de: Erstellen von String-Variablen
fr: Créer des variables de chaîne de caractères
zh_hans: 创建字符串变量

source: Currently, the robot has a number stored in the [code]robot_name[/code] variable. Change the [code]robot_name[/code] variable so that it's a string instead. You can give it any name you'd like.
de: Derzeit hat der Roboter eine Nummer, die in der Variablen [code]robot_name[/code] gespeichert ist. Ändere die Variable [code]robot_name[/code], sodass es sich stattdessen um einen String handelt. Du kannst ihm einen beliebigen Namen geben.
fr: Actuellement, le robot a un nombre enregistré dans la variable [code]robot_name[/code]. Modifiez la variable [code]robot_name[/code] pour qu'elle soit une chaîne de caractères à la place. Vous pouvez lui donner le nom que vous souhaitez.
zh_hans: 机器人在 [code]robot_name[/code] 变量中存储了一个数字。 更改 [code]robot_name[/code] 变量，把它改成字符串。你可以给它起任何你喜欢的名字。

source: Give the robot a readable name using a string stored in a variable.
de: Gib dem Roboter einen lesbaren Namen, indem du eine String-Variable verwendest.
fr: Donnez au robot un nom lisible en utilisant une chaîne de caractères stockée dans une variable.
zh_hans: 通过把字符串存储在变量中，给机器人一个可读的名称。

source: Using an array of strings to play a combo
de: Eine Kombo mit einem Array von Strings Abspielen
fr: Utiliser un tableau de chaînes de caractères pour jouer un combo
zh_hans: 用字符串数组施展连招

source: In this practice, we'll chain together animations using an array of strings. You might find such combinations in fighting games. The robot has the following animation names: - [code]jab[/code] (makes the robot perform a quick punch) - [code]uppercut[/code] (the robot uses a powerful jumping punch) Populate the combo array with animation names as strings. Then, for each action in the array, call the [code]play_animation()[/code] function to play them. The array should contain three values, so the robot makes these three attacks: two jabs followed by one uppercut.
de: In dieser Übung spielen wir mit Hilfe eines Arrays von Strings mehrere Animationen nacheinander ab. Solche Kombos kann man zum Beispiel in Kampfspielen finden. Der Roboter hat die folgenden Animationsnamen: - [code]jab[/code] (lässt den Roboter einen schnellen Schlag ausführen) - [code]uppercut[/code] (der Roboter verwendet einen mächtigen Jumping Punch) Füge die Animationsnamen als Strings in das combo Array ein. Rufe dann für jede Aktion im Array die Funktion [code]play_animation()[/code] auf, um sie abzuspielen. Der Roboter sollte der Reihe nach die folgenden 3 Aktionen ausführen: 2 Mal jab dann 1 Mal uppercut.
fr: Dans cet exercice, nous allons enchaîner des animations à l'aide d'un tableau de chaînes de caractères. Vous pourriez trouver de telles combinaisons dans les jeux de combat. Le robot a les noms d'animation suivants : - [code]jab[/code] (le robot donne un coup de poing rapide) - [code]uppercut[/code] (le robot utilise un puissant coup de poing en sautant) Remplissez le tableau de combos avec les noms des animations sous forme de chaînes de caractères. Ensuite, pour chaque action du tableau, appelez la fonction [code]play_animation()[/code] pour les jouer. Le tableau doit contenir trois valeurs, de sorte que le robot effectue ces trois attaques : deux jabs suivis d'un uppercut.
zh_hans: 在本练习中，我们会用到字符串数组，来把几个动画链接在一起。可能你会在格斗游戏中遇到类似的组合击。 该机器人具有以下动画名称： - [code]jab[/code]（让机器人快速出拳） - [code]uppercut[/code]（机器人使用强力的上勾拳） 把不同动画名称的字符串，填充进数组里。 然后，对于数组中的每个动作名，调用 [code]play_animation()[/code] 函数来依次播放它们。 字符串数组应包含三个变量，由此机器人会按顺序执行以下操作：jab、jab、uppercut。

source: Define an array of strings to unleash a powerful combo.
de: Definiere ein Array von Strings, um eine mächtige Kombo auszuführen.
fr: Définissez un tableau de chaînes pour déclencher un combo puissant.
zh_hans: 定义一个字符串数组以释放强力组合技。

source: Strings
fr: Chaînes de caractères
zh_hans: 字符串
