Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-4-drawing-a-rectangle.po
Languages: fr, hu, it, nl, pl, pt_br, sv

source: A function's arguments are all the values inside the parentheses. In this case, there's only one, but there can be multiple separated by commas. In this case, [code]move_forward[/code] is the function's name and [code]30[/code] is the argument. This function call will make the turtle move forward by [code]30[/code] pixels.
fr: Les arguments d'une fonction sont toutes les valeurs situées entre les parenthèses. Dans ce cas, il n'y en a qu'un, mais il peut y en avoir plusieurs, séparés par des virgules. Dans ce cas, [code]move_forward[/code] est le nom de la fonction et [code]30[/code] est l'argument. Cet appel de fonction fera avancer la tortue de [code]30[/code] pixels.
it: Gli argomenti di una funzione sono tutti i valori all'interno delle parentesi. In questo caso, ce n'è solo uno, ma ce ne possono essere molteplici separati da virgole. In questo caso, [code]move_forward[/code] è il nome della funzione e [code]30[/code] è l'argomento. Questa chiamata di funzione farà si che la tartaruga si muova in avanti di [code]30[/code] pixel.
nl: De argumenten van een functie zijn alle waarden tussen de haakjes. In dit geval is er maar één, maar er kunnen er meerdere zijn, gescheiden door komma's. In dit geval is [code]move_forward[/code] de naam van de functie en [code]30[/code] het argument. Deze functieoproep zorgt ervoor dat de schildpad [code]30[/code] pixels vooruit beweegt.
pt_br: Os argumentos de uma função são todos os valores dentro dos parênteses. Nesse caso, há apenas um, mas pode haver vários separados por vírgulas. Neste caso, [code]move_forward[/code] é o nome da função e [code]30[/code] é o argumento. Esta chamada de função fará a tartaruga avançar em [code]30[/code] pixels.
sv: En funktions argument är alla värden som står skrivna i parentesen. I det här fallet finns det bara ett, men det kan finnas flera argument separerade med kommatecken. I det här fallet är [code]move_forward[/code] funktionens namn och [code]30[/code] är argumentet. Detta funktionsanrop kommer att få sköldpaddan att gå framåt [code]30[/code] pixlar.

source: The turtle uses code made specifically for this app!
nl: De schildpad gebruikt code die speciaal voor deze app is gemaakt!

source: The turtle is a little learning tool custom-made for this course, based on a proven code learning methodology. It's designed to teach you how to use and create functions. So please don't be surprised if writing code like [code]turn_left()[/code] inside of the Godot editor doesn't work! And don't worry, once you've learned the foundations, you'll see they make it faster and easier to learn Godot functions.
nl: De schildpad is een klein leermiddel op maat gemaakt voor deze cursus, gebaseerd op een bewezen methodologie voor het leren over code. Het is ontworpen om je te leren hoe je functies kunt gebruiken en maken. Wees dus niet verbaasd als het schrijven van code zoals [code]turn_left()[/code] in de Godot editor niet werkt! En maak je geen zorgen, zodra je de fundamenten hebt geleerd, zul je zien dat ze het sneller en gemakkelijker maken om Godot functies te leren.

source: Let's move on to practice! You'll get to play with the turtle functions to draw shapes.
nl: Laten we beginnen met oefenen! Je gaat spelen met de schildpadfuncties om vormen te tekenen.

source: In this practice, we'll tell the turtle to draw a corner. The corner is made up of two lines that are [code]200[/code] pixels long. The lines are connected at each end by [code]90[/code] degrees, or right-angle. The [code]move_forward()[/code] and [code]turn_right()[/code] functions to the right draw a corner, but they're missing some arguments. Add the missing arguments so the turtle moves forward [code]200[/code] pixels, turns right [code]90[/code] degrees, then moves forward again [code]200[/code] pixels. We added the first argument for you so the turtle moves forward [code]200[/code] pixels. In the following practices, we'll draw multiple corners to create rectangles.
fr: Dans cet exercice, nous allons dire à la tortue de dessiner un coin. Le coin est composé de deux lignes de [code]200[/code] pixels de long. Les lignes sont reliées à chaque extrémité par [code]90[/code] degrés, c'est-à-dire un angle droit. Les fonctions [code]move_forward()[/code] et [code]turn_right()[/code] à droite dessinent un coin, mais il leur manque certains paramètres. Ajoutez les paramètres manquants pour que la tortue avance de [code]200[/code] pixels, tourne à droite de [code]90[/code] degrés, puis avance à nouveau de [code]200[/code] pixels. Nous avons ajouté le premier paramètre pour vous afin que la tortue avance de [code]200[/code] pixels. Dans les exercices suivants, nous allons dessiner plusieurs coins pour créer des rectangles.
it: In questa pratica, diremo alla tartaruga di disegnare un angolo. L'angolo è composto da due linee lunghe [code]200[/code] pixel. Le linee sono collegate a ciascuna estremità per [code]90[/code] gradi, o angolo retto. Le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] a destra disegnano un angolo, ma mancano alcuni argomenti. Aggiungete gli argomenti mancanti in modo che la tartaruga si sposti in avanti di [code]200[/code] pixel, si giri a destra di [code]90[/code] gradi, quindi si sposti di nuovo in avanti di [code]200[/code] pixel. Abbiamo aggiunto il primo argomento per far sì che la tartaruga si muova in avanti di [code]200[/code] pixel. Nei prossimi esercizi, disegneremo più angoli per creare dei rettangoli.
nl: In deze oefening geven we de schildpad de opdracht om een hoek te tekenen. De hoek bestaat uit twee lijnen die [code]200[/code] pixels lang zijn. De lijnen zijn met elkaar verbonden onder een hoek van [code]90[/code] graden, ofwel een rechte hoek. De [code]move_forward()[/code] en [code]turn_right()[/code] functies rechts tekenen een hoek, maar ze missen enkele argumenten. Voeg de ontbrekende argumenten toe zodat de schildpad [code]200[/code] pixels naar voren beweegt, [code]90[/code] graden naar rechts draait en dan weer [code]200[/code] pixels naar voren beweegt. We hebben het eerste argument alvast voor je toegevoegd zodat de schildpad [code]200[/code] pixels naar voren beweegt. In de volgende oefeningen tekenen we meerdere hoeken om rechthoeken te maken.
pt_br: Nessa prática, Nós vamos falar para a tartaruga desenhar um ângulo de 90 graus. Esse ângulo de 90 graus é feito por duas linhas de [code]200[/code] pixels de comprimento. As linhas são conectadas no final de cada uma delas por [code]90[/code] graus, formando um ângulo reto. As funções [code]move_forward()[/code] e [code]turn_right()[/code] que estão na direita desenham um ângulo de 90 graus, mas estão faltando nelas alguns parâmetros. Adicione os parâmetros que estão faltando para que a tartaruga mova para frente em [code]200[/code] pixels, vire para direita [code]90[/code] graus e mova para frente novamente em [code]200[/code] pixels. Nós adicionamos o primeiro parâmetro para você, assim a tartaruga vai mover para frente em [code]200[/code] pixels. Nas próximas práticas, vamos desenhar vários ângulos de 90 graus para criarmos retângulos.

source: Add the correct arguments to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of [code]200[/code] pixels, and a height of [code]120[/code] pixels. We wrote the first argument for you. In the next practice, you'll use the same functions to draw a bigger rectangle.
fr: Ajoutez les bons paramètres aux fonctions [code]move_forward()[/code] et [code]turn_right()[/code] pour dessiner un rectangle d'une largeur de [code]200[/code] pixels et d'une hauteur de [code]120[/code] pixels. Nous avons écrit le premier paramètre pour vous. Dans le prochain exercice, vous utiliserez les mêmes fonctions pour dessiner un rectangle plus grand.
it: Aggiungete gli argomenti corretti alle funzioni [code]move_forward()[/code] e [code]turn_right()[/code] per disegnare un rettangolo con una larghezza di [code]200[/code] pixel e un'altezza di [code]120[/code] pixel. Abbiamo scritto il primo argomento per voi. Nel prossimo esercizio, utilizzerete le stesse funzioni per disegnare un rettangolo più grande.
nl: Voeg de juiste argumenten toe aan de functies [code]move_forward()[/code] en [code]turn_right()[/code] om een rechthoek te tekenen met een breedte van [code]200[/code] pixels en een hoogte van [code]120[/code] pixels. We hebben het eerste argument al voor je ingevuld. In de volgende oefening gebruik je dezelfde functies om een grotere rechthoek te tekenen.
pt_br: Adicione os parâmetros corretos nas funções [code]move_forward()[/code] e [code]turn_right()[/code] para desenhar um retângulo com uma largura de [code]200[/code] pixels e altura de [code]120[/code] pixels. Nós escrevemos o primeiro parâmetro para você. Na próxima prática, você vai usar as mesmas funções para desenhar um retângulo ainda maior.

source: Write out calls to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of 220 pixels, and a height of 260 pixels. We wrote the first two lines for you. Be sure to write each instruction on a separate line. Every line should start with one [code]Tab[/code] character so the computer understands it's part of the [code]draw_rectangle()[/code] function.
fr: Rédigez des appels aux fonctions [code]move_forward()[/code] et [code]turn_right()[/code] pour dessiner un rectangle d'une largeur de 220 pixels et d'une hauteur de 260 pixels. Nous avons écrit les deux premières lignes pour vous. Veillez à écrire chaque instruction sur une ligne distincte. Chaque ligne doit commencer par un caractère [code]Tab[/code] afin que l'ordinateur comprenne qu'elle fait partie de la fonction [code]draw_rectangle()[/code].
it: Scrivi le chiamate per le funzioni [code]move_forward()[/code] e [code]turn_right()[/code] per disegnare un rettangolo di larghezza 220 pixel e altezza 260 pixel. Abbiamo scritto le prime due linee per te. Assicurati di scrivere ogni funzione su una linea diversa. Ricorda che ogni linea deve cominciare con il carattere [code]Tab[/code] così da far comprendere al computer che quelle linee sono parte della funzione [code]draw_rectangle()[/code].
nl: Schrijf aanroepen naar de functies [code]move_forward()[/code] en [code]turn_right()[/code] uit om een rechthoek te tekenen met een breedte van 220 pixels en een hoogte van 260 pixels. We hebben de eerste twee regels alvast voor je geschreven. Zorg ervoor dat je elke instructie op een aparte regel schrijft. Elke regel moet beginnen met een [code]Tab[/code]-teken zodat de computer begrijpt dat deze regel deel uitmaakt van de [code]draw_rectangle()[/code] functie.
pt_br: Escreva as chamadas das funções [code]move_forward()[/code] e [code]turn_right()[/code] para desenhar um retângulo com uma largura de 220 pixels e altura de 260 pixels. Nós escrevemos as duas primeiras linhas para você. Certifique-se de escrever cada instrução em uma linha separada. Toda linha deve começar com um [code]caractere de tabulação[/code] para que o computador entenda que essas linhas fazem parte da função [code]draw_rectangle()[/code].
sv: Skriv anrop till funktionerna [code]move_forward()[/code] och [code]turn_right()[/code] för att rita en rektangel med en bredd på 220 pixlar och en höjd på 260 pixlar. Vi skrev de två första raderna åt dig. Var noga med att skriva varje instruktion på en egen rad. Varje rad bör börja med ett [code]Tab[/code]-tecken så att datorn förstår att raden är en del av [code]draw_rectangle()[/code]-funktionen.
