Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-22-functions-return-values.po
Languages: da, de, es, fr, it, ja, nl, pl, pt_br, ru, tr, uk, zh_hans

source: Well, cell coordinates don't correspond to positions on the screen. To find the center of any cell on the screen, we need to convert the cell's coordinates to a position on the screen, in pixels.
pl: Jednak współrzędne komórek nie odpowiadają pozycjom na ekranie. Aby znaleźć środek dowolnej komórki na ekranie, musimy przekształcić współrzędne komórki na pozycję na ekranie, w pikselach.

source: Until now, you learned that functions are sequences of instructions you give a name and you can call any time. On top of that, functions can make calculations and [i]return[/i] new values. Let's look at some examples to see why it's useful.
de: Bis jetzt hast du gelernt, dass Funktionen Sequenzen von Anweisungen sind, die du einen Namen geben und jederzeit aufrufen kannst. Darüber hinaus können Funktionen Berechnungen durchführen und [i]return[/i] neue Werte zurückgeben. Schauen wir uns einige Beispiele an, um zu sehen, warum das nützlich ist.
es: Hasta ahora, has aprendido que las funciones son secuencias de instrucciones a las que les das un nombre y que puedes llamar en cualquier momento. Además de eso, las funciones pueden hacer cálculos y [i]devolver[/i] nuevos valores. Veamos algunos ejemplos para ver por qué es útil.
fr: Jusqu'à présent, vous avez appris que les fonctions sont des séquences d'instructions auxquelles vous donnez un nom et que vous pouvez appeler à tout moment. En plus de cela, les fonctions peuvent effectuer des calculs et [i]retourner[/i] de nouvelles valeurs. Voyons quelques exemples pour comprendre pourquoi c'est utile.
it: Fino ad ora, hai imparato che le funzioni sono sequenze di istruzioni a cui attribuisci un nome, che puoi chiamare ogni volta che ne hai la necessità. Oltre a questo, le funzioni possono aiutarci a fare calcoli e [i]farci ritornare[/i] nuovi valori. Guardiamo qualche esempio per vedere perchè è utile.
ja: ここまでは、関数は名前を付けていつでも呼び出すことができる一連の命令であることを学びました。 その上、関数は計算を行い、新しい値を[i]返す[/i]ことができます。 なぜそれが役立つのか、いくつかの例を見てみましょう。
nl: Tot nu toe heb je geleerd dat functies reeksen instructies zijn die je een naam geeft en die je op elk moment kunt aanroepen. Daarnaast kunnen functies berekeningen uitvoeren en nieuwe waarden [i]teruggeven[/i]. Laten we een paar voorbeelden bekijken om te zien waarom dat nuttig is.
pt_br: Até agora, você aprendeu que funções são sequências de instruções que você dá um nome e pode chamar a qualquer momento. Além disso, as funções podem fazer cálculos e [i]retornar[/i] novos valores. Vamos ver alguns exemplos para ver por que isso é útil.
ru: До этого момента вы выучили, что функции — это именованные последовательности инструкций, которые можно вызвать в любое время. Помимо этого, функции могут производить вычисления и [i]возвращать[/i] новые значения. Давайте взглянем на несколько примеров, чтобы увидеть, чем это полезно.
tr: Şimdiye kadar fonksiyonların, bir isim verdiğiniz ve istediğiniz zaman çağırabileceğiniz sıralı talimatlar olduğunu öğrendiniz. Buna ek olarak, fonksiyonlar, hesaplamalar yapabilir ve geriye yeni değerler [i]döndürebilirler[/i]. Bunun ne yararı olduğunu görmek için bazı örneklere bakalım.
zh_hans: ·学到现在，你已经知道了到函数是一个由你命名的指令序列，可以被随时调用。 在此基础上，函数还可以进行计算并[i]返回[/i]（return）新的值。 让我们来看些例子，看看它为什么很有用。

source: Many functions built into GDScript make calculations and return a new value. For example, the [code]round()[/code] function takes a decimal number as an argument and gives you back a new number rounded to the nearest digit.
de: Viele Funktionen, die in GDScript integriert sind, führen Berechnungen durch und geben einen neuen Wert zurück. Beispielsweise verwendet die Funktion [code]round()[/code] eine Dezimalzahl als Argument und gibt eine neue Zahl zurück, die auf die nächste Ziffer gerundet ist.
es: Muchas funciones integradas en GDScript realizan cálculos y devuelven un nuevo valor. Por ejemplo, la función [code]round()[/code] toma un número decimal como argumento y te devuelve un nuevo número redondeado al dígito más cercano.
fr: De nombreuses fonctions intégrées dans GDScript effectuent des calculs et renvoient une nouvelle valeur. Par exemple, la fonction [code]round()[/code] prend un nombre décimal comme argument et vous renvoie un nouveau nombre arrondi au chiffre le plus proche.
it: Molte funzioni predefinite in GDScript svolgono calcoli e ritornano nuovi valori. Per esempio, la funzione [code]round()[/code] accetta un valore decimale come argomento e restituisce un nuovo numero intero arrotondato alla cifra più vicina.
ja: GDScriptに組み込まれている多くの関数は、計算を行い、新しい値を返します。 たとえば、[code]round()[/code] 関数は 10 進数を引数として受け取り、最も近い桁に丸められた新しい数値を返します。
nl: Veel functies in GDScript voeren berekeningen uit en geven een nieuwe waarde terug. Bijvoorbeeld, de functie [code]round()[/code] neemt een kommagetal als argument en geeft je een nieuw getal terug, afgerond op het dichtstbijzijnde geheel getal.
pt_br: Muitas funções já incorporadas no GDScript fazem cálculos e retornam um novo valor. Por exemplo, a função [code]round()[/code] recebe um número decimal como argumento e retorna um novo número arredondado para o dígito mais próximo.
ru: Многие функции, встроенные в GDScript, производят вычисления и возвращают новые значения. Напрмер, функция [code]round()[/code] принимает двоичную дробь в качестве аргумента и возвращает вам новое число — результат округления аргумента до ближайшего целого числа.
tr: GDScript'in içinde yerleşik olarak gelen birçok fonksiyon, hesaplamalar yapar ve geriye yeni bir değer döndürür. Örneğin, [code]round()[/code] (yuvarla) fonksiyonu, girdi değişken olarak ondalık bir sayı alır ve geriye, bunun en yakın basamağına yuvarlanmış yeni bir sayı verir.
zh_hans: GDScript 会自带内置的函数，有些能进行计算并返回一个新值。 例如，[code]round()[/code] 函数以一个小数为参数，返回一个四舍五入的整数。

source: Imagine you have a game where you track the player's health as a percentage, a decimal number going from [code]0.0[/code] to [code]100.0[/code]. When displaying the health on the interface, you don't want to show the decimal part. In that case, you may use the [code]round()[/code] function, like so.
de: Stell dir vor, du hast ein Spiel, in dem du das Leben des Spielers als Prozentsatz verfolgst, eine Dezimalzahl, die von [code]0.0[/code] bis [code]100.0[/code] reicht. Wenn du das Leben auf der Benutzeroberfläche anzeigst, möchtest du den Dezimalteil nicht anzeigen. In diesem Fall kannst du die Funktion [code]round()[/code] wie folgt verwenden.
fr: Imaginez que vous ayez un jeu où vous suivez la santé du joueur sous forme de pourcentage, un nombre décimal allant de [code]0.0[/code] à [code]100.0[/code]. Lors de l'affichage de la santé sur l'interface, vous ne voulez pas montrer la partie décimale. Dans ce cas, vous pouvez utiliser la fonction [code]round()[/code], comme ceci.
it: Immaginate di avere un gioco in cui la salute del giocatore è indicata in percentuale, un numero decimale che va da [code]0,0[/code] a [code]100,0[/code]. Quando si visualizza la salute sull'interfaccia, non si vuole mostrare la parte decimale. In questo caso, si può usare la funzione [code]round()[/code], in questo modo.
ja: プレイヤーの体力を [code]0.0[/code] から [code]100.0[/code] までの 10 進数でパーセンテージで追跡するゲームがあるとします。 インターフェイスに正常性を表示する場合、小数部分は表示しません。その場合は、次のように [code]round()[/code] 関数を使用できます。
nl: Stel bijvoorbeeld dat je een spel hebt waarin je de gezondheid van de speler bijhoudt als een percentage, een kommagetal dat loopt van [code]0.0[/code] tot [code]100.0[/code]. Wanneer je de gezondheid op de interface weergeeft, wil je het decimale gedeelte niet tonen. In dat geval kun je de functie [code]round()[/code] gebruiken, als volgt.
pt_br: Imagine que você tem um jogo onde você acompanha a vida do jogador como uma porcentagem, um número decimal que vai de [code]0.0[/code] até [code]100.0[/code]. Ao exibir a vida na tela, você não quer mostrar a parte decimal do número. Nesse caso, você pode usar a função [code]round()[/code], assim.
ru: Представьте, что у вас есть игра, в которой вы отслеживаете здоровье игрока в процентах — десятичной дроби от [code]0.0[/code] до [code]100.0[/code]. При отображении здоровья в интерфейсе вы не хотите показывать дробную часть. В этом случае, вы можете использовать функцию [code]round()[/code], например, так.
tr: Oyuncunun sağlığını yüzde olarak takip ettiğiniz bir oyununuz olduğunu düşünün; [code]0.0[/code] ile [code]100.0[/code] arasında değişen ondalık bir sayı. Sağlığı arayüzde görüntülerken, ondalık kısmı göstermek istemezsiniz. Bu durumda, [code]round()[/code] fonksiyonunu aşağıdaki gibi kullanabilirsiniz.
zh_hans: 想象一下，你在做一个游戏，要用百分比的形式跟踪玩家的血量，这是一个从 [code]0.0[/code] 到 [code]100.0[/code] 的小数字。 在游戏界面上显示血量时，你不想显示出小数部分。在这种情况下，可以像这样使用 [code]round()[/code] 函数。

source: Notice how we assign the result of the function call to a variable. Because the [code]round()[/code] function returns a [i]new[/i] value, we need to either store the result or use the value immediately. Above, we assigned it to a variable, but you could also do the following.
de: Beachte, wie wir das Ergebnis des Funktionsaufrufs einer Variablen zuweisen. Da die Funktion [code]round()[/code] einen [i]neuen[/i] Wert zurückgibt, müssen wir das Ergebnis speichern. Also weisen wir das Ergebnis einer Variablen zu.
es: Observa cómo asignamos el resultado de la llamada de función a una variable. Como la función [code]round()[/code] devuelve un [i]nuevo[/i] valor, necesitamos almacenar el resultado o usar el valor inmediatamente. Arriba, lo asignamos a una variable, pero también podrías hacer lo siguiente.
fr: Remarquez comment nous assignons le résultat de l'appel de la fonction à une variable. Comme la fonction [code]round()[/code] renvoie une [i]nouvelle[/i] valeur, nous devons stocker le résultat ou l'utiliser immédiatement. Ci-dessus, nous avons assigné le résultat à une variable, mais vous pourriez également faire ce qui suit.
it: Nota bene come assegniamo il risultato della funzione ad una variabile. Questo poiché la funzione [code]round()[/code] riporta un [i]nuovo[/i] valore di cui dobbiamo o conservare il risultato o usare immediatamente. Sopra, lo abbiamo assegnato ad una variabile, ma potresti anche fare così.
ja: 関数呼び出しの結果を変数に代入する方法に注目してください。[code]round()[/code]関数は[i]新しい[/i]値を返すため、結果を保存するか、値をすぐに使用する必要があります。 上記では変数に代入しましたが、次のこともできます。
nl: Merk op hoe we het resultaat van de functieaanroep toewijzen aan een variabele. Omdat de functie [code]round()[/code] een [i]nieuwe[/i] waarde teruggeeft, moeten we het resultaat opslaan of de waarde onmiddellijk gebruiken. Hierboven hebben we het toegewezen aan een variabele, maar je zou ook het volgende kunnen doen.
pt_br: Observe como atribuímos o resultado da chamada de função a uma variável. Como a função [code]round()[/code] retorna um [i]novo[/i] valor, precisamos armazenar o resultado ou usar o valor imediatamente. Acima, nós o atribuímos a uma variável, mas você também pode fazer o seguinte.
ru: Обратите внимание, как мы присваиваем результат выполнения функции переменной. Поскольку функция [code]round()[/code] возвращает [i]новое[/i] значение, нам нужно либо сохранить результат, либо сразу использовать его. Выше мы присвоили его переменной, но можно поступить и следующим образом.
tr: Fonksiyon çağrısının sonucunu bir değişkene atama şeklimize dikkat edin. [code]round()[/code] fonksiyonu [i]yeni[/i] bir değeri dönderdiği için, sonucu saklamamız ya da değeri hemen kullanmamız gerekir. Yukarıda bunu bir değişkene atadık, ancak aşağıdakileri de yapabilirsiniz.
zh_hans: 请注意是如何将函数调用的结果赋值给变量的。因为 [code]round()[/code] 函数返回了一个 [i]新[/i] 的值，我们要么得存储它，或者立即使用这个值。 在上面的例子里，我们将结果赋值给了一个变量，但你也可以像下面这样做。

source: The [code]lerp()[/code] function, short for [i]linear interpolate[/i], calculates and returns a weighted average between two values. It takes three arguments: the two values to average and a value between [code]0.0[/code] and [code]1.0[/code] to skew the result. In game programming, it's used to animate things moving towards a target with a single line of code.
de: Die Funktion [code]lerp()[/code], kurz für [i]linear interpolate[/i](lineare Interpolation), berechnet und gibt einen gewichteten Durchschnitt zwischen zwei Werten zurück. Es werden drei Argumente benötigt: die beiden Werte zum Mittelwert und ein Wert zwischen [code]0.0[/code] und [code]1.0[/code], um das Ergebnis zu verzerren. Es ist eine beliebe Funktion in Spielen, um Dinge mit einer Codezeile zu animieren, die sich auf ein Ziel zubewegen.
es: La función [code]lerp()[/code] (abreviatura del inglés [i]linear interpolate[/i] que significa "interpolación lineal") calcula y devuelve un promedio ponderado entre dos valores. Esta toma tres argumentos: los dos valores que hay que promediar y un valor entre [code]0.0[/code] y [code]1.0[/code] para sesgar el resultado. Es popular en los juegos para animar cosas que se mueven hacia un objetivo con una sola línea de código.
fr: La fonction [code]lerp()[/code] (abréviation du terme en anglais [i]linear interpolate[/i] qui veut dire « interpolation linéaire ») calcule et renvoie une moyenne pondérée entre deux valeurs. Elle prend trois arguments : les deux valeurs pour faire la moyenne et une valeur entre [code]0.0[/code] et [code]1.0[/code] pour biaiser le résultat. Dans la programmation de jeux, elle est utilisée pour animer des choses qui se déplacent vers une cible avec une seule ligne de code.
it: La funzione [code]lerp()[/code], diminutivo di [i]interpolazione lineare[/i], calcola e riporta la media ponderata tra due valori. Questa necessita di tre argomenti: i primi due sono i valori da interpolare e l'ultimo è un valore compreso tra [code]0.0[/code] e [code]1.0[/code] che determina quanto velocemente avviene l'interpolazione. Nella programmazione di videogiochi, viene spesso utilizzato per animare cose che si muovono verso un obiettivo con una singola linea di codice.
ja: [i]線形補間 (linear interpolate)[/i]の略である [code]lerp()[/code] 関数は、2 つの値の間の加重平均を計算して返します。 平均する 2 つの値と、結果を歪める [code]0.0[/code] と [code]1.0[/code] の間の値の 3 つの引数を取ります。 ゲームプログラミングでは、1行のコードでターゲットに向かって移動するものをアニメーション化するために使用されます。
nl: De functie [code]lerp()[/code], kort voor [i]lineaire interpolatie[/i], berekent een gewogen gemiddelde tussen twee waarden en geeft dit terug. De functie heeft drie argumenten nodig: de twee waarden die gemiddeld moeten worden en een waarde tussen [code]0.0[/code] en [code]1.0[/code] om het resultaat scheef te trekken. In gameprogrammering wordt het gebruikt om dingen die naar een doel bewegen te animeren met een enkele regel code.
pt_br: A função [code]lerp()[/code], abreviação de [i]interpolação linear[/i], calcula e retorna uma média entre dois valores. São necessários três argumentos: os dois valores para a média e um valor entre [code]0.0[/code] e [code]1.0[/code] para distorcer o resultado. Em programação para jogos, isso é usado para animar coisas que se movem em direção a um alvo com uma única linha de código.
ru: Функция [code]lerp()[/code] (сокращение от [i]линейная интерполяция[/i]) вычисляет и возвращает средневзвешенное значение между двумя величинами. Она принимает три аргумента: два значения для усреднения и значение между [code]0.0[/code] и [code]1.0[/code] в качестве смещения результата. В программировании игр эта функция используется чтобы анимировать движущиеся к цели объекты в одну строчку кода.
tr: [i]linear interpolate[/i] (doğrusal ara değer hesaplama) ifadesinin kısaltması olan [code]lerp()[/code] fonksiyonu, iki değer arasında ağırlıklı bir ortalama hesaplayıp döndürür. Üç girdi değişkeni alır: arası bulunacak iki değer ve sonuca eğim vermek için [code]0.0[/code] ile [code]1.0[/code] arasında bir değer. Oyun programlamada, bir hedefe doğru hareket eden şeyleri, tek bir kod satırıyla canlandırmak için kullanılır.
zh_hans: [code]lerp()[/code] 函数是 [i]linear interpolate[/i] （线性插值）的缩写，计算并返回两个值之间的加权平均值。 它需要三个参数：要平均的两个值，和一个 [code]0.0[/code] 和 [code]1.0[/code] 之间的值来偏移结果（和小的值更近还是和大的更近）。 在游戏编程中，用它只需一行代码，就能使物体向一个目标运动起来。

source: Every frame, the code calculates a position somewhere between the turtle and the mouse cursor. The [code]lerp()[/code] function takes care of everything. It's not the most robust approach for smooth movement, as you'll learn in the future, but it's a helpful function nonetheless.
de: In jedem Frame berechnet der Code eine Position irgendwo zwischen der Schildkröte und dem Mauszeiger. Die Funktion [code]lerp()[/code] kümmert sich um alles. Es ist nicht der robusteste Ansatz für eine reibungslose Bewegung, wie du in Zukunft lernen wirst, aber es ist dennoch eine hilfreiche Funktion.
es: En cada fotograma, el código calcula una posición en algún lugar entre la tortuga y el cursor del mouse. La función [code]lerp()[/code] se encarga de todo. No es el enfoque más robusto para un movimiento suave, como aprenderás en el futuro, pero aún así es una función muy útil.
fr: À chaque image, le code calcule une position quelque part entre la tortue et le curseur de la souris. La fonction [code]lerp()[/code] s'occupe de tout. Ce n'est pas l'approche la plus robuste pour un mouvement fluide, comme vous l'apprendrez plus tard, mais c'est néanmoins une fonction utile.
it: Ogni frame, il codice calcola la posizione circa la tartaruga e il cursore del mouse. La funzione [code]lerp()[/code] fa tutto il necessario. Non è l'approccio perfetto per un movimento fluido, come imparerai in futuro esistono modi migliori, ma è comunque una funzione molto utile.
ja: フレームごとに、カメとマウスカーソルの間の位置が計算されます。[code]lerp()[/code]関数がすべてを処理します。 これは、後で学ぶように、スムーズな動きのための最も堅牢なアプローチではありませんが、それでも便利な機能です。
nl: Elk frame berekent deze code een positie ergens tussen de schildpad en de muisaanwijzer. De functie [code]lerp()[/code] regelt alles. Het is niet de meest robuuste aanpak voor vloeiende beweging, zoals je in de toekomst zult leren, maar het is niettemin een nuttige functie.
pt_br: A cada frame, o código calcula uma posição em algum lugar entre a tartaruga e o cursor do mouse. A função [code]lerp()[/code] faz isso tudo por ela mesma. Não é a abordagem mais robusta para movimentos suaves, como você vai aprender no futuro, mas ainda assim é uma função útil.
ru: Каждый кадр код вычисляет позицию между черепахой и курсором мыши. Функция [code]lerp()[/code] здесь берёт всю работу на себя. Это не самый надёжный способ реализации плавного перемещения, как вы убедитесь в будущем, тем не менее, это не делает функцию менее полезной.
tr: Kod, her oyun karesinde, kaplumbağa ile fare imleci arasında bir yerde bir konum hesaplar. [code] lerp()[/code] fonksiyonu her şeyi halleder. İleride öğreneceğiniz gibi, pürüzsüz bir hareket için en sağlam yaklaşım bu değildir, ancak yine de yararlı bir fonksiyondur.
zh_hans: 每一帧，代码都会计算出某个小海龟和鼠标光标之间的位置。 [code]lerp()[/code] 函数负责处理所有的过程。 如果你继续深入学习下去，会发现这并不是实现平滑运动的最强大的方法，但它仍然是一个很有用的函数。

source: You can make [i]your[/i] functions return values. To make a function return a value, you use the [code]return[/code] keyword followed by the value in question. In previous lessons, we had characters walking on grids. And for those practices, you were working directly with cell coordinates. Well, cell coordinates don't correspond to positions on the screen. To find the center of any cell on the screen, we need to convert the cell's coordinates to a position on the screen, in pixels.
de: Du kannst festlegen, dass [i]deine[/i]-Funktionen Werte zurückgeben. Damit eine Funktion einen Wert zurückgibt, verwendest du das Schlüsselwort [code]return[/code] gefolgt von dem betreffenden Wert. In früheren Lektionen hatten wir Charaktere, die auf einem Koordinatensystem liefen. Und für diese Praktiken arbeitetest du direkt mit Zellkoordinaten. Nun, Zellenkoordinaten entsprechen nicht den Positionen auf dem Bildschirm, daher müssen wir Zellenpositionen in Bildschirmpositionen konvertieren.
fr: Vous pouvez faire en sorte que [i]vos[/i] fonctions renvoient des valeurs. Pour qu'une fonction renvoie une valeur, vous utilisez le mot-clé [code]return[/code] suivi de la valeur en question. Dans les leçons précédentes, nous avions des personnages qui marchaient sur des grilles. Et pour ces pratiques, vous travailliez directement avec les coordonnées des cases. Eh bien, les coordonnées des cases ne correspondent pas aux positions sur l'écran. Pour trouver le centre d'une cellule sur l'écran, nous devons convertir les coordonnées de la cellule en une position sur l'écran, en pixels.
it: È possibile far sì che le [i]proprie[/i] funzioni restituiscano dei valori. Per far sì che una funzione restituisca un valore, si usa la parola chiave [code]return[/code] seguita dal valore in questione. Nelle lezioni precedenti, i personaggi camminavano su griglie. Per queste pratiche, si lavorava direttamente con le coordinate delle celle. Le coordinate delle celle non corrispondono a posizioni sullo schermo. Per trovare il centro di una cella sullo schermo, dobbiamo convertire le coordinate della cella in una posizione sullo schermo, in pixel.
ja: 関数[i]が[/i]値を返すようにすることができます。 関数に値を返させるようにするには、[code]return[/code] キーワードを使用し、その後に対象の値を指定します。 以前のレッスンでは、グリッドの上を歩くキャラクターがいました。 これらの演習では、セル座標を直接操作していました。 セルの座標は画面上の位置に対応していません。画面上のセルの中心を見つけるには、セルの座標を画面上の位置(ピクセル単位)に変換する必要があります。
nl: Je kunt ook je [i]eigen[/i] functies waarden laten teruggeven. Om een functie een waarde te laten teruggeven, gebruik je het sleutelwoord [code]return[/code] gevolgd door de waarde in kwestie. In de vorige lessen hebben we personages over rasters laten lopen. En voor die oefeningen werkte je rechtstreeks met celcoördinaten. Nou, celcoördinaten komen niet overeen met posities op het scherm. Om het middelpunt van een cel op het scherm te vinden, moeten we de coördinaten van de cel omzetten in een positie op het scherm, in pixels.
pt_br: Você pode fazer com que [i]suas[/i] funções retornem valores. Para fazer uma função retornar um valor, você usa a palavra-chave [code]return[/code] seguida do valor em questão. Nas lições anteriores, tínhamos personagens andando em grades (ou tabuleiros). E naquelas práticas, você estava trabalhando diretamente com as coordenadas das células. Bem, as coordenadas das células não correspondem às posições na tela. Para encontrar o centro de uma célula na tela, precisamos converter as coordenadas da célula para uma posição na tela, em pixels.
ru: Вы можете создать [i]свои[/i] функции, возвращающие значения. Чтобы заставить функцию вернуть значение, используйте ключевое слово [code]return[/code], а затем укажите желаемое значение. В предыдущих уроках мы работали с персонажами, перемещающимися по сеткам. В тех упражнениях вы работали напрямую с координатами ячеек. Так вот координаты ячейки отличаются от позиций на экране, поэтому нам нужно конвертировать позиции ячеек в позиции на экране.
tr: Siz de [i]kendi[/i] fonksiyonlarınızdan değerler döndürebilirsiniz. Bir fonksiyonun bir değer döndürmesini sağlamak için, [code]return[/code] anahtar kelimesini ve ardından söz konusu değeri kullanırsınız. Önceki derslerde, ızgaralar üzerinde yürüyen karakterlerimiz vardı. Ve onların alıştırmalarında, doğrudan hücre koordinatlarıyla çalışıyordunuz. Aslına bakarsanız, hücre konumları ekran üzerindeki konumlara tam olarak karşılık gelmez. Ekrandaki herhangi bir hücrenin merkezini bulmak için, hücrenin konumunu ekrandaki bir konuma, piksel cinsinden, dönüştürmemiz gerekir.
zh_hans: 你可以让 [i]你的[/i] 函数也能返回值。 要让函数返回值，请使用 [code]return[/code]（返回） 关键字，后跟要返回的值。 在之前的课程中，我们成功让角色能在棋盘网格上行走。 在那些练习中，你直接使用的是网格本身的单元坐标。 但是呢，单元格坐标和屏幕上的位置并不是对应的，所以我们需要将单元格位置转换为屏幕上的像素位置。
