Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-7-member-variables.po
Languages: hu, it, ja, pl, pt, tr, zh_hans

source: In this lesson, we take a first look at variables. In games, you need to keep track of many values that change over time: - The player's score. - Every character or enemy's health. - The last checkpoint. And so much more. You need to store, retrieve, and update those values. We call those values [i]variables[/i]. Variables are labels you use to keep track of values that vary over time. Here's an example of a variable tracking a character or monster's health.
hu: Ebben a leckében megismerkedünk a változókkal. A játékokban sok értéket kell követned, ami változik az idő folyamán: - A játékos pontszáma. - Minden karakter vagy ellenfél életerejét. - A legutóbbi ellenőrzőpontot. És még sok mást. Tárolnod, előhívnod és módosítanod is kell ezeket az értékeket.. We call those values [i]variables[/i]. Variables are labels you use to keep track of values that vary over time. Here's an example of a variable tracking a character or monster's health.
it: In questa lezione, iniziamo a dare un primo sguardo alle variabili. Nei videogiochi, devi tenere conto di molte cose che cambiano con il tempo: - Il punteggio del giocatore. - La vita di ogni personaggio o nemico. - L'ultimo checkpoint. E molto altro ancora. Devi conservare, recuperare e aggiornare quei valori. Chiamiamo quei valori [i]variabili[/i]. Le variabili sono come etichette che usiamo per tenere conto di valori che variano con il tempo. Qui un esempio di una variabile che monitora la vita di un mostro o di un personaggio.
ja: このレッスンでは、まず変数を見てみましょう。 ゲームでは、時間の経過とともに変化する多くの値を追跡する必要があります。 - プレーヤーのスコア。 - すべてのキャラクターまたは敵の健康状態。 - 最後のチェックポイント。 他にもたくさんあります。 これらの値を保存、取得、更新する必要があります。 これらの値を [i]変数[/i] と呼びます。 変数は、時間の経過とともに変化する値を追跡するために使用するラベルです。 以下は、キャラクターまたはモンスターの健康状態を追跡する変数の例です。
pl: W tej lekcji na warsztat weźmiemy w pierwszej kolejności zmienne. W grach musisz śledzić wiele wartości, które zmieniają się w czasie: - Wynik gracza. - Zdrowie każdej postaci lub wroga. - Ostatni punkt kontrolny. A to nie wszystkie z nich. Musisz przechowywać, pobierać i aktualizować te wartości. Nazywamy te wartości [i]zmiennymi[/i]. Zmienne to etykiety używane do śledzenia wartości zmieniających się w czasie. Oto przykład zmiennej śledzącej zdrowie postaci lub potwora.
pt: Nesta lição, damos uma primeira olhada nas variáveis. Nos jogos, precisa monitorar muitos valores que mudam ao longo do tempo: - A pontuação do jogador. - A saúde de cada personagem ou inimigo. - O último ponto de verificação. E muito mais. Deve armazenar, recuperar e atualizar esses valores. Chamamos esses valores [i]variables[/i]. Variáveis são rótulos que usa para monitorar os valores que variam ao longo do tempo. Aqui está um exemplo de uma variável que rasteia a saúde de uma personagem ou um monstro.
tr: Bu ders, değişkenlere ilk bakışımız olacak. Oyunlarda, zamanla değişen pek çok değeri takip etmeniz gerekir. - Oyuncunun puanı. - Her karakter ya da düşmanın can miktarı. - Son kayıt noktası. Ve çok daha fazlası. Bunların değerlerini bir yerde kaydetmeniz, oradan alıp kullanmanız, ve güncelleyip değiştirmeniz gerekir. Bu tür değerlere [i]değişken[/i] adını veriyoruz. Değişkenler, zaman içinde değişen değerleri takip etmek için kullanacağınız etiketlerdir. Mesela bu örnekteki değişken, bir karakter ya da canavarın sağlığını takip eder.
zh_hans: 在本课中，我们首先了解变量。 在游戏中，您需要跟踪许多随时间变化的值： - 玩家的分数。 - 每个角色或敌人的健康。 - 最后一个检查点。 还有更多。您需要存储、检索和更新这些值。 我们将这些值称为 [i] 变量 [/i]。变量是用于跟踪随时间变化的值的标签。这是一个跟踪角色或怪物健康状况的变量示例。

source: The line above defines a new variable named [code]health[/code] and assigns it a starting value of [code]100[/code] (that's what the equal sign does, more on that below). Function parameters, which you saw in the previous lesson, are another example of variables.
hu: A fenti sor létrehoz egy új, [code]health[/code] nevű változót és megad neki egy értéket: [code]100[/code] (erre van az egyenlőségjel, erről bővebben majd lentebb). A függvény paraméterek, amiket az előző leckében láttál, egy másik példája a változóknak.
it: La riga sopra definisce una nuova variabile chiamata [code]health[/code] e gli assegna un valore iniziale di [code]100[/code] (questa è la funzione del simbolo di uguaglianza che verrà trattato anche successivamente). I parametri della funzione, che hai visto nella lezione precedente, sono un altro esempio di variabili.
ja: 上の行は、[code]health[/code] という名前の新しい変数を定義し、それに開始値 [code]100[/code] を割り当てます (これは等号の働きです。詳しくは後述します)。 前のレッスンで見た関数パラメーターも変数の例です。
pl: Powyższy wiersz definiuje nową zmienną o nazwie [code]health[/code] i przypisuje jej wartość początkową [code]100[/code] (to właśnie robi znak równości, więcej na ten temat poniżej). Parametry funkcji, z którymi zapoznałeś się w poprzedniej lekcji, to kolejny przykład zmiennych.
pt: A linha acima define uma nova variável chamada [code]health[/code] e atribui nela um valor inicial de [code]100[/code] (é isso que o sinal de igual faz, vamos falar mais sobre isso mais abaixo). Parâmetros de função, que viu na lição anterior, são outro exemplo de variáveis.
tr: Yukarıdaki satır, [code]health[/code] (sağlık) isimli bir değişken tanımlıyor ve buna, [code]100[/code] başlangıç değerini atıyor (eşitlik işaretinin amacı bu, aşağıda fazlasını göreceksiniz). Önceki derste gördüğünüz, bir fonksiyonun alınan değişkenleri de birer değişken örneğidir.
zh_hans: 上面的行定义了一个名为 [code]health[/code] 的新变量，并为它分配了一个起始值 [code]100[/code]（这就是等号的作用，下面会详细介绍）。 您在上一课中看到的函数参数是变量的另一个示例。

source: In this lesson, we start using variables built into Godot. They're a particular kind called [i]member variables[/i]. Member variables are values attached to a game entity. They're useful properties like the [code]position[/code], [code]rotation[/code], and [code]scale[/code] of a character. In a previous lesson, we saw how we could use the [code]rotate()[/code] function to rotate our character.
hu: Ebben a leckében a Godot beépített változóit fogjuk használni. Ezeknek a a különleges változóknak [i]member változó[/i] a neve. A member változók a játékban lévő dolgokhoz rendelt értékek. hasznos értékek, mint például a karakter [code]pozíciója[/code], [code]elforgatása[/code], vagy [code]skálázása[/code]. Az előző leckében már láttuk, hogyan használhatjuk a [code]rotate()[/code] függvényt a karakterünk elforgatására.
it: In questa lezione, iniziamo ad usare variabili preimpostate in Godot. Queste sono una categoria particolare di variabili, chiamate [i]variabili membro[/i]. Le variabili membro sono valori attaccati ad un elemento del gioco. Sono proprietà utili come la [code]position[/code], [code]rotation[/code] e [code]scale[/code] (ovvero posizione, rotazione e dimensione) di un personaggio. In una lezione precedente, abbiamo visto come possiamo usare la funzione [code]rotate()[/code] per ruotare il nostro personaggio.
ja: このレッスンでは、Godot に組み込まれた変数の使用を開始します。 これらは、[i]メンバー変数[/i]と呼ばれる特別な種類です。 メンバー変数は、ゲーム エンティティに関連付けられた値です。 これらは、キャラクターの [code]position[/code]、[code]rotation[/code]、[code]scale[/code] などの便利なプロパティです。 前回のレッスンでは、[code]rotate()[/code] 関数を使用してキャラクターを回転させる方法を説明しました。
pl: W tej lekcji zaczniemy używać zmiennych wbudowanych w Godota. Jest to szczególny rodzaj zmiennych nazywany [i]zmiennymi składowymi[/i]. Zmienne składowe to wartości dołączone do narzędzia tworzącego gry. Są to przydatne właściwości, takie jak [code]position[/code] (pozycja), [code]rotation[/code] (obrót) czy [code]scale[/code] (skala). W poprzednich lekcjach wykorzystywaliśmy już funkcję [code]rotate()[/code] do obracania naszej postaci.
pt: Nessa lição, vamos começar a usar variáveis já incorporadas na Godot. São um tipo particular de variáveis chamadas [i]variáveis membros[/i]. Variáveis membros são valores anexados a uma entidade de um jogo. São propriedades úteis como [code]position[/code], [code]rotation[/code] e [code]scale[/code] de uma personagem. Numa lição anterior, vimos como poderíamos usar a função [code]rotate()[/code] para rotacionar a nossa personagem.
tr: Bu derste, Godot içine gömülü olan değişkenleri kullanmaya başlıyoruz. Bunların isimleri özel olarak [i]üye değişkenler[/i]'dir. Üye değişkenler, bir oyun varlığına iliştirilmiş değerlerdir. Bir karakterin konumu, [code]position[/code], dönme miktarı, [code]rotation[/code], ve ölçeklendirmesi, [code]scale[/code], gibi yararlı özelliklerdir. Önceki derste, [i]rotate()[/i] fonksiyonu ile karakterimizi nasıl döndürebileceğimizi gördük.
zh_hans: 在本课中，我们开始使用 Godot 内置的变量。 它们是一种特殊的类型，称为 [i] 成员变量 [/i]。 成员变量是附加到游戏实体的值。 它们是有用的属性，例如字符的 [code]position[/code]、[code]rotation[/code] 和 [code]scale[/code]。 在上一课中，我们看到了如何使用 [code]rotate()[/code] 函数来旋转我们的角色。

source: This function increases or decreases the value of the entity's [code]rotation[/code] member variable. Say we want to reset the rotation to [code]0[/code] and make the character upright. Using the [code]rotate()[/code] function can prove difficult: you need to know the character's exact current angle to cancel it out. It's much easier to use the member variable rather than the function. The following code assigns the value [code]0[/code] to the character's rotation, resetting its angle and making it upright.
hu: Ez a függvény csökkenti vagy növeli a karakter [code]rotation[/code] member változójának értékét. Tegyük fel, hogy szeretnénk [code]0[/code]-ra állítani az elforgatást, hogy a karakter egyenesen álljon. A [code]rotate()[/code] függvényt használva ez problémás lehet: tudnod kell a karakter jelenlegi elfordulási szögét, hogy vissza tudd forgatni. Sokkal egyszerűbb a member változó használata függvény helyett. Az alábbi kód hozzárendeli a [code]0[/code] értéket, a karakter elforgatásához, ezzel törölve az elforgatást és egyenesbe állítva azt.
it: Questa funzione aumenta e diminuisce il valore della variabile membro [code]rotation[/code] dell'elemento. Se per esempio volessimo porre la rotazione di nuovo a [code]0[/code] per rendere il personaggio dritto. Usare la funzione [code]rotate()[/code] per questo scopo potrebbe risultare scomodo: dovresti sapere l'esatta rotazione corrente del personaggio per poi annullarla. Risulta molto più facile usare la variabile membro al posto della funzione. Il seguente codice assegna il valore [code]0[/code] alla rotazione del personaggio, resettando il suo angolo e rendendolo dritto.
ja: この関数は、エンティティの [code]rotation[/code] メンバー変数の値を増減します。 回転を [code]0[/code] にリセットして、キャラクターを直立させたいとします。 [code]rotate()[/code] 関数の使用は難しい場合があります。角度を打ち消すには、キャラクターの現在の角度を正確に知る必要があります。 関数よりもメンバー変数を使用する方がはるかに簡単です。 次のコードは、値 [code]0[/code] をキャラクターの回転に割り当て、角度をリセットして直立させます。
pl: Funkcja ta zwiększa lub zmniejsza wartość zmiennej składowej [code]rotation[/code] odpowiadającej za obrót. Załóżmy, że chcemy zresetować obrót do [code]0[/code] i ustawić nasza postać w pozycji pionowej. Użycie funkcji [code]rotate()[/code] może okazać się trudne: musimy w końcu znać dokładny bieżący kąt obrotu, aby go wyzerować. Dużo łatwiej jest używać zmiennej składowej niż funkcji. Poniższy kod przypisuje wartość [code]0[/code] do obrotu postaci, resetując jej kąt i ustawiając robota w pozycji pionowej.
pt: Esta função aumenta ou diminui o valor da variável membro [code]rotation[/code] da entidade. Digamos que queremos redefinir a rotação para [code]0[/code] e deixar a personagem na vertical. Usar a função [code]rotate()[/code] para isso pode ser difícil: precisaria saber o ângulo atual exato da personagem. É muito mais fácil usar a variável membro em vez da função. O código a seguir atribui o valor [code]0[/code] na rotação da personagem, por redefinir o ângulo dele e fazendo-o ficar na vertical.
tr: Bu fonksiyon, bir varlığın [code]rotation[/code] (dönme) üye değişkeninin değerini arttırıp azaltır. Diyelim ki, karakterin dönmesini [code]0[/code] yapmak ve yukarı doğru durmasını sağlamak istiyoruz. Bu amaçla sürekli [code]rotate()[/code] fonksiyonunu kullanmak zor olacaktır: Karakterin dönmesini sıfırlamak için, şimdiki tam dönme açısını bilmek zorundasınız. Fonksiyon yerine bir üye değişken kullanmak çok daha kolaydır. Aşağıdaki kod, karakterin dönüşüne [code]0[/code] değerini veriyor, ve onun açısını sıfırlayıp yukarı bakmasını sağlıyor.
zh_hans: 此函数增加或减少实体的 [code]rotation[/code] 成员变量的值。 假设我们要将旋转重置为 [code]0[/code] 并使角色直立。 使用 [code]rotate()[/code] 函数可能很困难：您需要知道角色的确切当前角度才能取消它。 使用成员变量比使用函数要容易得多。 以下代码将值 [code]0[/code] 分配给角色的旋转，重置其角度并使其直立。

source: Notice how we use the equal sign ([code]=[/code]) to change the value of a variable.
hu: Figyeld meg, hogy az egyenlőségjelet ([code]=[/code]) használjuk, hogy módosítsuk a változó értékét.
it: Nota bene come usiamo il segno di uguaglianza ([code]=[/code]) per cambiare il valore di una variabile.
ja: 等号 ([code]=[/code]) を使用して変数の値を変更する方法に注目してください。
pl: Zwróć uwagę, że używamy tutaj znaku równości ([code]=[/code]) do zmiany wartości zmiennej.
pt: Observe como usamos o sinal de igual ([code]=[/code]) para mudar o valor de uma variável.
tr: Değişkenin değerini değiştirmek için, eşittir işaretini, ([code]=[/code]) nasıl kullandığımıza dikkat edin.
zh_hans: 请注意我们如何使用等号 ([code]=[/code]) 来更改变量的值。

source: What's a variable?
hu: Mi az a változó?
it: Cos'è una variabile?
ja: 変数とは何ですか?
pl: Czym jest zmienna?
pt: O que é uma variável?
tr: Bir değişken, nedir?
zh_hans: 什么是变量？

source: Variables are labels you use to access values that change over time. You can also use them to put a name on a value you want to reuse throughout your code. It makes your code easier to read and to change.
hu: A változók olyan címkék, amikkel elérhetsz olyan értékeket, melyek változnak az idő múlásával. Arra is használhatod, hogy nevet adj olyan értékeknek, melyeket többször is szeretnél felhasználni a kódodban. Ezzel egyszerűbben olvasható és szerkeszthető lesz a kódod.
it: Le variabili come etichette che utilizzi per accedere a valori che cambiano con il tempo. Le puoi pure usare per mettere nomi a valori che vuoi riutilizzare nel tuo codice. Rende il tuo codice più facile da leggere e da cambiare in seguito.
ja: 変数は、時間の経過とともに変化する値にアクセスするために使用するラベルです。 これらを使用して、コード全体で再利用したい値に名前を付けることもできます。 これにより、コードが読みやすく、変更しやすくなります。
pl: Zmienne to etykiety, których używasz, aby uzyskać dostęp do wartości zmieniających się w czasie. Możesz również używać ich do przypisania nazwy wartościom, których będziesz chciał użyć ponownie w swoim kodzie. Nazywanie ich ułatwia czytanie i zmienianie kodu.
pt: Variáveis são nomes que usa para acessar valores que mudam ao longo do tempo. Também pode usar as variáveis para pôr um nome num valor que deseja reutilizar em todo o código. Isso faz o seu código mais fácil de ler e alterar.
tr: Değişkenler, zamanla değişen değerlere erişmek için kullandığınız etiketlerdir. Ayrıca, kodun her yerinde kullanmak istediğiniz bir değere isim vermek içinde kullanabilirsiniz. Bu şekilde kodunuzu, daha okunabilir ve değiştirmesi kolay hale getirirsiniz.
zh_hans: 变量是用于访问随时间变化的值的标签。 您还可以使用它们为要在整个代码中重用的值命名。 它使您的代码更易于阅读和更改。

source: A label you use to keep track of a value that can change.
hu: Egy címke amellyel követhetsz egy értéket, mely változhat.
it: Come un'etichetta che usi per tenere d'occhio un valore che può cambiare.
ja: 変化する可能性のある値を追跡するために使用するラベル。
pl: Etykietą używaną do śledzenia wartości, która może ulec zmianie.
pt: Um nome que usa para monitrar um valor que pode mudar.
tr: Değişebilen bir değeri takip etmek için kullandığınız bir etiket.
zh_hans: 用于跟踪可以更改的值的标签。

source: A function that varies over time.
hu: Egy függvény mely változik az idő múlásával.
it: Una funzione che varia con il tempo.
ja: 時間の経過とともに変化する機能。
pl: Funkcją, która zmienia się w czasie.
pt: Uma função que varia ao longo do tempo.
tr: Zaman içinde değişen bir fonksiyon.
zh_hans: 随时间变化的函数。

source: A decimal number.
hu: Egy törtszám.
it: Un numero decimale.
ja: 10 進数。
pl: Liczbą dziesiętną.
pt: Um número decimal.
tr: Bir ondalık sayı.
zh_hans: 一个十进制数。

source: Accessing sub-variables with the dot
hu: Alváltozók elérése a ponttal
it: Accedere sotto-variabili con un punto
ja: ドットを使用してサブ変数にアクセスする
pl: Dostęp do podzmiennych z wykorzystaniem kropki
pt: Acessando sub-variáveis com o sinal de ponto final
tr: Alt değişkenlere nokta ile erişmek
zh_hans: 使用点访问子变量

source: In video games, you will see many member variables that have sub-values. For example, the [code]position[/code] we mentioned has two coordinates: [code]x[/code] and [code]y[/code]. It's the same for the [code]scale[/code]: it has [code]x[/code] and [code]y[/code] sub-variables. They respectively control the horizontal and vertical size of the game entity. To access those X and Y sub-components, you add a dot (".") after the variable name. The code below places the entity at [code]200[/code] pixels on the x-axis and [code]250[/code] pixels on the y-axis.
it: Nei videogiochi, si vedono molte variabili membro che hanno dei sottovalori. Ad esempio, la [code]position[/code] di cui abbiamo parlato ha due coordinate: [code]x[/code] e [code]y[/code]. Lo stesso vale per [code]scale[/code]: ha le sottovariabili [code]x[/code] e [code]y[/code]. Esse controllano rispettivamente la dimensione orizzontale e verticale dell'entità di gioco. Per accedere alle sottovariabili X e Y, si aggiunge un punto (".") dopo il nome della variabile. Il codice seguente posiziona l'entità a [code]200[/code] pixel sull'asse x e a [code]250[/code] pixel sull'asse y.
ja: ビデオ ゲームでは、サブ値を持つメンバー変数が多数見られます。 たとえば、前述の [code]position[/code] には、[code]x[/code] と [code]y[/code] の 2 つの座標があります。 [code]scale[/code] についても同様です。[code]x[/code] および [code]y[/code] サブ変数があります。 これらはそれぞれ、ゲーム エンティティの水平サイズと垂直サイズを制御します。 これらの X および Y サブコンポーネントにアクセスするには、変数名の後にドット (「.」) を追加します。 以下のコードは、エンティティを X 軸の [code]200[/code] ピクセル、Y 軸の [code]250[/code] ピクセルに配置します。
tr: Video oyunlarında, alt değerlere sahip birçok üye değişken göreceksiniz. Örneğin, bahsettiğimiz konumun, [code]position[/code], iki koordinatı vardır: [code]x[/code] ve [code]y[/code]. Aynı şey ölçek, [code]scale[/code], için de geçerlidir: [code]x[/code] ve [code]y[/code] alt değişkenlerine sahiptir. Bunlar sırasıyla oyun varlığının yatay ve dikey boyutunu kontrol eder. Bu X ve Y alt bileşenlerine erişmek için, değişken adından sonra bir nokta (".") eklersiniz. Aşağıdaki kod, varlığı, x ekseninde [code]200[/code] ve y ekseninde [code]250[/code] piksel uzaklığa yerleştirir.

source: Notice how we use the equal sign ("=") to assign the numbers on the right to the sub-variables on the left. Unlike in maths, in computer programming, the equal sign ("=") does not mean "is equal to." Instead, it means "assign the result of the expression on the right to the variable on the left". We assign values so often in code that we prefer to reserve the equal sign for that.
hu: Figyeld meg, hogy az egyenlőségjelet ("=") használjuk, hogy a jobb oldalon lévő számot hozzárendeljük a bal oldalon lévő alváltozóhoz. A matekkal ellentétben, a programozásban az egyenlőségjel nem azt jhelenti, hogy "egyenlő". Helyette azt jelenti: "rendeld hozzá a jobb oldalon lévő kifejezés értéket a bal oldalon lévő változóhoz". A kódban olyan gyakran rendelünk értékeket változókhoz, hogy lefoglaltuk erre az egyenlőségjelet.
it: Nota come viene utilizzato il segno uguale ("=") per assegnare i numeri sulla destra alle sotto-variabili sulla sinistra. Al contrario della matematica, in programmazione informatica, il segno di uguaglianza ("=") non significa "è uguale a". Invece, significa "assegna il risultato dell'espressione sulla destra alla variabile a sinistra". Assegniamo valori così spesso programmando che preferiamo riservare il simbolo di uguaglianza per quello.
ja: 等号 「=」 を使用して、右側の数値を左側のサブ変数に割り当てる方法に注目してください。 数学とは異なり、コンピューター プログラミングでは、等号 「=」 は「に等しい」という意味ではありません。 代わりに、「右側の式の結果を左側の変数に代入する」ことを意味します。 コード内で値を割り当てることが非常に多いため、そのために等号を予約しておきます。
pl: Zwróć uwagę, że używamy znaku równości („=”), aby przypisać liczby po prawej stronie do podzmiennych po lewej stronie. W przeciwieństwie do matematyki, w programowaniu komputerowym znak równości („=”) nie oznacza „jest równy”. Zamiast tego oznacza „przypisz wynik wyrażenia po prawej stronie do zmiennej po lewej stronie”. Tak często przypisujemy wartości w kodzie, że woleliśmy zarezerwować na to znak równości.
pt: Observe como usamos o sinal de igual ("=") para atribuir os números que estão na direita para a sub-variável na esquerda. Ao contrário da matemática, na programação de computadores, o sinal de igual ("=") não significa "é igual a". Em vez disso, significa "atribuir o resultado da expressão da direita para a variável da esquerda". Atribuímos valores com tanta frequência no código que preferimos reservar o sinal de igual para esse propósito.
tr: Sağdaki sayıları soldaki alt değişkenlere atamak için eşittir işaretini ("=") nasıl kullandığımıza dikkat et. Matematikten farklı olarak, bilgisayar programcılığında, eşittir işareti ("=") "eşittir" anlamına gelmez. Bunun yerine, "sağdaki ifadenin sonucunu soldaki değişkene ata" anlamına gelir. Kodlarken o kadar sık değer ataması yaparız ki, eşittir işaretini bunun için ayırmayı tercih ederiz.
zh_hans: 请注意我们如何使用等号（“=”）将右侧的数字分配给左侧的子变量。 与数学不同，在计算机编程中，等号（“=”）并不意味着“等于”。 相反，它的意思是“将右侧表达式的结果分配给左侧的变量”。 我们在代码中经常赋值，因此我们更愿意为此保留等号。

source: In games, the Y-axis is positive going down
hu: Játékokban az Y tengely lefelé pozitív
it: Nei giochi, l'asse y è positiva andando verso il basso
ja: ゲームでは、Y 軸は下に行くほど正
pl: W grach oś Y schodzi dodanio w dół
pt: Nos jogos, o eixo Y é positivo quando ele vai para baixo
tr: Oyunlarda, Y-ekseni aşağıya doğru pozitiftir
zh_hans: 在游戏中，Y 轴为正向下

source: Note that in games, assuming your character's position starts at (0, 0), the code above moves the entity [code]180[/code] pixels to the right and [code]120[/code] pixels down. In math, the y-axis is generally positive going up by convention. The convention is the [i]opposite[/i] in video games and many computer applications: the y-axis is positive going down.
hu: Vedd észre, hogy amennyiben a karaktered kezdő pozíciója (0, 0), a fenti kód [code]180[/code] pixellel jobbra és [code]120[/code] pixellel lefelé mozdítja. A matekban az Y tengely megegyezés szerint általában felfelé pozitív. Ez a megegyezés a játékokban és sok más szoftverben pont az [i]ellenkező[/i]: az Y tengely lefelé pozitív.
it: Nota bene che nei giochi, assumendo la posizione del tuo personaggio partire a (0, 0), il codice qua sopra muove l'elemento di [code]180[/code] pixel sulla destra e [code]120[/code] pixel verso il basso. In matematica, l'asse y è generalmente positivo verso l'alto per convenzione. Questa convenzione è [i]opposta[/i] nei videogiochi e in molte applicazioni per computer: l'asse y è positiva verso il basso.
pt: Observe que em jogos, assumindo que a posição da sua personagem começa em (0, 0), o código acima move a entidade [code]180[/code] pixels para a direita e [code]120[/code] pixels para baixo. Em matemática, o eixo y é geralmente positivo subindo, por convenção. A convenção em videogames é o [i]oposto[/i] e em muitas aplicações de computador também: o eixo y é positivo descendo.

source: Why does the Y-axis point downwards?
it: Perché l'asse Y punta verso il basso?
ja: Y軸が下を向いているのはなぜですか?
tr: Y-ekseni neden aşağıyı gösteriyor?
zh_hans: 为什么 Y 轴向下？
