Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-26-looping-over-dictionaries.po
Languages: da, es, fr, nl, pl, tr, uk, zh_hans

source: You can loop over dictionaries, just like you learned to loop over arrays. When you loop over a dictionary, you get its keys one by one. You can then use each key to get its value.
da: Du kan loope hen over ordbøger, ligesom du lærte at loope hen over arrays. Når du looper hen over en ordbog, får du dens nøgler én efter én. Du kan derefter bruge hver nøgle til at få dens værdi.
uk: Ви можете виконувати цикли для словників, так само як ви навчилися виконувати цикли для масивів. Коли ви виконуєте цикл для словника, ви отримуєте його ключі один за одним. Потім ви можете використовувати кожен ключ, щоб отримати його значення.

source: Let's see how this works with two examples.
da: Lad os se, hvordan dette fungerer med to eksempler.
uk: Давайте подивимося, як це працює, на двох прикладах.

source: Displaying an inventory's content
da: Viser et lagers indhold
es: Mostrar el contenido de un inventario
fr: Afficher le contenu d'un inventaire
nl: De inhoud van een inventaris weergeven
pl: Wyświetlanie zawartości ekwipunku
tr: Bir envanterin içeriğini görüntülemek
uk: Відображення вмісту інвентарю=
zh_hans: 显示背包中的内容

source: To display the player's inventory, you need to know what it contains: the name and amount of each item.
da: For at vise spillerens lager skal du vide, hvad det indeholder: navnet og mængden af hver genstand.
uk: Щоб відобразити інвентар гравця, потрібно знати, що він містить. Потрібно вказати назву та суму кожного об’єкта.

source: To do this, you loop over the dictionary and process each key-value pair one at a time.
da: For at gøre dette skal du loope gennem ordbogen og behandle hvert nøgle-værdi-par ét ad gangen.
uk: А з коду ви можете досягти цього лише шляхом циклічного перегляду всього словника та обробки пар ключ-значення одну за одною.

source: You can get the list of all the keys in a dictionary by calling its [code]keys()[/code] function.
da: Du kan få en liste over alle nøglerne i en ordbog ved at kalde dens [code]keys()[/code] funktion.
uk: Щоб отримати список ключів у словнику, ви можете викликати його функцію-член [code]keys()[/code].

source: Looping over dictionary keys is so common that GDScript gives you a shortcut.
da: Det er så almindeligt at loope over nøgler i en ordbog, at GDScript giver dig en genvej.
uk: Циклічне проходження ключів словника настільки поширене, що GDScript надає вам скорочений варіант.

source: You can write the dictionary variable name directly after the [code]in[/code] keyword in a [code]for[/code] loop. GDScript automatically loops over the dictionary's keys.
da: Du kan skrive ordbogsvariabelnavnet direkte efter nøgleordet [code]in[/code] i en [code]for[/code]-løkke. GDScript looper automatisk hen over ordbogens nøgler.
uk: Ви можете написати ім'я змінної словника безпосередньо після ключового слова [code]in[/code] у циклі [code]for[/code]. GDScript автоматично проходить по ключах словника.

source: Remember: the name after the [code]for[/code] keyword is a variable name you choose yourself. You could call it [code]item_name[/code], [code]item[/code], [code]key[/code], or anything else. This variable holds one key at a time as the loop runs.
da: Husk: navnet efter nøgleordet [code]for[/code] er et variabelnavn, du selv vælger. Du kan kalde det [code]item_name[/code], [code]item[/code], [code]key[/code] eller hvad som helst andet. Denne variabel indeholder én nøgle ad gangen, mens løkken kører.
uk: Пам'ятайте: ім'я після ключового слова [code]for[/code] є ім'ям змінної, яке ви обираєте самостійно. Ви можете назвати її [code]item_name[/code], [code]item[/code], [code]key[/code] або будь-як інакше. Ця змінна містить один ключ за раз під час виконання циклу.

source: You can get each value with the syntax [code]dictionary[key][/code], as you learned in the previous lesson.
da: Du kan få hver værdi med syntaksen [code]dictionary[key][/code], som du lærte i den forrige lektion.
uk: Ви можете отримати значення за допомогою синтаксису [code]dictionary[key][/code], як ви вивчали на попередньому уроці.

source: So we can loop over the inventory keys, get their values, and display that information on screen.
da: Så vi kan loope gennem lager-nøglerne, få deres værdier og vise disse oplysninger på skærmen.
uk: Таким чином, ми можемо пройти по ключах інвентарю, отримати їх значення і відобразити цю інформацію на екрані.

source: Instead of printing the key-value pairs to the output console, we can write and call a function that displays items on the screen.
da: I stedet for at udskrive nøgle-værdi-parrene til outputkonsollen, kan vi skrive og kalde en funktion, der viser elementer på skærmen.
uk: Замість того, щоб виводити пари ключ-значення на консоль виводу, ми можемо написати і викликати функцію, яка відображає елементи на екрані.

source: Mapping grid cells to units
da: Kortlægning af gitterceller til enheder
es: Mapear celdas de cuadrícula a unidades
fr: Mapper des cases de grille à des unités
nl: Rastercellen koppelen aan eenheden
pl: Mapowanie komórek siatki na jednostki
tr: Izgara hücrelerini birimlere eşlemek
uk: Відображення клітинок сітки в одиниці
zh_hans: 将网格上的位置和单位联系起来

source: You can also use a dictionary to store which units are at which positions on a game board.
da: Du kan også bruge en ordbog til at gemme hvilke enheder, der er på hvilke positioner på et spillebræt.
uk: Ви також можете використовувати словник для збереження інформації про те, які одиниці знаходяться на яких позиціях на ігровому полі.

source: This is how you'd typically code a board game, a grid-based RPG, or a tactical RPG.
da: Sådan ville du typisk kode et brætspil, et grid-baseret RPG eller et taktisk RPG.
uk: Так ви зазвичай кодуєте настільну гру, рольову гру на основі сітки чи тактичну рольову гру.

source: So far, we used [code]String[/code] keys. But GDScript dictionaries can use any type as a key. In this example, we use [code]Vector2[/code] values as keys to represent grid positions.
da: Indtil videre har vi brugt [code]String[/code]-nøgler. Men GDScript-ordbøger kan bruge enhver type som nøgle. I dette eksempel bruger vi [code]Vector2[/code]-værdier som nøgler til at repræsentere gitterpositioner.
uk: Поки що ми використовували ключі [code]String[/code]. Але словники GDScript можуть використовувати будь-який тип як ключ. У цьому прикладі ми використовуємо значення [code]Vector2[/code] як ключі для представлення позицій сітки.

source: The only rule is that every key in a dictionary must be unique.
da: Den eneste regel er, at hver nøgle i en ordbog skal være unik.
uk: Єдине правило полягає в тому, що кожен ключ у словнику повинен бути унікальним.

source: With a [code]for[/code] loop, you can place all the units on the board when a game starts.
da: Med en [code]for[/code]-løkke kan du placere alle enhederne på spillepladen, når et spil starter.
uk: За допомогою циклу [code]for[/code] ви можете розмістити всі фігури на дошці в момент початку гри.

source: In the following practices, you will loop over dictionaries and process their content.
da: I de følgende øvelser vil du gennemgå ordbøger og bearbejde deres indhold.
es: En las siguientes prácticas, harás un bucle sobre los diccionarios y procesarás su contenido.
fr: Dans les exercices suivants, vous allez effectuer une boucle sur les dictionnaires et traiter leur contenu.
nl: In de volgende oefeningen loop je door dictionaries heen en verwerk je hun inhoud.
pl: W kolejnych ćwiczeniach będziesz przeglądać słowniki i przetwarzać ich zawartość.
tr: Sıradaki alıştırmalarda, sözlükler üzerinde döngü oluşturacak ve içeriklerini işleyeceksin.
uk: У наступних вправах ви проходите по циклу словників і оброблятимете їхній вміст.
zh_hans: 在下面的练习中，你需要遍历字典并处理其中的内容。

source: Displaying the inventory
da: Visning af lagerbeholdningen
es: Mostrar el inventario
fr: Afficher l'inventaire
nl: De inventaris weergeven
pl: Wyświetlanie ekwipunku
tr: Envanteri görüntülemek
uk: Відображення інвентарю
zh_hans: 显示背包的内容

source: We use a dictionary to store the player's inventory. The keys are item names, and the values are how many of each item the player has.
da: Vi bruger en ordbog til at gemme spillerens lager. Nøglerne er genstandsnavne, og værdierne er, hvor mange af hver genstand spilleren har.
uk: Ми використовуємо словник, щоб представити інвентар гравця в цій грі. Ключі словника — це назви предметів, і значення відповідають кількості предметів, якими володіє гравець.

source: Loop over the dictionary and display every item in the inventory.
da: Loop over ordbogen og vis alle genstande i lageret.
uk: Виконайте цикл по словнику і виведіть кожен елемент інвентарю.

source: Call the [code]display_item()[/code] function for each item. It takes two arguments: the item name and the amount.
da: Kald funktionen [code]display_item()[/code] for hver vare. Den tager to argumenter: varenavnet og mængden.
uk: Викличте функцію [code]display_item()[/code] для кожного елемента. Вона приймає два аргументи: назву елемента та його кількість.

source: The player's inventory needs to appear on screen. Use a loop to display every item.
da: Spillerens lager skal vises på skærmen. Brug et loop til at vise alle genstande.
uk: Інвентар гравця повинен відображатися на екрані. Використовуйте цикл, щоб відобразити кожен предмет.

source: Placing units on the board
da: Placering af enheder på spillepladen
es: Colocar unidades en el tablero
fr: Placer des unités sur le plateau
nl: Spelstukken op het bord plaatsen
tr: Birimleri tahtaya yerleştirmek
uk: Розміщення одиниць на дошці
zh_hans: 将单元放置在棋盘上

source: We have a dictionary named [code]units[/code]. It maps cell positions on the grid to the type of unit at that position.
da: Vi har en ordbog med navnet [code]units[/code]. Den knytter cellepositioner på gitteret til typen af enhed på den pågældende position.
uk: У нас є словник під назвою [code]units[/code]. Він зіставляє позиції комірок на сітці з типом одиниці в цій позиції.

source: Use a for loop to place every unit on the game board. Call the [code]place_unit()[/code] function for each unit. It takes two arguments: first the cell position, then the unit type.
da: Brug en for-løkke til at placere hver enhed på spillebrættet. Kald funktionen [code]place_unit()[/code] for hver enhed. Den tager to argumenter: først cellens position, derefter enhedstypen.
uk: Використовуйте цикл for, щоб розмістити кожну одиницю на ігровому полі. Викличте функцію [code]place_unit()[/code] для кожної одиниці. Вона приймає два аргументи: спочатку позицію комірки, потім тип одиниці.

source: At the start of each battle, units need to appear on the game board. Loop over the dictionary to place them.
da: I starten af hver kamp skal enhederne dukke op på spillebrættet. Loop over ordbogen for at placere dem.
uk: На початку кожної битви одиниці повинні з'явитися на ігровому полі. Пройдіться по словнику, щоб розмістити їх.

source: Looping over dictionaries
da: Looping hen over ordbøger
es: Hacer un bucle sobre los diccionarios
fr: Boucler sur les dictionnaires
nl: Door dictionaries heen stappen
pl: Zapętlanie słowników (dictionaries)
tr: Sözlükler üzerinde döngü kurmak
uk: Перегляд словників
zh_hans: 用循环遍历字典

source: Like with arrays, you can loop over dictionaries. You can loop over both their keys and values.
pl: Podobnie jak w przypadku tablic, możesz iterować po słownikach. Możesz przechodzić zarówno po ich kluczach, jak i wartościach.

source: Let's see how it works with two examples.
pl: Zobaczmy, jak to działa na dwóch przykładach.

source: To display the player's inventory, you need to know what it contains. You need the name and amount of each object.
pl: Aby wyświetlić ekwipunek gracza, musisz wiedzieć, co on zawiera. Potrzebujesz nazwy i ilości każdego przedmiotu.

source: And from code, you can only achieve that by looping over the whole dictionary and processing key-value pairs one by one.
pl: W kodzie możesz to osiągnąć tylko poprzez iterację po całym słowniku i przetwarzanie par klucz–wartość jedna po drugiej.

source: To get the list of keys in the dictionary, you can call its [code]keys()[/code] member function.
pl: Aby uzyskać listę kluczy w słowniku, możesz wywołać jego funkcję składową \[code]keys()\[/code].

source: But it's something we do so much that you don't need to call the function.
pl: Ale robimy to tak często, że nie musisz wywoływać tej funkcji.

source: Instead, you can directly [ignore]type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
pl: Zamiast tego możesz bezpośrednio wpisać nazwę zmiennej w pętli \[code]for\[/code] po słowie kluczowym \[code]in\[/code]. Język rozumie, że domyślnie chcesz iterować po kluczach słownika.

source: You can get the values with the syntax [code]dictionary[key][/code] as you learned in the previous lesson.
pl: Możesz pobierać wartości za pomocą składni \[code]dictionary\[key]\[/code], jak nauczyłeś się na poprzedniej lekcji.

source: We can loop over the inventory keys, get the corresponding values, and display all that information in the user interface.
pl: Możemy iterować po kluczach ekwipunku, pobierać odpowiadające im wartości i wyświetlać wszystkie te informacje w interfejsie użytkownika.

source: Instead of printing the key-value pairs to the output console, we can code and call a dedicated function that displays items in the user interface.
es: En lugar de imprimir los pares clave-valor en la consola de salida, podemos codificar y llamar a una función dedicada que muestra los elementos en la interfaz de usuario.
fr: Au lieu d'imprimer les paires clé-valeur sur la console de sortie, nous pouvons coder et appeler une fonction dédiée qui affiche les éléments dans l'interface utilisateur.
nl: In plaats van de key-value paren af te drukken naar de uitvoerconsole, kunnen we een speciale functie schrijven en aanroepen die items weergeeft in de gebruikersinterface.
pl: Zamiast wypisywać pary klucz–wartość w konsoli wyjściowej, możemy napisać i wywołać dedykowaną funkcję, która wyświetli przedmioty w interfejsie użytkownika.
tr: Anahtar-değer çiftlerini çıktı penceresine yazdırmak yerine, bu öğeleri kullanıcı arayüzünde görüntüleyen özel bir fonksiyon kodlayıp çağırabiliriz.
zh_hans: 与其将键值对打印到输出控制台，我们可以更进一步，编写专门的函数，用来将物品和数量展示在游戏的UI（User Interface）上。

source: We can also use a dictionary to map units to their position on a game board.
pl: Możemy też użyć słownika do mapowania jednostek na ich pozycje na planszy gry.

source: That's how you'd typically code a board game, a grid-based RPG, or a tactical RPG.
pl: Właśnie w ten sposób zazwyczaj koduje się gry planszowe, RPG oparte na siatce czy taktyczne RPG.

source: While we focused on [code]String[/code] keys so far, GDScript dictionaries accept any value type as a key, allowing you to map anything to anything.
pl: Chociaż do tej pory skupialiśmy się na kluczach typu [code]String[/code], słowniki w GDScript akceptują dowolny typ wartości jako klucz, pozwalając mapować wszystko na wszystko.

source: The only limitation is that every key must be unique.
pl: Jedynym ograniczeniem jest to, że każdy klucz musi być unikalny.

source: Using a [code]for[/code] loop, you can use the key-value pairs to place units on the board at the start of a game.
es: Utilizando un bucle [code]for[/code], puedes utilizar los pares clave-valor para colocar unidades en el tablero al inicio de un juego.
fr: En utilisant une boucle [code]for[/code], vous pouvez utiliser les paires clé-valeur pour placer des unités sur le plateau au début d'une partie.
nl: Met behulp van een [code]for[/code]-lus kun je de sleutel-waardeparen gebruiken om eenheden op het bord te plaatsen aan het begin van een spel.
pl: Używając pętli [code]for[/code], możesz wykorzystać pary klucz-wartość, aby umieścić jednostki na planszy na początku gry.
tr: Oyunun başında birimleri tahtaya yerleştirmek için, [code]for[/code] döngüsünü ile anahtar-değer çiftlerini kullanabilirsin.
zh_hans: 使用 [code]for[/code] 循环和键值对，可以在游戏开始时将单位放置在棋盘上。

source: We use a dictionary to represent the player's inventory in this game. The dictionary keys are the name of items, and they map to the number of items that the player owns.
pl: W tej grze używamy słownika, aby przedstawić ekwipunek gracza. Klucze słownika to nazwy przedmiotów, a ich wartości odpowiadają liczbie przedmiotów posiadanych przez gracza.

source: You need to loop over the dictionary and display the name and amount of every item in the inventory.
pl: Musisz przejść przez słownik i wyświetlić nazwę oraz ilość każdego przedmiotu w ekwipunku.

source: To do so, call the [code]display_item()[/code] function. It takes two arguments: the item name and the amount.
pl: Aby to zrobić, wywołaj funkcję \[code]display\_item()\[/code]. Przyjmuje ona dwa argumenty: nazwę przedmiotu i jego ilość.

source: Like with arrays, you can loop over dictionaries. You can loop over both their keys and values. Let's see how it works with two examples.
es: Al igual que con las matrices, puedes hacer un bucle sobre los diccionarios. Puedes hacer un bucle sobre sus claves y valores. Veamos cómo funciona con dos ejemplos.
fr: Comme avec les tableaux, vous pouvez boucler sur les dictionnaires. Vous pouvez effectuer une boucle sur leurs clés et leurs valeurs. Voyons comment cela fonctionne avec deux exemples.
nl: Net als bij arrays kun je door dictionaries heen lussen. Je kunt zowel langs de sleutels als langs de waarden lussen. Laten we eens kijken hoe het werkt met twee voorbeelden.
tr: Dizilerde olduğu gibi, sözlükler üzerinde de döngü oluşturabilirsin. Hem anahtarların hem de değerlerin üzerinde döngü oluşturabilirsin. İki örnekle nasıl çalıştığını görelim.
zh_hans: 和数组一样，你能够遍历字典。 遍历它的key（键，关键）和对应的值。 让我们通过两个示例来看看它是如何工作的。

source: To display the player's inventory, you need to know what it contains. You need the name and amount of each object. And from code, you can only achieve that by looping over the whole dictionary and processing key-value pairs one by one. To get the list of keys in the dictionary, you can call its [code]keys()[/code] member function.
es: Para mostrar el inventario del jugador, necesitas saber lo que contiene. Necesitas el nombre y la cantidad de cada objeto. Y desde el código, sólo puedes conseguir esto haciendo un bucle sobre todo el diccionario y procesando los pares clave-valor uno por uno. Para obtener la lista de claves del diccionario, puedes llamar a su función miembro [code]keys()[/code].
fr: Pour afficher l'inventaire du joueur, vous devez savoir ce qu'il contient. Vous avez besoin du nom et de la quantité de chaque objet. Et à partir du code, vous ne pouvez pas y parvenir qu'en effectuant une boucle sur l'ensemble du dictionnaire et en traitant les paires clé-valeur une par une. Pour obtenir la liste des clés du dictionnaire, vous pouvez appeler sa fonction membre [code]keys()[/code].
nl: Om de inventaris van de speler weer te geven, moet je weten wat erin zit. Je hebt de naam en de hoeveelheid van elk object nodig. En vanuit code kun je dat alleen bereiken door over de hele dictionary te lopen en sleutel-waardeparen één voor één te verwerken. Om de lijst met sleutels in de dictionary te krijgen, kun je de lidfunctie [code]keys()[/code] aanroepen.
tr: Oyuncunun envanterini görüntülemek için, neleri içerdiğini bilmen gerekir. Her nesnenin adına ve miktarına ihtiyacın vardır. Ve kodun içinde, bunu yalnızca sözlüğün tamamı üzerinde döngü oluşturarak, ve anahtar-değer çiftlerini tek tek işleyerek başarabilirsin. Sözlükteki anahtarların listesini almak için [code]keys()[/code] (anahtarlar) üye fonksiyonunu çağırabilirsin.
zh_hans: 要显示玩家的背包，你得知道里面有什么。也就是每个物品的名称和数量。 在代码中，你只能通过遍历整个字典，并一一处理键值对（key-value pair）来实现。 要获取字典中的键（key）列表，可以调用字典的 [code]keys()[/code] 成员函数。

source: But it's something we do so much that you don't need to call the function. Instead, you can directly type the variable name in a [code]for[/code] loop after the [code]in[/code] keyword. The language understands that you implicitly want to loop over the dictionary's keys.
es: Pero esto es algo que hacemos tanto que no es necesario llamar a la función. En su lugar, puedes escribir directamente el nombre de la variable en un bucle [code]for[/code] después de la palabra clave [code]in[/code]. El lenguaje entiende que implícitamente quieres hacer un bucle sobre las claves del diccionario.

source: You can get the values with the syntax [code]dictionary[key][/code] as you learned in the previous lesson. We can loop over the inventory keys, get the corresponding values, and display all that information in the user interface.
es: Puedes obtener los valores con la sintaxis [code]dictionary[key][/code] como aprendiste en la lección anterior. Podemos hacer un bucle sobre las claves del inventario, obtener los valores correspondientes y mostrar toda esa información en la interfaz de usuario.
fr: Vous pouvez obtenir les valeurs avec la syntaxe [code]dictionary[key][/code] comme vous l'avez appris dans la leçon précédente. Nous pouvons boucler sur les clés de l'inventaire, obtenir les valeurs correspondantes et afficher toutes ces informations dans l'interface utilisateur.
nl: Je kunt de waarden krijgen met [code]dictionary[key][/code] zoals je in de vorige les hebt geleerd. We kunnen de inventarissleutels doorlopen, de bijbehorende waarden opvragen en al die informatie weergeven in de gebruikersinterface.
tr: Önceki derste öğrendiğin gibi [code]sözlük_değişkeni[anahtar][/code] sözdizimi ile değerleri alabilirsin. Envanter anahtarları üzerinde döngü yapabilir, karşılık gelen değerleri alabilir, ve tüm bu bilgileri kullanıcı arayüzünde görüntüleyebiliriz.
zh_hans: 你可以用上一课中学到的语法 [code]dictionary[key][/code] 来获取键对应的值。 我们可以遍历字典inventory的所有键，获取对应的值，并在用户界面中显示所有这些信息。
