Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-8-defining-variables.po
Languages: da, de, fr, hu, it, ja, pl, pt, pt_br, ru, sv, tr, zh_hans

source: In the previous lesson, you used a predefined member variable named [code]position[/code]. In your projects, you will need to define your own variables. Imagine that you need to track the player's health in your game. They may start with [code]5[/code] health points. When taking a hit, the health should go down to [code]4[/code]. After another hit, it should be [code]3[/code]. And so on. To keep track of that, you can create a variable named [code]health[/code] to which you add and subtract points. The example below introduces the [code]print()[/code] function, which outputs its argument to the output box on the left. Click the [i]run()[/i] button to instantly run the entire function, and click the [i]step[/i] button to execute lines of code one by one. The [i]Debugger[/i] panel at the bottom shows the current value of the [code]health[/code] variable.
da: I den forrige lektion brugte du en foruddefineret medlemsvariabel ved navn [code]position[/code]. I dine projekter skal du definere dine egne variabler. Forestil dig, at du skal spore spillerens liv i dit spil. De kan starte med [code]5[/code] livspoint. Når du tager et slag, skal livet gå ned til [code]4[/code]. Efter et andet slag skal det være [code]3[/code]. Og så videre. For at holde styr på det, kan du oprette en variabel med navnet [code]health[/code], som du tilføjer og trækker point fra. Eksemplet nedenfor introducerer funktionen [code]print()[/code], som udsender sit argument til output boksen til venstre. Klik på knappen [i]run()[/i] for øjeblikkeligt at køre hele funktionen, og klik på knappen [i]step[/i] for at udføre koden linje for linje. [i]Fejlfindings[/i] panelet nederst viser den aktuelle værdi af [code]health[/code] variabelen.
de: In der vorherigen Lektion hast Du eine vordefinierte Membervariable mit dem Namen [code]position[/code] verwendet. In deinen Projekten musst Du deine eigenen Variablen definieren. Stell' dir vor, du müssest die Gesundheit des Spielers in deinem Spiel nachverfolgen. So könnte sie mit [code]5[/code] Gesundheitspunkten beginnen. Bei einem Treffer sinkt die Gesundheit auf [code]4[/code]. Nach einem weiteren Treffer auf [code]3[/code] . Und so weiter. Um dies nachzuvollziehen, kannst Du eine Variable mit dem Namen [code]health[/code] (Gesundheitszustand) erstellen, der Gesundheitspunkte hinzugezählt oder abgezogen werden. [i]Im folgenden Beispiel wird die Funktion [code]print()[/code] vorgestellt, die deinen Parameter in das Ausgabefeld auf der linken Seite ausgibt. [/i] Klicke auf den [i]run[/i] Knopf, um die komplette Funktion auszuführen oder klicke den [i]step[/i] Knopf, um den Code Zeile für Zeile auszuführen. Das [i]Debugger[/i] Feld am unteren Rand zeigt dir den aktuellen Stand der [code]health[/code] Variablen an.
fr: Dans la leçon précédente, vous avez utilisé une variable membre prédéfinie appelée [code]position[/code]. Dans vos projets, vous devrez définir vos propres variables. Imaginez que vous ayez besoin de faire un suivi de la santé du joueur dans votre jeu. Le joueur peut commencer avec [code]5[/code] points de santé. Lorsqu'il reçoit un coup, la santé devrait descendre à [code]4[/code]. Après un autre coup, elle devrait être de [code]3[/code]. Et ainsi de suite. Pour garder une trace de cela, vous pouvez créer une variable nommée [code]health[/code] à laquelle vous ajoutez et soustrayez des points. L'exemple ci-dessous présente la fonction [code]print()[/code], qui affiche son paramètre dans la boîte de sortie à gauche. Cliquez sur le bouton [i]run()[/i] pour exécuter instantanément la fonction entière, et cliquez sur le bouton [i]step[/i] pour exécuter les lignes de code une par une. Le panneau [i]Débogueur[/i] en bas montre la valeur actuelle de la variable [code]health[/code].
it: Nella lezione precedente è stata utilizzata una variabile membro predefinita chiamata [code]position[/code]. Nei vostri progetti, dovrete definire le vostre variabili. Immaginate di dover tenere traccia della salute dei giocatori nel vostro gioco. Il giocatore potrebbe iniziare con [code]5[/code] punti salute. Quando subisce un colpo, la salute deve scendere a [code]4[/code]. Dopo un altro colpo, dovrebbe essere [code]3[/code]. E così via. Per tenerne traccia, si può creare una variabile chiamata [code]health[/code] a cui aggiungere e sottrarre punti. L'esempio seguente introduce la funzione [code]print()[/code], che invia il suo argomento alla casella di output a sinistra. Cliccando sul pulsante [i]run()[/i] si esegue immediatamente l'intera funzione, mentre cliccando sul pulsante [i]step[/i] si eseguono le righe di codice una alla volta. Il pannello [i]Debugger[/i] in basso mostra il valore corrente della variabile [code]health[/code].
ja: 前のレッスンでは、[code]position[/code] という名前の事前定義されたメンバー変数を使用しました。 プロジェクトでは、独自の変数を定義する必要があります。 ゲーム内でプレイヤーの健康状態を追跡する必要があると想像してください。 体力[code]5[/code] から始まる場合があります。 攻撃を受けると、体力は [code]4[/code] まで低下します。 もう一度ヒットすると、[code]3[/code] になるはずです。 等々。 これを追跡するには、[code]health[/code] という名前の変数を作成し、それにポイントを加算および減算します。 以下の例では、引数を左側の出力ボックスに出力する [code]print()[/code] 関数を紹介します。 [i]run()[/i] ボタンをクリックすると関数全体が即座に実行され、[i]step[/i] ボタンをクリックするとコード行を 1 行ずつ実行します。 下部の [i]Debugger[/i] パネルには、[code]health[/code] 変数の現在の値が表示されます。
pt_br: Na lição anterior, você usou uma variável membro predefinida chamada [code]position[/code]. Em seus projetos, você vai precisar definir suas próprias variáveis. Imagine que você precisa acompanhar a vida do jogador no seu jogo. Ela pode começar com [code]5[/code] pontos. Ao receber um golpe, a vida cai para [code]4[/code]. Depois de outro hit, deve ser [code]3[/code]. E assim por diante. Para acompanhar isso, você pode criar uma variável chamada [code]health[/code] que você pode usar para adicionar e subtrair pontos. O exemplo abaixo apresenta a função [code]print()[/code], que envia seu parâmetro para a caixa de saída à esquerda. Clique no botão [i]executar()[/i] para executar instantaneamente a função inteira, e clique no botão [i]passo[/i] para executar as linhas de código uma a uma. O painel [i]Depurador[/i] na parte inferior mostra o valor atual da variável [code]health[/code].
ru: В предыдущем уроке вы использовали предопределенное свойство с именем [code]position[/code]. В своих проектах вам придётся определять собственные переменные. Представьте, что вам нужно отслеживать здоровье игрока в вашей игре. Он может начать с [code]5[/code] очками здоровья. При получении удара здоровье должно уменьшиться до [code]4[/code]. После ещё одного удара оно должно стать равно [code]3[/code]. И так далее. Чтобы следить за этим, можно создать переменную с именем [code]health[/code], к которой можно прибавлять и отнимать очки. В примере ниже представлена функция [code]print()[/code], которая выводит значение параметра в поле вывода слева. Нажмите кнопку [i]run()[/i], чтобы мгновенно запустить всю функцию, и нажмите кнопку [i]step[/i], чтобы выполнить строки кода одну за другой. Панель [i]Отладчик[/i] внизу показывает текущее значение переменной [code]health[/code].
tr: Önceki derste, [code]position[/code] adında önceden tanımlanmış bir üye değişken kullandın. Projelerinde kendi değişkenlerini tanımlaman gerekecek. Oyununda, oyuncuların sağlığını takip etmen gerektiğini düşün. [code]5[/code] sağlık puanı ile başlayabilirler. Bir darbe aldıklarında, sağlık puanı [code]4[/code]'e düşmelidir. Başka bir darbeden sonra, [code]3[/code]'a düşmelidir. Ve bu böyle devam eder. Bunun takibini yapmak için, puan ekleyip çıkardığın [code]health[/code] adında bir değişken oluşturabilirsin. Aşağıdaki örnek, girdi değişkenini soldaki çıktı kutusuna yazdıran [code]print()[/code] fonksiyonunu tanıtmaktadır. Bütün fonksiyonu tek seferde çağırmak için[i]run()[/i] (çalıştır) düğmesine, kod satırlarını tek tek yürütmek için [i]step[/i] (adım) düğmesine tıkla. Alttaki [i]hata ayıklama[/i] (Debugger) paneli [code]health[/code] değişkeninin şimdiki değerini gösterir.
zh_hans: 在上一课中，你使用了一个名为 [code]position[/code] 的预定义成员变量。 在你的项目中，你是需要自己定义变量的。 想象一下，你需要在游戏中跟踪玩家的血量状况。 玩家可能从 [code]5[/code] 点血开始。受到打击时，生命值应降至 [code]4[/code]。再次受击后，应该是 [code]3[/code]。等等。 要跟踪这一点，你可以创建一个名为 [code]health[/code] 的变量，用它来增加或减去血量值。 [i]下面的例子介绍了[code]print()[/code]函数，它会把它的参数输出到左侧的输出框。[/i] 点击 [i]run()[/i]按钮可以立刻运行整个函数，或者点击 [i]step[/i] （步进）按钮，这样程序会一行一行地执行。 下方的[i]Debugger[/i]面板会显示出实时的[code]health[/code] 值的变化。

source: After executing the first two lines of code, you will have a health variable storing a value of [code]4[/code]. Below, we'll break down how you define new variables and explain the [code]print()[/code] function.
da: Efter at have kørt de første to linjer kode, vil du have en livs variabel der lagere af en værdi af [code]4[/code]. Nedenfor vil vi se på, hvordan du definerer nye variabler og forklarer funktionen [code]print()[/code].
de: Nachdem Du die ersten beiden Codezeilen ausgeführt hast, hast Du eine Variable für Leben, die den Wert von [code]4[/code] speichert. Im Folgenden wird aufgeschlüsselt, wie Du neue Variablen definierst, und die Funktion [code]print()[/code] näher erläutert.
fr: Après avoir exécuté les deux premières lignes de code, vous aurez une variable de santé stockant une valeur de [code]4[/code]. Ci-dessous, nous allons décortiquer comment définir de nouvelles variables et nous expliquerons la fonction [code]print()[/code].
hu: Az első 2 sor végrehajtása után, lesz egy health nevű változó, melynek az értéke [code]4[/code]. Lent, részletesen kifejtjük, hogyan hozz létre új változókat és elmagyarázzuk a [code]print()[/code] függvény működését.
it: Dopo aver eseguito le prime due righe di codice, avrai una variabile della vita che conserva un valore di [code]4[/code]. Sotto, ti spiegheremo la funzione [code]print()[/code] e come definire nuove variabili.
ja: コードの最初の 2 行を実行すると、[code]4[/code] の値を格納するhelth変数が作成されます。 以下では、新しい変数を定義する方法を詳しく説明し、[code]print()[/code] 関数について説明します。
pl: Po wykonaniu pierwszych dwóch wierszy kodu, zyskujesz zmienną odpowiadającą życiu, która przechowuje wartość [code]4[/code]. Poniżej opiszemy, jak definiować nowe zmienne i wyjaśnimy funkcję [code]print()[/code].
pt: Depois de executar as duas primeiras linhas de código, vai ter uma variável de vida armazenando um valor de [code]4[/code] pontos. Abaixo, vamos detalhar como define novas variáveis e explicaremos a função [code]print()[/code].
pt_br: Depois de executar as duas primeiras linhas de código, você vai ter uma variável de vida armazenando um valor de [code]4[/code] pontos. Abaixo, vamos detalhar como você define novas variáveis e explicaremos a função [code]print()[/code].
ru: После выполнения первых двух строк тела функции вы получите переменную health, хранящую значение [code]4[/code]. Ниже мы разберем, как определять новые переменные, и объясним функцию [code]print()[/code].
sv: Efter att du exekverat dom två första raderna av kod kommer du nu ha en hälsovariabel som lagrar ett värde av [code]4[/code]. Nedan kommer vi att bryta ner hur du definierar nya variabler och förklara [code]print()[/code] funktionen.
tr: Kodun ilk iki satırını çalıştırdıktan sonra, [code]4[/code] değerini saklayan bir sağlık değişkenin olacaktır. Aşağıda, yeni değişkenleri nasıl tanımlayacağını ve [code]print()[/code] fonksiyonunu açıklayacağız.
zh_hans: 执行前两行代码后，你会得到一个储存 [code]4[/code] 的health变量。 下面，我们将分解定义新变量的步骤，并解释 [code]print()[/code] 函数。

source: Defining a variable
da: Definering af en variabel
de: Definieren einer Variablen
fr: Définir une variable
hu: Változó létrehozása
it: Definendo una varibile
ja: 変数の定義
pl: Definiowanie zmiennych
pt: Definindo uma variável
pt_br: Definindo uma variável
ru: Определение переменной
sv: Definiera en variabel
tr: Bir değişken tanımlamak
zh_hans: 定义一个变量

source: To use a variable, you must first define it so the computer registers its name. To do so, you start a line of code with the [code]var[/code] keyword followed by your desired variable name. Like [code]func[/code] stands for [i]function[/i], [code]var[/code] stands for [i]variable[/i]. Variables are case-sensitive, which means [code]health[/code] and [code]Health[/code] are technically different variables. Be careful to use the same capitalization wherever you refer to the same variable, or you could be reading or writing to a different variable. The following line defines a [code]health[/code] variable pointing to no value. You can think of it as creating a product label you have yet to stick onto something.
da: For at bruge en variabel skal du først definere den, så computeren registrerer dens navn. For at gøre dette starter du en linje kode med nøgleordet [code]var[/code] efterfulgt af dit ønskede variabelnavn. Ligesom [code]func[/code] står for [i]function[/i], står [code]var[/code] for [i]variabel[/i]. Variabler skelner mellem store og små bogstaver, hvilket betyder, at [code]health[/code] og [code]Health[/code] teknisk set er forskellige variabler. Vær omhyggelig med at bruge de samme store og små bogstaver, når du refererer til den samme variabel, ellers kan du læse eller skrive til en anden variabel. Den følgende linje definerer en [code]health[/code]-variabel, der ikke peger på nogen værdi. Du kan tænke på det som at oprette en produktetiket, du endnu ikke har sat på noget.
de: Wenn Du eine Variable verwenden willst und der Computer sie registriert, musst sie zunächst [i}definieren[/i]. Dazu startest Du eine Codezeile mit dem Schlüsselwort [code]var[/code], gefolgt von dem gewünschten Variablennamen. So wie [code]func[/code] für [i]Funktion[/i] steht, steht [code]var[/code] für [i]Variable[/i]. Variablen sind case-sensitive, das heißt [code]healt[/code] und [code]Health[/code] sind für Godot unterschiedliche Variablen. Es ist sehr wichtig, dass du auf Groß- und Kleinschreibung achtest. Die folgende Zeile definiert eine [code]health[/code](Leben)-Variable, der kein keinen Wert zugewiesen ist. Dies ist wie ein Produktetikett, das noch nicht auf ein Produkt aufgeklebt ist.
fr: Pour utiliser une variable, vous devez d'abord la définir afin que l'ordinateur enregistre son nom. Pour ce faire, vous commencez une ligne de code avec le mot-clé [code]var[/code] suivi du nom de la variable que vous souhaitez. Comme [code]func[/code] signifie [i]fonction[/i], [code]var[/code] signifie [i]variable[/i]. Les variables sont sensibles à la casse, ce qui signifie que [code]health[/code] et [code]Health[/code] sont techniquement des variables différentes. Veillez à utiliser la même capitalisation partout où vous faites référence à la même variable, sinon vous pourriez lire ou écrire dans une variable différente. La ligne suivante définit une variable [code]health[/code] qui ne pointe vers aucune valeur. Vous pouvez considérer cela comme la création d'une étiquette de produit que vous n'avez pas encore collée sur quelque chose.
it: Per utilizzare una variabile, è necessario prima definirla in modo che il computer ne registri il nome. Per farlo, si inizia una riga di codice con la parola chiave [code]var[/code] seguita dal nome della variabile desiderata. Come [code]func[/code] sta per [i]function[/i], [code]var[/code] sta per [i]variable[/i]. Le variabili sono sensibili alle maiuscole, il che significa che [code]health[/code] e [code]Health[/code] sono tecnicamente variabili diverse. Fate attenzione a usare la stessa maiuscola ogni volta che vi riferite alla stessa variabile, altrimenti potreste leggere o scrivere su una variabile diversa. La riga seguente definisce una variabile [code]health[/code] che punta a nessun valore. Si può pensare a questa variabile come alla creazione di un'etichetta di un prodotto che si deve ancora attaccare a qualcosa.
ja: 変数を使用するには、まずコンピューターがその名前を登録できるように定義する必要があります。 変数を定義するには、コード行の先頭に[code]var[/code]キーワードを書き、その後に希望する変数名を続けます。 [code]func[/code]が[i]関数[/i]を表すのと同様に、[code]var[/code]は[i]変数[/i]を表します。 変数名は、大文字と小文字が区別されます。つまり、[code]health[/code]と[code]Health[/code]は技術的には異なる変数です。 同じ変数を参照するときは、常に同じ大文字と小文字を使用する必要があります。 そうしないと、別の変数を読み書きしている可能性があります。 次の行は、値を持たない[code]health[/code]変数を定義しています。 商品ラベルをまだ何も貼っていない状態と考えてください。
pt_br: Para usar uma variável, você deve primeiro defini-la para que o computador registre seu nome. Para fazer isso, você inicia uma linha de código com a palavra-chave [code]var[/code] seguida do nome desejado para a variável. Assim como [code]func[/code] significa [i]função[/i], [code]var[/code] significa [i]variável[/i]. Variáveis são sensíveis a letras maiúsculas e minúsculas. Isso significa que [code]health[/code] and [code]Health[/code] são tecnicamente duas variáveis diferentes. Tome cuidado para usar a mesma capitalização quando for se referir a uma variável, ou você pode acabar lendo ou escrevendo numa variável diferente. A linha a seguir define uma variável [code]health[/code] que não possui nenhum valor. Você pode pensar nisso como criar um rótulo de um produto que você ainda precisa colar em algo (ou seja, você criou a variável e não colocou nenhum valor nela ainda).
ru: Чтобы использовать переменную, вы должны сначала определить её, чтобы компьютер зарегистрировал её имя. Для этого нужно начать строку кода с ключевого слова [code]var[/code], и продолжить её подходящим именем переменной. Так же, как [code]func[/code] обозначает [i]функцию[/i], [code]var[/code] обозначает [i]переменную[/i]. Переменные чувствительны к регистру, что означает, что [code]health[/code] и [code]Health[/code] технически разные переменные. Будьте осторожны и используйте одну и ту же заглавную букву везде, где вы ссылаетесь на одну и ту же переменную, иначе вы можете читать или писать в другую переменную. Следующая строка определяет переменную [code]health[/code], не указывающую ни на какое значение. Вы можете думать об этом как о создании этикетки продукта, которую вам еще предстоит наклеить на что-то.
tr: Bir değişkeni kullanmak için, önce onu tanımlaman gerekir, böylece bilgisayar onun ismini kaydeder. Bunu yapmak için, bir kod satırına [code]var[/code] anahtar kelimesi ile başlar ve ardından istediğin değişken ismini yazarsın. [code]func[/code] isminin[i]fonksiyonu[/i] (function) temsil etmesi gibi, [code]var[/code] ismi de [i]değişken[/i] (variable) anlamına gelir. Değişkenler büyük/küçük harfe duyarlıdır, yani [code]health[/code] ve [code]Health[/code] teknik olarak farklı değişkenlerdir. Aynı değişkeni işaret ettiğin her yerde, aynı harf büyüklüğü kullanımına dikkat et, aksi takdirde farklı bir değişkeni okuyor veya yazıyor olabilirsin. Aşağıdaki satır, hiçbir değere işaret etmeyen bir [code]health[/code] değişkeni tanımlar. Bunu, henüz bir şeyin üzerine yapıştırmadığın bir ürün etiketi oluşturmak gibi düşünebilirsin.
zh_hans: 要使用变量，你必须首先定义它，以便计算机注册它的名称。 为此，首先用 [code]var[/code] 关键字写一行代码，后跟所需的变量名称。就像 [code]func[/code] 代表 [i]function[/i]（函数），[code]var[/code] 代表 [i]variable[/i]（变量）。 变量是区分大小写的，也就是说 [code]health[/code] 和[code]Health[/code]是完全不同的两个变量。当你要用到一个变量的时候，要留意大小写是否一致，否则你写出来的或者看到的就完全是另一个变量。 下面一行定义了一个没有值的 [code]health[/code] 变量。你可以想成这是做了一个还没贴在商品上的产品标签。

source: Like with functions, a member variable's name must be unique inside a given code file. Creating two variables next to each other with the same name will cause an error.
da: Ligesom med funktioner skal navnet på en medlemsvariabel være unikt i en given kodefil. Oprettelse af to variabler ved siden af hinanden med samme navn vil forårsage en fejl.
de: Wie bei Funktionen muss der Name einer Membervariablen innerhalb einer bestimmten Codedatei eindeutig sein. Wenn Du zwei Variablen mit demselben Namen erstellst, tritt ein Fehler auf.
fr: Comme pour les fonctions, le nom d'une variable membre doit être unique dans un fichier de code donné. La création de deux variables côte à côte avec le même nom provoquera une erreur.
hu: A függvényekhez hasonlóan a változóknak is egyedi névvel kell rendelkezniük az adott kódblokkban. Egymás után két azonos nevű változó létrehozása, hibaüzenetet fog dobni.
it: Come per le funzioni, il nome di una variabile membro deve essere unico all'interno di un file di codici. Creando due variabili l'uno vicino all'altra con lo stesso nome può causare un errore.
ja: 関数と同様に、メンバー変数の名前は、特定のコードファイル内で一意である必要があります。 同じ名前の変数を隣り合わせに作成すると、エラーが発生します。
pl: Podobnie jak w przypadku funkcji, nazwa zmiennej składowej musi być unikalna w danym pliku kodu. Utworzenie obok siebie dwóch zmiennych o tej samej nazwie poskutkuje błędem.
pt: Assim como as funções, o nome de uma variável membro deve ser exclusivo dentro de um determinado ficheiro de código. Criar duas variáveis próximas uma da outra com o mesmo nome causará um erro.
pt_br: Assim como as funções, o nome de uma variável membro deve ser exclusivo dentro de um determinado arquivo de código. Criar duas variáveis próximas uma da outra com o mesmo nome causará um erro.
ru: Как и в случае с функциями, имя свойства должно быть уникальным в пределах данного файла кода. Создание двух переменных рядом друг с другом с одинаковым именем приведёт к ошибке.
sv: Som med funktioner, en medlemsvariabels namn måste vara unikt inuti kodfilen. Att skapa två variabler i samma fil med samma namn kommer att skapa ett fel.
tr: Aynı Fonksiyonlar gibi, belirli bir kod dosyası içinde, bir üye değişkenin ismi benzersiz olmalıdır. Aynı isme sahip iki değişkeni yan yana oluşturmak hataya neden olur.
zh_hans: 与函数一样，成员变量的名称在给定代码文件中必须是唯一的。挨着创建两个名称相同的变量将导致错误。
