Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-5-your-first-function.po
Languages: hu, it, ja, nl, pl, ru, sv, tr, zh_hans

source: So far, we have called existing functions that other developers wrote.
hu: Eddig olyan már meglévő függvényeket hívtunk, amelyeket más programozók írtak.
pl: Dotychczas wyłącznie wywoływaliśmy już istniejące funkcje, które napisali inni programiści.

source: In this lesson, we'll talk more about what functions are and see some examples. Then, you will learn how to define your own functions.
hu: Ebben a leckében, jobban kifejtjük mik azok a függvények és nézünk pár példát. Ezután, megtanulod, hogyan deklaráld a saját függvényeid.
pl: W tej lekcji omówimy głębiej temat funkcji i zobaczymy kilka ich przykładów. Następnie nauczymy się definiować nasze własne funkcje.

source: Functions are named sequences of instructions
hu: A függvények névvel ellátott utasításkészletek
it: Le funzioni sono una sequenza di istruzioni con un nome
ja: 関数は命令のシーケンスに名前が付けられます
nl: Functies zijn reeksen instructies met een naam
pl: Funkcje są nazywanymi sekwencjami instrukcji
ru: Функции — это именованные последовательности инструкций
sv: Funktioner är namngivna sekvenser av instruktioner
tr: Fonksiyonlar, isimlendirilmiş talimatlar dizisidir
zh_hans: 函数是指令序列

source: Functions are [i]sequences of instructions[/i] we give a name. We call that name an [i]identifier[/i].
hu: A függvény olyan [i]utasítások gyűjteménye[/i], aminek nevet adunk. Ezt a nevet [i]azonosítónak[/i] hívjuk.
pl: Funkcje to [i]sekwencje instrukcji[/i], którym nadajemy nazwę. Nazwę tę nazywamy [i]identyfikatorem[/i].

source: Using the identifier, we can get the computer to execute all the instructions inside the function as many times as we need. This is what a [i]function call[/i] does.
hu: Az azonosító használatával annyiszor hajthatjuk végre a függvényben lévő utasításokat, ahányszor csak akarjuk. Ez a folyamat a [i]függvényhívás[/i].
pl: Używając identyfikatora, możemy sprawić, że komputer wykona wszystkie instrukcje wewnątrz podanej funkcji tyle razy, ile tego potrzebujemy. Tym właśnie jest to, co robimy [i]wywołując funkcje[/i].

source: Learn more about identifiers
ja: 識別子の詳細について
nl: Leer meer over identifiers
pl: Dowiedz się więcej o indentyfikatorach
ru: Подробнее об идентификаторах
sv: Lär dig mer om identifierare
tr: Tanımlayıcılar hakkında fazlasını öğren
zh_hans: 了解有关标识符的更多信息

source: In computer programming, we talk about [i]identifiers[/i] rather than "names".
hu: A programozásban [i]azonosítókat[/i] használunk, nem "neveket".
pl: W programowaniu komputerowym mówimy raczej o [i]identyfikatorach[/i] niż o „nazwach”.

source: It is because a function name is a label the computer uses to precisely [i]identify[/i] and refer to a function or other code elements.
hu: Azért, mert a függvény neve egy címke, amit a számítógép arra használ, hogypontosan [i]azonosítsa[/i] és utaljon a függvényre vagy más kódrészekre.
pl: Dzieje się tak, ponieważ nazwa funkcji jest etykietą, której komputer używa do dokładnej [i]identyfikacji[/i] i odwoływania się do danej funkcji lub innych elementów kodu.

source: Identifiers are unique: you cannot reuse the same name in a given [i]space[/i] in your code.
hu: Az azonosítók egyediek: nem használhatod többször ugyanazt a nevet egy adott [i]blokkon[/i] belül.
pl: Identyfikatory są unikalne: nie można ponownie użyć tej samej nazwy w danej [i]przestrzeni[/i] w kodzie.

source: If you try to name two functions the same, the computer will raise an error.
hu: Ha két függvénynek ugyanazt a nevet próbálod adni, a számítógép hibát fog jelezni.
pl: Jeśli spróbujesz nazwać dwie funkcje tak samo, komputer zgłosi błąd.

source: If there is any code that you need to run multiple times, you can put it inside a function and give it a name.
hu: Ha van olyan kód, amit többször is kell használhatod, készíthetsz belőle egy függvényt és adhatsz neki egy nevet.
pl: Jeśli istnieje jakiś kod, który musisz uruchomić wiele razy, możesz umieścić go w funkcji i nadać mu nazwę (identyfikator).

source: The instructions inside a function can be any code you want, and they will all run every time you call the function.
hu: A függvényben lévő utasítások bármilyen kódot tartalmazhatnak, és minden alkalommal le fognak futni, ha hívod a függvényt.
pl: Wewnątrz funkcji możemy wpisać dowolne instrukcje, a wszystkie z nich będą uruchamiane przy każdym wywołaniu funkcji.

source: Here's the example of a [code]move_and_rotate()[/code] function that moves the turtle forward and then turns it 90°.
hu: Itt egy példa a [code]move_and_rotate()[/code] függvényre, ami előremozdítja a teknőst, majd elforgatja 90 fokkal.
pl: Oto przykład funkcji [code]move_and_rotate()[/code], która przesuwa żółwia do przodu, a następnie obraca go o 90°.

source: The [code]move_and_rotate()[/code] function consists of two instructions, each on a separate line. Both of those instructions call another familiar function.
hu: A [code]move_and_rotate()[/code] függvény két utasításból áll, mindegyik új sorban. Ez a 2 utasítás, már ismerős függvényeket hív.
pl: Funkcja [code]move_and_rotate()[/code] składa się z dwóch instrukcji: każdej w osobnej linii. Obie z instrukcji wywołują inną, znaną nam funkcję.

source: You could write another function that calls [code]move_and_rotate()[/code] four times to draw a square of length 200 pixels.
hu: Írhatsz egy újabb függvényt, ami négyszer hívja [code]move_and_rotate()[/code] függvényt, hogy egy 200 pixel oldalhosszúságú négyzetet rajzoljon.
pl: Równie dobrze możemy teraz napisać kolejną funkcję, która wywoła [code]move_and_rotate()[/code] cztery razy, dzięki czemu narysujemy kwadrat o długości 200 pikseli.

source: Every time we call [code]move_and_rotate()[/code], the two functions [code]move_forward(200)[/code] and [code]turn_right(90)[/code] are called in sequence.
pl: Za każdym razem, gdy wywołujemy funkcję [code]move_and_rotate()[/code], dwie znajdujące się w jej wnętrzu funkcje ([code]move_forward(200)[/code] i [code]turn_right(90)[/code]) są wywoływane po kolei.

source: In this simple example, it may not feel super useful. Here's a more useful and realistic one: a function to draw any square.
hu: Ebben a pééldában talán nem tűnik nagyon hasznosnak. Itt egy hasznosabb és valóságosabb példa: egy függvény, ami egy négyzetet rajzol.
pl: W tak prostym przykładzie używanie funkcji wewnątrz siebie może nie wydawać się zbyt przydatne. Spróbujmy więc z bardziej użytecznym i realistycznym przykładem: funkcją do rysowania dowolnego prostokąta.

source: The following function uses [i]parameters[/i], which we will explore in the next lesson.
hu: A következő függvény [i]paramétereket[/i] használ, amiket a következő leckében vizsgálunk majd meg.
pl: Poniższa funkcja używa [i]parametrów[/i], które omówimy w następnej lekcji.

source: [i]Drag the slider to change the square's size.[/i]
hu: [i]Mozgasd a csúszkát, hgy változtasd a négyzet méretét.[/i]
pl: [i]Przeciągnij suwak, aby zmienić rozmiar rysowanego kwadratu.[/i]

source: How to define your own functions
hu: Így deklaráld a saját függvényeid
it: Come definire le tue funzioni
ja: 独自の関数を定義する方法
nl: Je eigen functies definiëren
pl: Jak definiować własne funkcje
ru: Как объявлять собственные функции
sv: Hur du definierar egna funktioner
tr: Kendi fonksiyonunu nasıl tanımlarsın
zh_hans: 如何定义自己的函数

source: Let's break down how you define a function.
hu: Nézzük meg, hogy deklarálhatod a saját függvényeid.
pl: Przejdźmy do tego, jak definiujemy funkcje.

source: A function definition starts with the [code]func[/code] keyword followed by a space, the function's name, parentheses, and a colon.
hu: A függvény deklaráció a [code]func[/code] kulcsszóval kezdődik, majd egy szőköz következik, ezután a függvény neve, zárójelek és végül egy kettőspont.
pl: Definicja funkcji zaczyna się zawsze od słowa kluczowego [code]func[/code], po którym następuje spacja, następnie nazwa funkcji, nawiasy i dwukropek.

source: The instructions inside the function [b]must[/b] all start with a leading tab character. You can insert that tab character by pressing the [b]Tab[/b] key.
hu: A függvényben lévő utasításoknak egy tab karkterrel [b]kell[/b] kezdődniük. Ezt a karaktert a [b]Tab[/b] billentyű lenyomásával illesztheted be.
pl: Wszystkie instrukcje wewnątrz funkcji [b]muszą[/b] zaczynać się od wiodącego znaku tabulacji. Możesz wstawić znak tabulacji, naciskając klawisz [b]TAB[/b].

source: We call those leading tabs [i]indents[/i]. They're important: the computer uses them to know which instructions are part of the same code block.
hu: Ezeket a kezdő tab karaktereket [i]indentációnak[/i] hívjuk. Fontos szerepük van: a számítógép arra használja őket, hogy tudja, mely utasítások tartoznak az adott kódblokkhoz.
pl: Ów wiodące tabulatory nazywamy [i]wcięciami[/i]. Są niezmiernie ważne: komputer używa ich, aby wiedzieć, które instrukcje są częścią tego samego bloku kodu.

source: Why do we use functions?
hu: Miért használunk függvényeket?
it: Perché usiamo le funzioni?
ja: なぜ関数を使用するのでしょうか?
nl: Waarom gebruiken we functies?
pl: Do czego używamy funkcji?
ru: Почему мы используем функции?
sv: Varför använder vi funktioner?
tr: Fonksiyonları neden kullanıyoruz?
zh_hans: 我们为什么要使用函数？

source: Functions are groups of instructions we reuse every time we call the function.
hu: A függvények utasítások csoportjai, amelyeket újr felhasználunk, ahányszor csak hívjuk a függvényt.
pl: Funkcje są grupami instrukcji, których używamy ponownie za każdym razem, gdy wywołujemy daną funkcję.

source: Because we give functions a name, they also allow us to name a set of instructions, which is handy!
hu: Mivel a a függvényeket eknevezzük, így a utasítások egy csoportját is el tudjuk nevezni, ami hasznos!
pl: Ponieważ nadajemy funkcjom nazwy, pozwala nam to nazwać zestawy instrukcji, co jest naprawdę przydatne!

source: To reuse code multiple times.
hu: Hogy többször felhasználhassuk a kódot.
it: Per riutilizzare del codice più volte.
ja: コードを複数回再利用するため。
nl: Om code meerdere keren te hergebruiken.
pl: Aby wielokrotnie użyć tego samego kodu.
ru: Чтобы переиспользовать код несколько раз.
sv: För att återanvända koden flera gånger.
tr: Kodu bir çok defa yeniden kullanmak için.
zh_hans: 多次重用代码。

source: To run multiple instructions in one go.
hu: Hogy egyszerre több utasítást is végrehajthassunk.
it: Per eseguire più istruzioni alla volta.
ja: 複数の命令を一度に実行します。
nl: Om meerdere instructies in één keer uit te voeren.
pl: Aby uruchomić kilka instrukcji na raz.
ru: Чтобы исполнить несколько инструкций одним вызовом.
sv: För att köra flera instruktioner på en gång.
tr: Tek seferde bir sürü talimatı çalıştırmak için.
zh_hans: 一次运行多条指令。

source: To put a name on multiple lines of code.
hu: Hogy elnevezhessünk több sornyi kódot.
it: Per dare un nome a più righe di codice.
ja: 複数行のコードに名前を付ける。
nl: Om een naam te geven aan meerdere regels code.
pl: Aby nazwać kilka linii kodu.
ru: Чтобы дать имя нескольким строчкам кода.
sv: Att sätta ett namn på flera rader kod.
tr: Çoklu kod satırlarına bir isim koymak için.
zh_hans: 给多行代码起一个名称。

source: Names in code have rules
hu: Az elnevezések a kódban szabályhoz kötöttek
it: L'assegnazione dei nomi ha delle regole
ja: コード内の名前にはルールがあります
nl: Namen in code moeten voldoen aan regels
pl: Nazwy w programowaniu mają swoje zasady
ru: Правила имён в коде
sv: Namn i kod har regler
tr: Kod içindeki isimlerin bir kuralı var
zh_hans: 代码中的名字有规则

source: Function identifiers cannot contain spaces. In general, names in programming languages cannot contain spaces.
hu: A függvény azonosítók nem tartalmazhatnak szóközt. Általánosságban, az elnevezések a programozásban nem tartalmazhatnak szóközt.
pl: Identyfikatory funkcji nie mogą zawierać spacji. Ogólnie wszystkie nazwy w językach programowania nie mogą ich zawierać.

source: The computer uses spaces to detect the separation between different keywords and identifiers.
hu: A számítógép arra használja a szóközöket, hogy el tudja választani egymástól a különböző kulcsszavakat és azonosítókat.
pl: Komputer wykorzystuje spacje do wykrywania separacji między różnymi słowami kluczowymi i identyfikatorami.

source: Instead of spaces, in GDScript, we use underscores ("_"). You saw this already with functions like [code]move_forward()[/code] or [code]move_local_x()[/code]. This is the convention we follow in GDScript.
hu: Szóköz helyett, GDScriptben, aláhúzásjelet használunk ("_"). Ezt már korábban is láttad a [code]move_forward()[/code] vagy a [code]move_local_x()[/code] függvényeknél. Ezt a jelölésrendszert használjuk GDScriptben.
pl: Zamiast spacji w GDScripcie używamy podkreśleń ("_"). Spotkałeś się już z nimi w funkcjach takich jak [code]move_forward()[/code] czy [code]move_local_x()[/code]. Jest to konwencja, którą stosujemy w języku GDScript.

source: There's another convention programmers use in some other programming languages.
hu: Más nyelvekben a programozók másféle jelölést használnak.
pl: Jest jeszcze jedna konwencja, którą programiści stosują w niektórych innych językach programowania.

source: Instead of using underscores, they start words with capital letters except for the first one. With that convention, you'd write function names like [code]moveForward()[/code] or [code]moveLocalX()[/code]
hu: Aláhúzásjel helyett, az első szó kivételével, mindet nagybetűvel kezdik. Ezzel a jelölésrendszerrel, így [code]moveForward()[/code] vagy így [code]moveLocalX()[/code] írnád a függvények neveit.
pl: Zamiast używać podkreśleń, zaczynają słowa wielkimi literami, z pominięciem pierwszego wyrazu. Zgodnie z tą konwencją tworząc funkcje nazwalibyśmy je [code]moveForward()[/code] lub [code]moveLocalX()[/code]

source: Identifiers also [i]have[/i] to start with a letter or an underscore; You [i]can't[/i] begin with a number, but you can use numbers after the first character.
hu: Ezenkívül, az azonosítóknak betűvel vagy aláhúzásjellel [i]kell[/i] kezdődniük; [i]Nem[/i] kezdhetsz számmal, de az első karakter után bárhol állhat szám.
pl: Identyfikatory również [i]muszą[/i] zaczynać się od litery lub podkreślenia: [i]nie możesz[/i] zacząć nazwy funkcji od liczby, możesz jednak używać cyfr w dalszej jej części (po pierwszym znaku).

source: Which of the following names are valid function names?
hu: Az alábbiak közül mely függvénynevek érvényesek?
it: Quale tra i seguenti nomi sono validi per delle funzioni?
ja: 次の名前のうち、有効な関数名はどれですか?
nl: Welke van de volgende namen zijn geldige functienamen?
pl: Które z poniższych nazw są poprawnymi nazwami funkcji?
ru: Какие из перечисленных имён являются корректными идентификаторами функций?
sv: Vilka av följande namn är giltiga funktionsnamn?
tr: Bu isimlerden hangileri, geçerli birer fonksiyon ismidir?
zh_hans: 以下哪个名称是有效的函数名称？

source: Note that it's fine to use capital letters.
hu: Emlékezz, hogy nyugodtan használhatsz nagybetűket.
it: Nota che non è un problema usare le lettere maiuscole.
ja: 大文字を使用しても問題ないことに注意してください。
nl: Merk op dat het prima is om hoofdletters te gebruiken.
pl: Pamiętaj, że możesz używać wielkich liter.
ru: Обратите внимание, что использование заглавных букв разрешено.
sv: Observera att det går bra att använda stora bokstäver.
tr: Büyük harf kullanmanın sorun olmadığına dikkat et.
zh_hans: 请注意，可以使用大写字母。

source: You can't name a function [code]move forward[/code] because it contains a space. Names in code cannot contain spaces.
hu: Nem adhatod egy függvénynek a [code]move forward[/code] nevet, mert szóközt tartalmaz. A kódban az elnevzések nem tartalmazhatnak szóközt.
pl: Nie możesz nazwać funkcji [code]move forward[/code] , ponieważ nazwa ta zawiera spację. Nazwy w kodzie nie mogą zawierać spacji.

source: They can't start with numbers either, which is why [code]45_degree_turn[/code] is also invalid.
hu: Számokkal sem kezdődhetnek, ezért érvénytelen a [code]45_degree_turn[/code] is.
pl: Nie mogą też zaczynać się od cyfr, dlatego [code]45_degree_turn[/code] również jest nieprawidłowa.

source: However, having numbers elsewhere in a function name is fine. That's why [code]make3NewCharacters[/code] works.
hu: Azonban, ha a névben máshol szerepel szám, az nem probléma. Ezért működik a [code]make3NewCharacters[/code].
pl: Jednak umieszczanie liczb w innym miejscu nazwy funkcji jest całkowicie w porządku. Dlatego nazwa [code]make3NewCharacters[/code] jest prawidłowa.

source: Instantly moving the turtle to a different position
hu: A teknős azonnali új helyre mozdítása
it: Muovendo istantaneamente la tartaruga in una posizione differente
ja: カメを別の位置に瞬時に移動する
nl: De schildpad onmiddellijk naar een andere plek verplaatsen
pl: Natychmiastowe przenoszenie żółwika na inną pozycję
ru: Мгновенно перемещаем черепашку в другое место
sv: Flytta omedelbart sköldpaddan till en annan position
tr: Kaplumbağayı hızlıca farklı bir konuma taşımak
zh_hans: 立即将海龟移动到不同的位置

source: In order to draw multiple squares in different positions, we introduce a new function for our turtle to use.
hu: Ahhoz, hogy több négyzetet is rajzolhassunk, különböző helyekre, bevezetünk a teknősünk számára egy új függvényt.
pl: Aby narysować wiele kwadratów w różnych pozycjach, potrzebna nam będzie nowa funkcja, z której może korzystać nasz żółwik.

source: The [code]jump()[/code] function picks up the turtle and places it relative to where it is.
hu: A [code]jump()[/code] függvény felemli a teknőst, és a megadott értékkel elmozdítja a jelenlegi helyétől.
pl: Funkcja [code]jump()[/code] podnosi żółwika i przemieszcza go względem miejsca, w którym się znajduje.

source: So calling [code]jump(-100, 50)[/code] moves the turtle by 100 pixels to the [b]left[/b] and 50 pixels [b]down[/b] without drawing any lines.
hu: Tehát a [code]jump(-100, 50)[/code] hívása 100 pixellel [b]balra[/b] és 50 pixellel [b]lefelé[/b] mozdítja el a teknősünket, anélkül, hogy vonalat húzna.
pl: Tak więc wywołanie [code]jump(-100, 50)[/code] przesunie żółwika o 100 pikseli w [b]lewo[/b] i 50 pikseli [b]w dół[/b] nie rysując przy tym żadnych linii.

source: A function to draw squares
hu: Egy négyzet rajzoló függvény
it: Una funzione che disegna quadrati
ja: 正方形を描く関数
nl: Een functie om vierkanten te tekenen
pl: Funkcja do rysowania kwadratów
ru: Функция для отрисовки квадратов
sv: En funktion som ritar rutor
tr: Kare çizen bir fonksiyon
zh_hans: 绘制正方形的函数

source: Code a function named [code]draw_square()[/code] to draw one square of length 200 pixels. The function should take no parameters.
hu: Írj egy [code]draw_square()[/code] nevű függvényt, ami egy 200 pixel oldalhosszúságú négyzetet rajzol. A függvény ne kérjen paramétereket.
pl: Stwórz funkcję o nazwie [code]draw_square()[/code], która rysować będzie jeden kwadrat o długości 200 pikseli. Funkcja nie powinna przyjmować żadnych parametrów.

source: Use the [code]move_forward()[/code] and [code]turn_right()[/code] functions to instruct the turtle.
hu: Használd a [code]move_forward()[/code] és a [code]turn_right()[/code] függvényeket a teknős irányítására.
pl: Użyj funkcji [code]move_forward()[/code] i [code]turn_right()[/code], aby poinstruować żółwika, jak powinien to zrobić.

source: In the following practice, you'll use the [code]draw_square()[/code] function to draw multiple squares by calling your own function.
hu: A következő gyakorlatban, a [code]draw_square()[/code] nevű függvényt fogod használni, hogy négyzeteket rajzolj a saját függvényed hívásával.
pl: W kolejnym ćwiczeniu użyjesz funkcji [code]draw_square()[/code] do narysowania wielu kwadratów wywołując stworzona przez siebie funkcję.

source: Until now, you've had to write code by hand, and it's boring. It's time to code a reusable function. You'll use it to draw multiple squares.
hu: Eddig minden kódot magadnak kellett megírnod, ami unalmas. Itt az ideje, hogy készítsünk egy újrafelhasználható függvényt. Ezzel fogsz négyzeteket rajzolni.
it: Fino ad ora, hai dovuto scrivere il codice a mano, questo è noioso. D'ora in poi useremo funzioni riutilizzabili. Le utilizzerai per disegnare molti quadrati.
ja: 今まではコードを手書きする必要があり、退屈でした。 再利用可能な関数をコーディングします。 これを使用して複数の正方形を描画します。
nl: Tot dusver moest je code met de hand schrijven en dat is saai. Het is tijd om een herbruikbare functie te schrijven. Je zult het gebruiken om meerdere vierkanten te tekenen.
pl: Dotychczas musiałeś pisać cały kod ręcznie, co było dość nudne. Czas stworzyć funkcję wielokrotnego użytku. Użyjesz jej do narysowania wielu kwadratów.
ru: До сих пор, вам приходилось писать код от руки, и это скучно. Настало время создать переиспользуемые функции. Они пригодятся вам для того, чтобы нарисовать несколько квадратов.
sv: Hittills har du fått skriva kod för hand, och det är tråkigt. Det är dags att koda en återanvändbar funktion. Du kommer att använda den för att rita flera kvadrater.
tr: Şimdiye kadar, kodları elle yazman gerekiyordu, ve bu biraz sıkıcı. Yeniden kullanılabilir bir fonksiyon yazmanın zamanı geldi. Çoklu kareler çizmek bunu kullanacaksın.
zh_hans: 迄今为止，你都不得不手写代码，这很无聊。 是时候编写一个可以重复调用的函数了。 你将使用它来绘制多个正方形。

source: Drawing multiple squares
hu: Több négyzet rajzolása
it: Disegnare molti quadrati
ja: 複数の正方形を描く
nl: Meerdere vierkanten tekenen
pl: Rysowanie wielu kwadratów
ru: Рисуем несколько квадратов
sv: Rita flera kvadrater
tr: Çoklu kareler çizmek
zh_hans: 绘制多个正方形

source: You have a function to draw one square: [code]draw_square()[/code]. Use it to draw three squares.
hu: Van egy függvényed, ami egy négyzetet rajzol: [code]draw_square()[/code]. Rajzolj vele 3 négyzetet.
pl: Mamy już funkcję do rysowania jednego kwadratu: [code]draw_square()[/code]. Użyjmy jej, aby narysować trzy kwadraty.

source: We already created [code]draw_square()[/code] for you. Create a function named [code]draw_three_squares[/code] that calls [code]draw_square()[/code] three times.
hu: Már előre elkészítettük számodra a [code]draw_square()[/code] függvényt. Készíts egy [code]draw_three_squares[/code] nevű függvényt, ami háromszor hívja a [code]draw_square()[/code] függvényt.
pl: Stworzyliśmy już za ciebie funkcję [code]draw_square()[/code]. Utwórz nową funkcję o nazwie [code]draw_three_squares[/code], która trzykrotnie wywoła funkcję [code]draw_square()[/code].

source: If you just call the function, all three squares will overlap. To stack them diagonally, call [code]jump(300, 300)[/code] between two calls to [code]draw_square()[/code].
hu: Ha egyszerűen csak hívod a függvényt, egymásra fogja rajzolni mindhárom négyzetet. Ahhoz, hogy átlósan rajzoltasd ki őket, hívd a [code]jump(300, 300)[/code] függvényt a [code]draw_square()[/code] függvények közt.
pl: Jeśli po prostu wywołasz funkcję, wszystkie trzy kwadraty nałożą się na siebie. Aby ustawić je po przekątnej, pomiędzy wywołaniami funkcji [code]draw_square()[/code] wstaw [code]jump(300, 300)[/code].

source: Calling [code]jump(300, 300)[/code] makes the turtle jump by 300 pixels to the right and 300 pixels down without drawing any lines.
hu: A [code]jump(300, 300)[/code] hatására a teknős 300 pixelt ugrik jobbra és le, anélkül, hogy vonalat húzna.
pl: Wywołanie [code]jump(300, 300)[/code] spowoduje, że nasz żółwik przeskoczy o 300 pikseli w prawo i 300 pikseli w dół bez pozostawiania za sobą linii.
