Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-6-multiple-function-parameters.po
Languages: da, hu, pl, sk, sv, tr, uk, zh_hans

source: In the previous lesson, you created a function to draw a square of a fixed size.
da: I den forrige lektion oprettede du en funktion til at tegne et kvadrat med en fast størrelse.
tr: Önceki bölümde, sabit boyutlu bir kare çizdiren bir fonksiyon yazdınız.
uk: На попередньому уроці ви створили функцію для малювання квадрата фіксованого розміру.

source: This function is a bit limiting. Instead, it would be much better if we had a function to draw a square of [i]any[/i] size. Or better: any kind of rectangle (a square is a specific kind of rectangle).
da: Denne funktion er en smule begrænsning. I stedet ville det være meget bedre, hvis vi havde en funktion til at tegne et kvadrat i [i]hvilken som helst[/i] størrelse. Eller bedre: enhver form for rektangel (en kvadrat er en specifik slags rektangel).
hu: Ez a függvény egy kissé korlátolt. Ehelyett, aokkal jobb lenne, ha a függvényünk [i]bármilyen[/i] méretű négyzetet tudna rajzolni. vagy, ami még jobb: bármilyen téglalpot (a négyzet is csak egy bizonyos fajtájú téglalap).
tr: Bu fonksiyon biraz kısıtlayıcı. Bunun yerine, [i]herhangi[/i] bir boyutta bir kare çizdiren bir fonksiyonumuz olsa çok daha iyi olurdu. Veya daha iyisi: herhangi bir dikdörtgen çizdiren (kare, aslında özel bir dikdörtgen çeşididir).
uk: Ця функція трохи обмежена. Було б значно корисніше мати функцію для малювання квадрата [i]довільного[/i] розміру. Або краще: будь-якого прямокутника (квадрат - це різновид прямокутника).

source: In previous lessons, you used the [code]rotate()[/code] function and gave it an [b]argument[/b].
da: I tidligere lektioner brugte du funktionen [code]rotate()[/code] og gav den et [b]argument[/b].
tr: Önceki derslerde, [code]rotate()[/code] fonksiyonunu kullandınız ve ona bir [i]girdi değişkeni[/i] (argüman) verdiniz.
uk: У попередніх уроках під час виклику функції [code]rotate()[/code] ви передавали їй [b]аргумент[/b].

source: Just like [code]rotate()[/code], we can also give our functions [b]parameters[/b].
da: Ligesom med [code]rotate()[/code] kan vi også give vores funktioner [b]parametre[/b].
tr: [code]rotate()[/code] için olduğu gibi, kendi fonksiyonlarımıza da [i]alınan değişkenler[/i] (parametre) verebiliriz.
uk: Так само, як і [code]rotate()[/code], ми також можемо надати нашим функціям [b]параметри[/b].

source: Parameters act as [i]placeholders[/i] in the function's code. They work like blank spaces that get filled in each time someone calls your function.
da: Parametre fungerer som [i]pladsholdere[/i] i funktionens kode. De fungerer som tomme felter, der udfyldes, hver gang nogen kalder din funktion.
tr: Parametreler, fonksiyonun kodunda [i]yer tutucular[/i] olarak işlev görür. Bunlar, biri sizin fonksiyonunuzu her çağırdığında doldurulan boş kutular gibi çalışır.
uk: Параметри діють як [i]заповнювачі[/i] в коді функції. Вони працюють як порожні місця, які заповнюються кожного разу, коли хтось викликає вашу функцію.

source: When you write a function with parameters, you create a flexible template that can work with different values each time you use it. Let's see how the rotate() function is defined and uses a parameter:
da: Når du skriver en funktion med parametre, opretter du en fleksibel skabelon, der kan arbejde med forskellige værdier, hver gang du bruger den. Lad os se, hvordan rotate()-funktionen er defineret og bruger en parameter:
tr: Parametreli bir fonksiyon yazdığınızda, her kullandığınızda farklı değerlerle çalışabilecek esnek bir şablon oluşturursunuz. Hadi şimdi rotate() fonksiyonunun nasıl tanımlandığını ve bir parametreyi nasıl kullandığını görelim:
uk: Коли ви пишете функцію з параметрами, ви створюєте гнучкий шаблон, який може працювати з різними значеннями кожного разу, коли ви його використовуєте. Давайте подивимося, як функція rotate() визначається і використовує параметр:

source: For now, focus on the first line, the function [i]definition[/i]: [code]func rotate(radians)[/code].
da: Fokuser for nu på den første linje, [i]funktionsdefinitionen[/i]: [code]func rotate(radians)[/code].
tr: Şimdilik, ilk satıra, yani fonksiyonun [i]tanımlanmasına[/i] odaklanın: [code]func rotate(radians)[/code].
uk: А зараз зосередьтеся на цьому рядку: [code]func rotate(radians)[/code].

source: The word [code]radians[/code] is the function's parameter. It's the placeholder that gets "replaced" with the actual value when you call the function.
da: Ordet [code]radians[/code] er funktionens parameter. Det er den pladsholder, der "erstattes" med den faktiske værdi, når du kalder funktionen.
tr: [code]radians[/code] kelimesi fonksiyonun parametresidir. Bu, fonksiyonu çağırdığınızda gerçek değerle "değiştirilen" yer tutucudur.
uk: Слово [code]radians[/code] є параметром функції. Це заповнювач, який «замінюється» фактичним значенням під час виклику функції.

source: When you [i]call[/i] this function with [code]rotate(0.5)[/code], the computer replaces the name "radians" in the function with [code]0.5[/code].
da: Når du [i]kalder[/i] denne funktion med [code]rotate(0.5)[/code], erstatter computeren navnet "radians" i funktionen med [code]0.5[/code].
tr: Bu fonksiyonu [code]rotate(0.5)[/code] şeklinde [i]çağırdığınızda[/i], bilgisayar fonksiyondaki "radians" adını [code]0.5[/code] ile değiştirir.
uk: Коли ви викликаєте [code]rotate(0.5)[/code], комп'ютер прив'язує значення [code]0.5[/code] до мітки [code]radians[/code].

source: Each time you call the function, the replacement happens again: If you call [code]rotate(1.2)[/code], [code]radians[/code] becomes [code]1.2[/code].
da: Hver gang du kalder funktionen, sker erstatningen igen: Hvis du kalder [code]rotate(1.2)[/code], bliver [code]radians[/code] til [code]1.2[/code].
tr: Fonksiyonu her çağırdığınızda, bu değiştirme işlemi tekrar gerçekleşir: Eğer [code]rotate(1.2)[/code] olarak çağırırsanız, [code]radians[/code] değeri [code]1.2[/code] olur.
uk: Щоразу, коли ви викликаєте функцію, заміна відбувається знову: якщо ви викликаєте [code]rotate(1.2)[/code], [code]radians[/code] стає [code]1.2[/code].

source: The parameter can be filled with a number, text, or anything else. In this lesson, we'll only use numbers as we have yet to learn about other value types.
da: Parameteren kan udfyldes med et tal, tekst eller hvad som helst andet. I denne lektion bruger vi kun tal, da vi endnu ikke har lært om andre værdityper.
tr: Parametre içine sayı, metin veya başka herhangi bir şey girilebilir. Bu derste, diğer değer türlerini henüz öğrenmediğimiz için sadece sayılar kullanacağız.
uk: Параметр може бути заповнений числом, текстом або будь-чим іншим. У цьому уроці ми будемо використовувати тільки числа, оскільки про інші типи значень ми ще не вивчали.

source: What is a function parameter?
da: Hvad er en funktionsparameter?
hu: Mi az a függvény paraméter?
pl: Czym są parametry funkcji?
sk: Čo je parameter funkcie?
sv: Vad är en funktionsparameter?
tr: Bir fonksiyonun alınan değişkeni (parametresi) nedir?
uk: Що таке параметр функції?
zh_hans: 什么是函数参数？

source: A parameter is a placeholder that gets replaced with the actual value you pass when calling the function.
da: En parameter er en pladsholder, der erstattes med den faktiske værdi, du angiver, når du kalder funktionen.
tr: Bir parametre, fonksiyonu çağırırken aktardığınız gerçek değerle değiştirilen bir yer tutucudur.
uk: Параметр — це замінник, який замінюється фактичним значенням, яке ви передаєте під час виклику функції.

source: The value can be different each time you call the function: it depends on what you put in parentheses.
da: Værdien kan være forskellig hver gang du kalder funktionen: det afhænger af, hvad du sætter i parentes.
uk: Значення може змінюватися: воно залежить від того, що ви напишете в круглих дужках під час виклику функції.

source: A label you give to a value the function receives.
da: En etiket du giver til en værdi, som funktionen modtager.
hu: Egy címke, amit annak az értéknek adsz, amit fogad a függvény.
pl: Etykietą nadawaną wartości, którą otrzymuje funkcja.
sk: Označenie, ktoré priradíte hodnote, ktorú funkcia dostane.
sv: En etikett du ger till ett värde som funktionen får.
tr: Fonksiyonun aldığı bir değere verdiğiniz etikettir.
uk: Назва для значення, яке приймає функція.
zh_hans: 您为函数接收的值赋予的标签。

source: A number you use to make calculations.
da: Et tal, du bruger til at lave beregninger.
hu: Egy szám, amivel műveleteket végzel.
pl: Liczbą używaną do wykonywania obliczeń.
sk: Číslo, ktoré používate na výpočty.
sv: Ett tal du använder för att göra beräkningar.
tr: Hesaplama yapmak için kullandığınız bir sayıdır.
uk: Число, яке ви використовуєте для обчислень.
zh_hans: 用于计算的数字。

source: The name of a function.
da: Navnet på en funktion.
hu: A függvény neve.
pl: Nazwą funkcji.
sk: Názov funkcie.
sv: Namnet på en funktion.
tr: Bir fonksiyonun ismidir.
uk: Назва функції.
zh_hans: 函数的名称。

source: How to create functions with parameters
da: Sådan oprettes funktioner med parametre
hu: Így kell paraméteres függvényket létrehozni
pl: Jak stworzyć funkcję z parametrami
sk: Ako vytvoriť funkcie s parametrami
sv: Hur man skapar funktioner med parametrar
tr: Alınan değişkenleri olan bir fonksiyon oluşturmak
uk: Як створювати функції з параметрами
zh_hans: 如何创建带参数的函数

source: When you write a function [i]definition[/i] (the line starting with the [code]func[/code] keyword), you can add parameters.
da: Når du skriver en funktions [i]definition[/i] (linjen der starter med nøgleordet [code]func[/code]), kan du tilføje parametre.
uk: Коли ви пишете [i]визначення[/i] функції (рядок, що починається з ключового слова [code]func[/code]), ви можете додати параметри.

source: To add a parameter, write a placeholder name inside the parentheses. When someone calls your function with a value, every copy of the parameter in the function gets replaced with that value.
da: For at tilføje en parameter skal du skrive et pladsholdernavn i parenteserne. Når nogen kalder din funktion med en værdi, erstattes alle kopier af parameteren i funktionen med den pågældende værdi.
uk: Щоб додати параметр, впишіть ім'я замінювача в дужки. Коли хтось викликає вашу функцію із значенням, кожна копія параметра у функції замінюється цим значенням.

source: You can give parameters any name! How you name functions and parameters is up to you.
da: Du kan give parametre et hvilket som helst navn! Hvordan du navngiver funktioner og parametre er op til dig.
uk: Ви можете назвати параметри як завгодно! Як називати функцій та параметри — вирішуєте ви.

source: Just remember that names cannot contain spaces. To write parameter names with multiple words, in GDScript, we use underscores by convention.
da: Husk blot, at navne ikke må indeholde mellemrum. For at skrive parameternavne med flere ord bruger vi i GDScript understregninger ifølge konventionen.
uk: Просто пам'ятайте, що назви не можуть містити пропусків. Для запису назв параметрів, що складаються з кількох слів, у GDScript слід використовувати символи підкреслення.

source: The following function definition is exactly equivalent to the previous one.
da: Den følgende funktionsdefinition er nøjagtig den samme som den foregående.
hu: A következő függvény deklaráció pontosan megegyezik az előzővel.
sk: Nasledujúca definícia funkcie je presne ekvivalentná predchádzajúcej.
tr: Aşağıdaki fonksiyon tanımı, daha önceki ile tamamen aynıdır.
uk: Наступне оголошення функції еквівалентне попередньому.

source: Parameters make your code easier to reuse. You write the function once as a template, then you can call it many times with different values.
da: Parametre gør din kode nemmere at genbruge. Du skriver funktionen én gang som en skabelon, og derefter kan du kalde den mange gange med forskellige værdier.
uk: Параметри полегшують повторне використання коду. Ви пишете функцію один раз як шаблон, а потім можете викликати її багато разів з різними значеннями.

source: Here's an example with a function to draw any square. The parameter [code]length[/code] is a placeholder. Use the slider to change the value. When you click the button, the app calls [code]draw_square()[/code] and the placeholder gets replaced with your value, drawing squares of different sizes.
uk: Ось приклад з функцією для малювання будь-якого квадрата. Параметр [code]length[/code] є місцем для заповнення. Використовуйте повзунок, щоб змінити значення. Коли ви натискаєте кнопку, програма викликає [code]draw_square()[/code], і місце для заповнення замінюється вашим значенням, малюючи квадрати різних розмірів.

source: Which is the correct syntax for a function definition?
da: Hvad er den korrekte syntaks for en funktionsdefinition?
hu: Mi a helyes szintaktika a függvény deklarálásakor?
pl: Która z podanych definicji składni funkcji jest poprawna?
sk: Ktorá syntax je správna pre definíciu funkcie?
sv: Vilken är den korrekta syntaxen för en funktionsdefinition?
tr: Fonksiyon tanımlaması için, hangisi doğru yazım şeklidir?
uk: Який синтаксис є правильним для оголошення функції?
zh_hans: 函数定义的正确语法是什么？

source: To define a function, you need to start with the [code]func[/code] keyword followed by a space, the [code]function_name[/code], and optional parameters inside parentheses.
da: For at definere en funktion skal du starte med nøgleordet [code]func[/code] efterfulgt af et mellemrum, [code]function_name[/code] og valgfrie parametre i parenteser.
hu: Függvény deklarálását a [code]func[/code] kulcsszóval kezdjük, majd egy szőköz következik, ezután a [code]fuggveny_neve[/code], majd az opcionális paraméterek a zárójelben.
sk: Ak chcete definovať funkciu, musíte začať kľúčovým slovom [code]func[/code], za ktorým nasleduje medzera, [code]function_name[/code] a voliteľné parametre v zátvorkách.
tr: Bir fonksiyon tanımlamak için, [code]func[/code] anahtar kelimesi ile başlayıp boşluk bırakmanız, [code]fonksiyon_ismi[/code] yazmanız, ve isteğe bağlı alınan değişken isimlerini parantez içerisinde vermeniz gerekir.
uk: Щоб оголосити функцію, потрібно розпочати із ключового слова [code]func[/code], за ним поставити пропуск, [code]function_name[/code] і, за необхідності, вказати в круглих дужках параметри.

source: You must end the line with a colon, which defines a new code block. We'll see moving forward that keywords other than [code]func[/code] require a colon at the end of the line.
da: Du skal afslutte linjen med et kolon, som definerer en ny kodeblok. Vi vil fremover se, at andre nøgleord end [code]func[/code] kræver et kolon i slutningen af linjen.
hu: A sort kettősponttal kell zárni, ami deklarálja az új kódblokkot. Később látni fogjuk, hogy nem a [code]func[/code] az egyetlen, aminél kettőspont kell a sor végére.
sk: Riadok musíte ukončiť dvojbodkou, ktorá definuje nový blok kódu. Ďalej uvidíme, že iné kľúčové slová ako [code]func[/code] vyžadujú dvojbodku na konci riadku.
tr: Satırın en sonuna iki nokta üstüste koymalısınız, bu şekilde bir kod bölgesi tanımlarsınız. İleride, [code]func[/code] haricinde başka anahtar kelimelerinde, satır sonunda iki nokta üstüste istediklerini göreceğiz.
uk: В кінці рядка слід поставити двокрапку, що визначає новий блок коду. Надалі ми побачимо, що є інші ключові слова, крім [code]func[/code], після яких у кінці рядка також ставиться двокрапка.

source: func function_name(parameter_name):
da: func funktion_navn(parameter_navn):
pl: func nazwa_funkcji(nazwa_parametru):
sv: func funktion_namn(parameter_namn):
tr: func fonksiyon_ismi(alınan_değişken_ismi):
uk: func назва_функції(назва_параметра):
zh_hans: func 函数名（参数名）：

source: func (function_name): parameter_name
da: func (funktion_navn): parameter_navn
pl: func (nazwa_funkcji): nazwa_parametru
sv: func (funktion_namn): parameter_namn
tr: func (fonksiyon_ismi): alınan_değişken_ismi
uk: func (назва_функції): назва_параметра
zh_hans: func (函数名): 参数名

source: func function_name(parameter_name)
da: func funktion_navn(parameter_navn)
pl: func nazwa_funkcji(nazwa_parametru)
sv: func funktion_namn(paramter_namn)
tr: func fonksiyon_ismi (alınan_değişken_ismi)
uk: func назва_функції(назва_параметра)
zh_hans: func 函数名（参数名）

source: function_name(parameter_name):
da: funktion_navn(parameter_navn):
pl: nazwa_funkcji(nazwa_parametru):
sv: funktion_namn(parameter_namn):
tr: fonksiyon_ismi (alınan_değişken_ismi):
uk: назва_функції(назва_параметра):
zh_hans: 函数名（参数名）：

source: Functions can have multiple parameters
da: Funktioner kan have flere parametre
hu: A függvényeknek több paramétere is lehet
pl: Funkcje mogą mieć wiele parametrów
sk: Funkcie môžu mať viacero parametrov
sv: Funktioner kan ha flera parametrar
tr: Fonksiyonlar, birden fazla alınan değişkene sahip olabilirler
uk: Функції можуть мати декілька параметрів
zh_hans: 函数可以有多个参数

source: A function can have multiple parameters. You can use as many placeholders as you [i]need[/i].
uk: У функції можна використати кілька параметрів. Насправді, ви можете використовувати стільки параметрів, скільки [i]потрібно[/i].

source: To add multiple parameters, write a comma between each placeholder name.
uk: Щоб розділити параметри функції, між ними ставлять кому.

source: For example, [code]func move(x, y)[/code] has two placeholders: [code]x[/code] and [code]y[/code]. Each one gets replaced with its own value when you call the function.
uk: Наприклад, [code]func move(x, y)[/code] має два заповнювачі: [code]x[/code] та [code]y[/code]. Кожен з них замінюється своїм значенням під час виклику функції.

source: Must I write spaces between function parameters?
da: Skal jeg skrive mellemrum mellem funktionsparametre?
tr: Fonksiyon parametreleri arasına boşluk koymalı mıyım?
uk: Чи потрібно писати пробіли між параметрами функції?

source: In a function definition, you must have a space between the [code]func[/code] keyword and the function name.
da: I en funktionsdefinition skal der være et mellemrum mellem nøgleordet [code]func[/code] og funktionsnavnet.
hu: A függvény deklarációban muszáj szóközt tenni a [code]func[/code] kulcsszó és a függvény neve közé.
sk: V definícii funkcie musí byť medzi kľúčovým slovom [code]func[/code] a názvom funkcie medzera.
tr: Bir fonksiyonun tanımında, [code]func[/code] anahtar kelimesi ile fonksiyonun ismi arasına boşluk koymanız gerekir.
uk: В оголошенні функції між ключовим словом [code]func[/code] і назвою функції має бути пропуск.

source: However, because we use the comma to separate parameters, it doesn't matter if you use spaces between parameters. As long as you have the comma, either syntax is correct.
da: Men fordi vi bruger komma til at adskille parametre, er det ligegyldigt, om du bruger mellemrum mellem parametre. Så længe du har kommaet, er begge syntakser korrekte.
hu: Azonban, mivel a paramétereket vesszővel választjuk el, itt nem számít, hogy használsz-e szóközt. Amíg ott a vessző, mindkét megoldás helyes.
sk: Keďže však na oddelenie parametrov používame čiarku, nezáleží na tom, či medzi parametrami použijete medzery. Pokiaľ máte čiarku, obe syntaxe sú správne.
tr: Ancak, alınan değişkenleri birbirinden ayırmak için virgül kullandığımız için, aralara boşluk koyman bir şeyi değiştirmez. Virgüller olduğu sürece, iki yazım şekli de geçerlidir (isimlerin içine koymadığınız sürece).
uk: Однак, оскільки ми відокремлюємо параметри комою, використовувати пропуски між ними не обов'язково. За наявності коми будь-який синтаксис буде правильним.

source: We often use spaces after the comma for readability.
da: Vi bruger ofte mellemrum efter kommaet for at gøre det nemmere at læse.
hu: A jobb olvashatóság miatt használunk szóközöket.
sk: Kvôli čitateľnosti často používame medzery za čiarkou.
tr: Sıklıkla, okunabilirliği arttırmak için, virgülden sonra boşluk koyarız.
uk: Ми часто ставимо пропуск після коми для зручності читання.

source: The following example shows a function with two parameters. The function moves an entity on both the X and Y axes.
uk: У цьому прикладі оголошено функцію, яка використовує два параметри для переміщення об'єкта вздовж осей X та Y.

source: When you call [code]move(50, 100)[/code], every [code]x[/code] in the function gets replaced with [code]50[/code], and every [code]y[/code] gets replaced with [code]100[/code].
uk: Коли ви викликаєте [code]move(50, 100)[/code], кожен [code]x[/code] у функції замінюється на [code]50[/code], а кожен [code]y[/code] замінюється на [code]100[/code].

source: How should I name my functions and parameters?
da: Hvordan skal jeg navngive mine funktioner og parametre?
hu: Hogyan nevezzem el a függvényeim és a paramétereim?
pl: Jak powinienem nazywać swoje funkcje i parametry?
sk: Ako mám pomenovať funkcie a parametre?
sv: Hur ska jag namnge mina funktioner och parametrar?
tr: Fonksiyonlarıma ve alınan değişkenlerine nasıl isim vermeliyim?
uk: Як правильно називати свої функції та параметри?
zh_hans: 我应该如何命名我的函数和参数？

source: The names of functions, parameters, or other things in your code are entirely up to you.
da: Navnene på funktioner, parametre eller andre ting i din kode er helt op til dig.
hu: A kódodban a függvényeknek, paramétereknek, változóknak olyan neve adsz, amilyet szeretnél.
sk: Názvy funkcií, parametrov alebo iných vecí v kóde sú len na vás.
tr: Kodunuzda bulunan fonksiyonların, alınan değişkenlerin, ve diğer şeylerin isimleri tamamen size kalmış
uk: Назви функцій, параметрів та інших речей у вашому коді залежать лише від вас.

source: They are written by us programmers for other programmers. You want to use the names that make the most sense to you and fellow programmers.
da: De er skrevet af os programmører til andre programmører. Du skal bruge de navne, der giver mest mening for dig og dine medprogrammører.
hu: Ezeket mi, programozók írjuk, más programozóknak. Olyan neveket kellene választanod, amik a leginkább egyértelműek neked és a többi programozónak.
sk: Píšeme ich my programátori pre iných programátorov. Chcete používať názvy, ktoré vám a kolegom programátorom dávajú najväčší zmysel.
tr: Bunlar, biz programcılar tarafından, diğer programcılar için yazılır. Kullanmak istediğiniz isimlerin, siz ve meslektaş programcılar için en anlamlı olanlardan olmasını istersiniz.
uk: Їх написали ми, програмісти, для інших програмістів. Правильніше використовувати назви, які несуть найбільше змісту для вас та інших програмістів.

source: You could absolutely write single-letter names like in maths classes: [code]a[/code], [code]b[/code], [code]f[/code].
da: Du kan absolut skrive navne med et enkelt bogstav, som i matematiktimerne: [code]a[/code], [code]b[/code], [code]f[/code].
hu: Simán írhatsz egybetűs változókat, mint matek órán: [code]a[/code], [code]b[/code], [code]f[/code].
sk: Rozhodne môžete písať jednopísmenové názvy ako na hodinách matematiky: [code]a[/code], [code]b[/code], [code]f[/code].
tr: Matematikte kullanılan, [code]a[/code], [code]b[/code], [code]f[/code] gibi tek harflik bir isim bile kullanabilirdiniz.
uk: Ви можете писати однолітерні назви, як на уроках математики: [code]a[/code], [code]b[/code], [code]f[/code].

source: You can also write abbreviated names like [code]pos[/code] for position, [code]bg[/code] for background, and so on.
da: Du kan også skrive forkortede navne som [code]pos[/code] for position, [code]bg[/code] for baggrund osv.
hu: Használhatsz rövidítésket is, például [code]pos[/code], mint position (pozíció), [code]bg[/code], mint background (háttér), stb.
sk: Môžete písať aj skrátené názvy, napríklad [code]pos[/code] pre pozíciu, [code]bg[/code] pre pozadie a podobne.
tr: Hatta, konum için [code]pos[/code] (position), arka plan için [code]bg[/code] (background), ve buna benzer kısaltılmış isimlerde yazabilirsiniz.
uk: Також ви можете писати скорочені назви, наприклад [code]pos[/code] для позиції, [code]bg[/code] для тла тощо.
