Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-27-value-types.po
Languages: hu, zh_hans

source: In your code, values have a particular [i]type[/i]. You have already learned about several: whole numbers, decimal numbers, strings, 2D vectors, arrays, and dictionaries.
hu: A kódodban az értékeknek, van egy egyedi [i]típusa[/i]. Korábban már tanultál egy párról: egész számok, tört számok, szövegek, 2D-s vektorok, tömbök és könyvtárak.

source: The computer uses the type of a value to know which operations and functions you can use with them.
hu: A számítógép arra használja a típusokat, hogy tudja, milyen műveleteket hajthat végre rajtuk.

source: As a result, it's essential to understand types: they are not fully compatible with one another, and misusing them will cause errors.
hu: Emiatt, elengedhetetlen, hogy értsük a típusokat: nem teljesen kompatibilisek egymással, és a helytelen használatuk hibákhoz vezet.

source: A prime example
hu: Egy remek példa
zh_hans: 一个典型的例子

source: You want to display the player's health in the interface. Your code tracks health as a whole number, a value of type [code]int[/code] (short for integer).
hu: Meg akarod jeleníteni a játékos életét a kijelzőn. A kódod ezt az értéket egész számként, azaz [code]int[/code] (integer) típusúként tárolja.
zh_hans: 您想在界面中显示玩家的健康状况。 您的代码将健康跟踪为一个整数，一个 [code]int[/code] 类型的值（整数的缩写）。

source: However, to display it on the player's screen, the computer wants text: it needs a value of type [code]String[/code].
hu: Azonban, ahhoz, hogy ezt ki tudd íratni a képernyőre, a számítógépnek szövegre van szüksége: [code]String[/code] típusú változót kér.

source: You can concatenate two strings with the [code]+[/code] operator.
hu: Két szöveget összefűzhetsz a [code]+[/code] segítségével.

source: So the following code looks like it could work at first glance.
hu: Tehát, az alábbi kód elsőre működőképesnek tűnik.
zh_hans: 所以下面的代码乍一看似乎可以工作。

source: But when running the code, we get this strange error.
hu: Azonban, ha futtatni próbáljuk, a következő hibaüzenetet kapjuk.
zh_hans: 但是在运行代码时，我们得到了这个奇怪的错误。

source: It tells you can't add values of type [code]String[/code] and [code]int[/code]: they're incompatible.
hu: Azt mondja, hogy nem adhatsz össze egy [code]String[/code] és egy [code]int[/code] típusú változót: inkompatibilisek.

source: In that case, you need to convert the [code]health[/code] number into a [code]String[/code].
hu: Ebben az esetben, át kell konvertálnod a [code]health[/code] értékét [code]String[/code]-gé.

source: Converting values into strings
hu: Értékek konvertálása szöveggé
zh_hans: 将值转换为字符串

source: You can get the text representation of a value by calling the [code]str()[/code] function (short for "string"). The function returns its argument as a new [code]String[/code].
hu: Egy érték szöveges reprezentációját a [code]str()[/code] (string) függvény hívásával teheted meg. A függvény visszatérési értéke egy [code]String[/code] lesz, ami tartalmazza a változó értékét.

source: You can use this function whenever you want to turn some number or vector into text.
hu: Ezt a függvényt bármikor használhatod, ha egy számot, vagy vektort szöveggé szeretnél alakítani.

source: In this case, it turns the number [code]100[/code] into the string [code]"100"[/code]. Or whatever number [code]health[/code] is currently.
hu: Ebben az esetben, a [code]100[/code] számot [code]"100"[/code] szöveggé alakítja. Vagy bármilyen más számot, ami épp a [code]health[/code] értéke.
zh_hans: 在这种情况下，它将数字 [code]100[/code] 转换为字符串 [code]"100"[/code]。 或当前 [code]health[/code] 的任何数字。

source: Converting strings into numbers
hu: Szöveg konvertálása számmá
zh_hans: 将字符串转换为数字

source: You can also convert strings into whole numbers or decimal numbers using respectively the [code]int()[/code] and [code]float()[/code] functions.
hu: Ugyanígy szöveget is átalakíthatsz egész, vagy tört számmá, az [code]int()[/code] és a [code]float()[/code] függvények segítségével.

source: Those functions can convert what the player writes in a text field into a number. For example, the number of potions to sell at once in a shop.
hu: Ezek a függvények számmá alakítják azt, amit a játékos beír egy szövegmezőbe. Például, hogy hány üveg elixírt szeretnél eladni egyszerre a boltban.

source: Some types are partially compatible
hu: Néhány típus részben kompatibilis
zh_hans: 某些类型部分兼容

source: Most types are incompatible. For example, you can't directly add or multiply an array with a number.
hu: A legtöbb típus inkompatibilis. Például, nem tudsz közvetlenül összeszorozni egy tömböt egy számmal.

source: However, some types are [i]partially[/i] compatible. For example, you can multiply or divide a vector by a number.
hu: Azonban, néhány típus [i]részlegesen[/i] kompatibilis. Például, szorozhatsz vagy oszthatsz egy vektort egy számmal.

source: It is possible because other developers defined that operation for you under the hood.
hu: Ez lehetséges, mert más fejlesztők már megoldották helyetted ezt a műveletet a színfalak mögött.

source: However, you cannot directly add or subtract a number to a vector. You'll get an error. That's why, in earlier lessons, you had to access the sub-variables of [code]position[/code] to add numbers to them.
hu: Azonban, nem adhatsz vagy vonhastz ki közvetlenül egy számot egy vektorból. Hibaüzenetet fogsz kapni. A korábbi leckékben ezért kellett a [code]position[/code] alváltozóit használni, hogy számokat add az értékeihez.

source: A surprising result
hu: Egy meglepő eredmény
zh_hans: 出人意料的结果

source: Take the following division: [code]3/2[/code]. What result would you expect to get? [code]1.5[/code]?
hu: Vegyük a következő osztást: [code]3/2[/code]. Milyen eredményre számítasz? [code]1.5[/code]?
zh_hans: 采取以下划分：[code]3/2[/code]。 你希望得到什么结果？ [code]1.5[/code]？

source: Well, for the computer, the result of [code]3/2[/code] is [code]1[/code].
hu: Nos, a számítógép szerint [code]3/2[/code] az [code]1[/code].

source: Wait, what?!
hu: Hogy mi?!

source: That's because, for the computer, the division of two whole numbers should always result in a whole number.
hu: Ez azért van, mert, ha a számítógép két egész számot oszt, akkor az eredmény is egész szám lesz.

source: When you divide decimal numbers instead, you will get a decimal number as a result.
hu: Ha törtszámokat osztasz helyette, akkor az eredmény is törtszám lesz.

source: Even if it's just a [code]0[/code], adding a decimal place tells the computer we want decimal numbers.
hu: Még, ha csak egy [code]0[/code]-t is írsz a végére, a tizedespont hozzáadása jelszi a számítógépnek, hogy törtszámokkal szeretnénk dolgozni.

source: This shows you how mindful you need to be with types. Otherwise, you will get unexpected results. It can get pretty serious: number errors can lead to bugs like controls not working as intended or charging the wrong price to players.
hu: Ez mutatja, hogy mennyire oda kell figyelned a típusokra. Különben, nem várt eredményeket kaphatsz. Elég komoly következményei is lehetnek: az szám hibák vezethetnek ahhoz, hogy az irányítás nem úgy működik, ahogy kéne, vagy fizetésnél nem a megfelelő összeg kerül levonásra a játékostól.

source: Understanding and mastering types is a key skill for developers
hu: A típusok megértése egy nagyon fontos képessége a fejlesztőknek
zh_hans: 理解和掌握类型是开发人员的一项关键技能

source: Programming beginners often struggle due to the lack of understanding of types.
hu: A kezdő programozók gyakran szenvednek, mert nem igazán értik a típusokat.

source: Languages like GDScript hide the types from you by default. As a result, if you don't understand that some are incompatible, you can get stuck when facing type-related errors.
hu: Az olyan nyelvek, mint a GDScript alapból elrejtik előled a típusokat. Emiatt, ha nem érted, hogy néhány közülük nem kompatibilis, akkor megakadhatsz, ha típushoz kapcsolódó hibákba botlasz.

source: You'll want to keep that in mind in your learning journey. When writing code, you will need to understand everything that's happening.
hu: Ezt jó lesz, ha észben tartod a tanulmányaid során. Amikor kódot írsz, mindent meg kell értened, ami történik.

source: That said, let's practice some type conversions.
hu: Ha már itt vagyunk, gyakoroljuk egy kicsit a típusok közti átváltást.

source: Displaying the player's health and energy
hu: A játékos életének és erejének kiírása
zh_hans: 显示玩家的健康和能量

source: We want to display the player's energy in the user interface.
hu: Ki szeretnénk íratni a játékos energiáját a kijelzőre.

source: Currently, our code has a type error. We're trying to display a whole number while the [code]display_energy()[/code] function expects a string.
hu: Jelenleg, a kódunkban van egy típus hiba. Egy egész számot akarunk kíiratni, azonban a [code]display_energy()[/code] függvény szöveget vár.

source: Using the [code]str()[/code] function, clear the type error and make the energy amount display on the interface.
hu: A [code]str()[/code] függvény használatával, javítsuk ezt a hibát és írassuk ki az energiát a kijelzőre.

source: You can't change the [code]energy[/code] variable definition: setting it to [code]"80"[/code] would break the rest of the game's code. You must convert the value when calling [code]display_energy()[/code].
hu: Nem változtathatod az [code]energy[/code] változót a létrehozáskor: ha ott [code]"80"[/code]-ra állítod, akkor a játék többi része fog elromlani. Az értéket a [code]display_energy()[/code] függvény hívásakor kell konvertálnod.

source: We want to display the player's energy in the interface but face a type error. Use your new knowledge to fix it.
hu: Ki szeretnénk íratni a játékos energiáját a kijelzőre, de egy típus hibába botlunk. Használd a tudásod, hogy kijavítsd.
zh_hans: 我们想在界面中显示玩家的能量，但遇到类型错误。 用你的新知识来修复它。

source: Letting the player type numbers
hu: Hagyjuk, hogy a játékos írja be a számokat
zh_hans: 让玩家输入数字

source: In our game's shops, we want to let the player type numbers to select the number of items they want to buy or sell.
hu: Szeretnénk, ha a játékbeli boltokban a játékos maga írhatná be, hogy hány darabot szeretne venni vagy eladni valamiből.

source: We need to know the number of items as an [code]int[/code], but the computer reads the player's input as a [code]String[/code].
hu: A számra [code]int[/code]-ként van szükségünk, de a számítógép a bevitt értéket [code]String[/code]-ként kezeli.

source: Your task is to convert the player's input into numbers for the shop's code to work.
hu: Az a feladatod, hogy konvertáld át megadott értéket számmá, hogy működjön a bolt kódja.

source: Using the [code]int()[/code] function, convert the player's input into a whole number and store the result in the [code]item_count[/code] variable.
hu: Az [code]int()[/code] függvény segítségével konvertáld az értéket egész számmá, és tárold el az [code]item_count[/code] változóban.

source: We want the player to choose the number of items they buy or sell in our game's shops. But right now, all we get are type errors.
hu: Szeretnénk, ha a játékos adhatná meg, hány darab terméket szeretne venni vagy eladni a boltban. Jelenleg azonban csak típus hibákat kapunk.
zh_hans: 我们希望玩家选择他们在游戏商店中购买或出售的物品数量。 但是现在，我们得到的只是类型错误。

source: Value types
hu: Változó típusok
zh_hans: 值类型

source: In your code, values have a particular [i]type[/i]. You have already learned about several: whole numbers, decimal numbers, strings, 2D vectors, arrays, and dictionaries. The computer uses the type of a value to know which operations and functions you can use with them. As a result, it's essential to understand types: they are not fully compatible with one another, and misusing them will cause errors.
zh_hans: 在您的代码中，值具有特定的 [i]type[/i]。 您已经了解了以下几种：整数、十进制数、字符串、二维向量、数组和字典。 计算机使用值的类型来了解您可以使用哪些操作和功能。 因此，了解类型至关重要：它们彼此不完全兼容，滥用它们会导致错误。

source: However, to display it on the player's screen, the computer wants text: it needs a value of type [code]String[/code]. You can concatenate two strings with the [code]+[/code] operator.
zh_hans: 然而，为了在播放器的屏幕上显示它，计算机需要文本：它需要一个 [code]String[/code] 类型的值。 您可以使用 [code]+[/code] 运算符连接两个字符串。

source: It tells you you can't add values of type [code]String[/code] and [code]int[/code]: they're incompatible. In that case, you need to convert the [code]health[/code] number into a [code]String[/code].
zh_hans: 它告诉您不能添加 [code]String[/code] 和 [code]int[/code] 类型的值：它们不兼容。 在这种情况下，您需要将 [code]health[/code] 数字转换为 [code]String[/code]。

source: You can get the text representation of a value by calling the [code]str()[/code] function (short for "string"). The function returns its argument as a new [code]String[/code]. You can use this function whenever you want to turn some number or vector into text.
zh_hans: 您可以通过调用 [code]str()[/code] 函数（“字符串”的缩写）来获取值的文本表示。 该函数将其参数作为新的 [code]String[/code] 返回。 每当您想将某个数字或向量转换为文本时，都可以使用此功能。

source: You can also convert strings into whole numbers or decimal numbers using respectively the [code]int()[/code] and [code]float()[/code] functions. Those functions can convert what the player writes in a text field into a number. For example, the number of potions to sell at once in a shop.
zh_hans: 您还可以分别使用 [code]int()[/code] 和 [code]float()[/code] 函数将字符串转换为整数或十进制数。 这些函数可以将玩家在文本字段中写入的内容转换为数字。 例如，商店中一次出售的药水数量。

source: Most types are incompatible. For example, you can't directly add or multiply an array with a number. However, some types are [i]partially[/i] compatible. For example, you can multiply or divide a vector by a number.
zh_hans: 大多数类型不兼容。 例如，您不能直接将数组与数字相加或相乘。 但是，某些类型 [i] 部分[/i] 兼容。 例如，您可以将向量乘以或除以数字。

source: It is possible because other developers defined that operation for you under the hood. However, you cannot directly add or subtract a number to a vector. You'll get an error. That's why, in earlier lessons, you had to access the sub-variables of [code]position[/code] to add numbers to them.
zh_hans: 这是可能的，因为其他开发人员在后台为您定义了该操作。 但是，您不能直接在向量中添加或减去数字。 你会得到一个错误。 这就是为什么在前面的课程中，您必须访问 [code]position[/code] 的子变量来为它们添加数字。

source: Well, for the computer, the result of [code]3/2[/code] is [code]1[/code]. Wait, what?! That's because, for the computer, the division of two whole numbers should always result in a whole number. When you divide decimal numbers instead, you will get a decimal number as a result.
zh_hans: 那么，对于计算机来说，[code]3/2[/code] 的结果是 [code]1[/code]。 等等，什么？！ 那是因为，对于计算机来说，两个整数相除应该总是得到一个整数。 相反，当您将十进制数相除时，您将得到一个十进制数。

source: Even if it's just a [code]0[/code], adding a decimal place tells the computer we want decimal numbers. This shows you how mindful you need to be with types. Otherwise, you will get unexpected results. It can get pretty serious: number errors can lead to bugs like controls not working as intended or charging the wrong price to players.
zh_hans: 即使它只是一个 [code]0[/code]，添加一个小数位也会告诉计算机我们想要十进制数。 这向您展示了对类型的关注程度。 否则，你会得到意想不到的结果。 它可能会变得非常严重：数字错误会导致诸如控件无法按预期工作或向玩家收取错误价格等错误。

source: Programming beginners often struggle due to the lack of understanding of types. Languages like GDScript hide the types from you by default. As a result, if you don't understand that some are incompatible, you can get stuck when facing type-related errors. You'll want to keep that in mind in your learning journey. When writing code, you will need to understand everything that's happening. That said, let's practice some type conversions.
zh_hans: 由于缺乏对类型的理解，编程初学者经常遇到困难。 默认情况下，像 GDScript 这样的语言会隐藏类型。 结果，如果您不了解某些不兼容的内容，则在遇到与类型相关的错误时可能会卡住。 您需要在学习过程中牢记这一点。 编写代码时，您需要了解正在发生的一切。 也就是说，让我们练习一些类型转换。

source: We want to display the player's energy in the user interface. Currently, our code has a type error. We're trying to display a whole number while the [code]display_energy()[/code] function expects a string. Using the [code]str()[/code] function, clear the type error and make the energy amount display on the interface. You can't change the [code]energy[/code] variable definition: setting it to [code]"80"[/code] would break the rest of the game's code. You must convert the value when calling [code]display_energy()[/code].
zh_hans: 我们希望在用户界面中显示玩家的能量。 目前，我们的代码存在类型错误。 我们试图显示一个整数，而 [code]display_energy()[/code] 函数需要一个字符串。 使用[code]str()[/code]函数，清除类型错误，并在界面上显示电量。 您无法更改 [code]energy[/code] 变量定义：将其设置为 [code]"80"[/code] 会破坏游戏的其余代码。 调用 [code]display_energy()[/code] 时必须转换值。

source: In our game's shops, we want to let the player type numbers to select the number of items they want to buy or sell. We need to know the number of items as an [code]int[/code], but the computer reads the player's input as a [code]String[/code]. Your task is to convert the player's input into numbers for the shop's code to work. Using the [code]int()[/code] function, convert the player's input into a whole number and store the result in the [code]item_count[/code] variable.
zh_hans: 在我们的游戏商店中，我们想让玩家输入数字来选择他们想要购买或出售的物品数量。 我们需要以 [code]int[/code] 的形式知道项目的数量，但计算机将玩家的输入读取为 [code]String[/code]。 您的任务是将玩家的输入转换为数字，以便商店的代码能够正常工作。 使用 [code]int()[/code] 函数，将玩家的输入转换为整数并将结果存储在 [code]item_count[/code] 变量中。
