Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-8-defining-variables.po
Languages: da, de, fr, hu, it, ja, pl, pt, pt_br, ru, sv, tr, zh_hans

source: To use a variable, you want to assign it a starting value. You can do so using the equal sign (=). This code assigns the value [code]100[/code] to a new variable named [code]health[/code].
da: For at bruge en variabel skal du tildele den en startværdi. Du kan gøre dette ved at bruge lighedstegnet (=). Denne kode tildeler værdien [code]100[/code] til en ny variabel med navnet [code]health[/code].
de: Um eine Variable zu verwenden, musst Du ihr einen Startwert zuweisen. Du kannst dies mit dem Gleichheitszeichen (=) tun. Dieser Code weist einer neuen Variablen mit dem Namen [code]health[/code](Leben) den Wert [code]100[/code] zu.
fr: Pour utiliser une variable, vous devez lui assigner une valeur de départ. Vous pouvez le faire en utilisant le signe égal (=). Ce code assigne la valeur [code]100[/code] à une nouvelle variable nommée [code]health[/code].
hu: A változó használatához meg kell adni neki egy kezdőértéket. Ezt az egyenlőségjellel (=) teheted meg. Ez a kód a [code]100[/code] értéket hozzárendeli a [code]health[/code] nevű változóhoz.
it: Per usare una variabile, prima devi assegnarli un valore iniziale. Puoi fare questo usando il simbolo di uguaglianza (=). Questo codice assegna un valore di [code]100[/code] ad una nuova variabile chiamata [code]health[/code].
ja: 変数を使用するには、最初に値を割り当てる必要があります。 等号（=）を使用して割り当てることができます。 次のコードは、値[code]100[/code]を[code]health[/code]という名前の新しい変数に割り当てます。
pl: Aby używać zmiennej, będziesz chciał przypisać jej wartość początkową. Możesz to zrobić za pomocą znaku równości (=). Ten kod przypisuje wartość [code]100[/code] do nowej zmiennej o nazwie [code]health[/code].
pt: Para usar uma variável, deve lhe atribuir um valor inicial. Pode fazer isso usando o sinal de igual (=). Esse código atribui o valor [code]100[/code] numa nova variável chamada [code]health[/code].
pt_br: Para usar uma variável, você deve atribuir a ela um valor inicial. Você pode fazer isso usando o sinal de igual (=). Esse código atribui o valor [code]100[/code] em uma nova variável chamada [code]health[/code].
ru: Чтобы использовать переменную, необходимо присвоить ей начальное значение. Это можно сделать с помощью знака равенства (=). Этот код присваивает значение [code]100[/code] новой переменной с именем [code]health[/code].
sv: För att använda en variabel, kommer du att behöva tilldela ett startvärde. Du kan göra detta med likhetstecken (=). Denna kod tilldelar värdet [code]100[/code] till en ny variabel som heter [code]health[/code].
tr: Bir değişkeni kullanmak için, ona bir başlangıç değeri atamak istersin. Bunu eşittir işaretini (=) kullanarak yapabilirsin. Bu kod, [code]100[/code] değerini, [code]health[/code] adlı yeni bir değişkene atar.
zh_hans: 要使用变量，你需要为其分配一个起始值。你可以使用等号 (=) 执行此操作。 此代码将值 [code]100[/code] 分配给名为 [code]health[/code] 的新创建的变量。

source: After defining your variable, you can access its value by writing the variable's name.
da: Når du har defineret din variable, kan du få adgang til værdien ved at skrive variablens navn.
de: Nachdem Du die Variable definiert hast, kannst Du auf ihren Wert zugreifen, indem Du den Namen der Variablen eingibst.
fr: Après avoir défini votre variable, vous pouvez accéder à sa valeur en écrivant le nom de la variable.
hu: A változó létrehozása után, egyszerűen csak a nevével hivatkozhatunk rá.
it: Dopo aver definito la tua variabile, puoi accedere al suo valore scrivendo il nome della variabile.
ja: 変数を定義した後、その値にアクセスするには、変数名を記述します。
pl: Po zdefiniowaniu w ten sposób zmiennej możesz uzyskać dostęp do jej wartości wpisując nazwę zmiennej.
pt: Depois de definir a sua variável, pode acessar o valor dela por escrever o nome dela.
pt_br: Depois de definir sua variável, você pode acessar seu valor escrevendo o nome dela.
ru: После определения переменной вы можете получить доступ к её значению, для этого просто напишите имя переменной.
sv: Efter att du definierat din variabel kan du hämta värdet genom att skriva variabelns namn.
tr: Değişkenini tanımladıktan sonra, değişkenin ismini yazarak değerine erişebilirsin.
zh_hans: 定义变量后，你可以通过写入变量的名称来访问它的值。

source: The code above will display the number [code]100[/code] to some output window. Notice we don't use the [code]var[/code] keyword anymore as we only need it to [i]define[/i] a variable. Also, once you define a variable, you can change its value anytime with the equal sign.
da: Ovenstående kode vil vise tallet [code]100[/code] i et outputvindue. Bemærk, at vi ikke længere bruger nøgleordet [code]var[/code], da vi kun skal bruge det til at [i]definere[/i] en variabel. Når du først har defineret en variabel, kan du også ændre dens værdi når som helst med lighedstegnet.
de: Der obige Code zeigt die Nummer [code]100[/code] in einem Ausgabefenster an. Beachte, dass wir das Schlüsselwort [code]var[/code] nicht mehr verwenden, da wir es nur benötigen, um eine Variable zu [i]definieren[/i]. Nachdem Du eine Variable definiert hast, kannst Du ihren Wert jederzeit mit dem Gleichheitszeichen ändern.
fr: Le code ci-dessus affichera le nombre [code]100[/code] dans une fenêtre de sortie. Remarquez que nous n'utilisons plus le mot-clé [code]var[/code] car nous n'en avons besoin que pour [i]définir[/i] une variable. De plus, une fois que vous avez défini une variable, vous pouvez changer sa valeur à tout moment avec le signe égal.
hu: A fenti kód kiíratja [code]100[/code] értéket az output dobozba. Figyeld meg, hogy már nem használjuk a [code]var[/code] kulcsszót, mert az csak a változó [i]létrehozásához[/i] szükséges. Miután létrehoztál egy változót, bármikor megváltoztathatod az értékét.
it: Il codice qua sopra mostrerà il numero [code]100[/code] a qualche schermata di output. Nota che non usiamo più la parola chiave [code]var[/code] dato che serve solo per [i]definire[/i] una variabile. Inoltre, appena definisci una variabile, puoi cambiare il suo valore quando vuoi con il segno uguale.
ja: 上記のコードは、出力ウィンドウに数字[code]100[/code]を表示します。 変数を[i]定義[/i]するときにのみ必要なので、[code]var[/code]キーワードがもう使用されていないことに注意してください。 また、変数を定義すると、等号を使っていつでもその値を変更できます。
pt: O código acima exibirá o número [code]100[/code] em alguma janela de saída. Observe que não usamos mais a palavra-chave [code]var[/code] pois só precisamos dela para [i]definir[/i] uma variável. Além disso, depois de definir uma variável, pode alterar o valor dela a qualquer momento com o sinal de igual.
pt_br: O código acima exibirá o número [code]100[/code] em alguma janela de saída. Observe que não usamos mais a palavra-chave [code]var[/code] pois só precisamos dela para [i]definir[/i] uma variável. Além disso, depois de definir uma variável, você pode alterar seu valor a qualquer momento com o sinal de igual.
ru: Приведенный выше код выведет число [code]100[/code] в окно вывода. Обратите внимание, что мы больше не используем ключевое слово [code]var[/code], поскольку оно нужно только для того, чтобы [i]определить[/i] переменную. Кроме того, определив переменную, вы можете в любой момент изменить её значение с помощью знака равенства.
tr: Yukarıdaki kod, [code]100[/code] sayısını bir çıktı penceresinde gösterecektir. [code]var[/code] anahtar sözcüğünü, daha sonra kullanmadığımıza dikkat et, çünkü buna yalnızca bir değişkeni [i]tanımlamak[/i] için ihtiyacımız var. Ayrıca, bir değişkeni tanımladıktan sonra, eşittir işareti ile değerini istediğin zaman değiştirebilirsin.
zh_hans: 上面的代码将在某个输出窗口显示数字 [code]100[/code]。 请注意，我们不需要重复写 [code]var[/code] 关键字，因为我们只需要它来 [i]定义[/i] 一个变量。 此外，一旦你定义了一个变量，你可以随时用等号改变它的值。

source: About the print function
da: Om udskriftsfunktionen
de: Über die Druckfunktion
fr: À propos de la fonction « print »
hu: A print függvény
it: Riguardo la funzione print
ja: print関数について
pl: O funkcji print
pt: Sobre a função chamada print
pt_br: Sobre a função chamada print
ru: О функции print
sv: Angående print funktionen
tr: Yazdırma (print) fonksiyonu hakkında
zh_hans: 关于print函数

source: The [code]print()[/code] function is generally the first function you learn in academic programming courses. It sends ("prints") the message or value you give it to some output window, often a black window with plain white text.
da: Funktionen [code]print()[/code] er generelt den første funktion, du lærer i akademiske programmeringskurser. Den sender ("printer") den besked eller værdi, du giver den, til et outputvindue, ofte et sort vindue med almindelig hvid tekst.
de: Die Funktion [code]print()[/code] ist in der Regel die erste Funktion, die Sie in akademischen Programmierkursen erlernen. Sie sendet ("druckt") die Nachricht oder den Wert, den Du ihr gibst, an ein Ausgabefenster, oft ein schwarzes Fenster mit einfachem weißem Text.
fr: La fonction [code]print()[/code] (« imprimer » en anglais) est généralement la première fonction que vous apprenez dans les cours de programmation académiques. Elle envoie (« imprime ») le message ou la valeur que vous lui donnez à une fenêtre de sortie, souvent une fenêtre noire avec du texte brut blanc.
hu: A [code]print()[/code] függvény általában az első függvény, amelyet megtanulsz a programozó képzéseken. Ez elküldi ("nyomtatja") a megadott változó értékét valamilyen kimenetre, ami gyakran egy fekete abalak, fehér betűkkel.
it: La funzione [code]print()[/code] è in genere la prima funzione che impari nei corsi di programmazione accademici. Manda ("stampa") il messaggio o il valore gli dai in qualche schermata di output, spesso una finestra nera con nel semplice testo in bianco.
ja: [code]print()[/code] 関数は、通常、学術的なプログラミング コースで最初に学習する関数です。 指定したメッセージまたは値を出力ウィンドウ (多くの場合、白いテキストが表示された黒いウィンドウ) に送信 (「印刷」) します。
pl: Funkcja drukowania czy też wyświetlania [code]print()[/code] jest zazwyczaj pierwszą funkcją, której uczysz się na akademickich kursach programowania. Wysyła ona wiadomość lub wartość, którą jej nadajesz, do „druku” w oknie wyjściowym, będącym najczęściej czarnym oknem z prostym, białym tekstem.
pt: A função [code]print()[/code] é geralmente a primeira função que aprende em cursos acadêmicos de programação. Ela ("imprime no ecrã") mensagens ou valores que fornece para alguma janela de saída, essa janela geralmente é um ecrã preto com texto simples branco.
pt_br: A função [code]print()[/code] é geralmente a primeira função que você aprende em cursos acadêmicos de programação. Ela ("imprime na tela") mensagens ou valores que você fornece para alguma janela de saída, essa janela geralmente é uma tela preta com texto branco simples.
ru: Функция [code]print()[/code] обычно является первой функцией, которую вы изучаете на академических курсах программирования. Она отправляет ("печатает") сообщение или значение, которое вы ей передаете, в некоторое окно вывода, часто представленное в виде чёрного окна с белым текстом.
sv: [code]print()[/code] funktionen är generellt den första funktion som du lär dig i akademiska programmeringskurser. Den skriver det meddelande eller värde som du anger till något utmatningsfönster, oftast ett svart fönster med vanlig vit text.
tr: [code]print()[/code] fonksiyonu genellikle, akademik programlama derslerinde öğrenilen ilk fonksiyondur. Verdiğin mesajı veya değeri, genellikle düz beyaz metin içeren siyah bir pencereye (ekrana), bir çıktı olarak gönderir ("yazdırır").
zh_hans: [code]print()[/code] （打印）函数通常是你在学校编程课程中学习的第一个函数。 它将你给它的消息或值发送（“打印”）到某个输出窗口，通常是带有白色文本的黑色窗口。

source: Programmers often use [code]print()[/code] to quickly check the value of their variables when their game runs. In the app, we made a special output window that captures calls to [code]print()[/code] and displays a card to make it friendlier for you.
da: Programmører bruger ofte [code]print()[/code] til hurtigt at tjekke værdien af deres variabler, når deres spil kører. I appen har vi lavet et særligt outputvindue, der registrerer kald til [code]print()[/code] og viser et kort for at gøre det mere brugervenligt for dig.
de: Programmierer verwenden häufig [code]print()[/code], um den Wert ihrer Variablen schnell zu überprüfen, wenn ihr Spiel ausgeführt wird. In der App haben wir ein spezielles Ausgabefenster erstellt, das Aufrufe von [code]print()[/code] erfasst und eine Karte anzeigt, um sie für dich freundlicher zu gestalten.
fr: Les programmeurs utilisent souvent [code]print()[/code] pour vérifier rapidement la valeur de leurs variables lorsque leur jeu s'exécute. Dans l'application, nous avons créé une fenêtre de sortie spéciale qui capture les appels à [code]print()[/code] et affiche une carte pour la rendre plus convivial pour vous.
hu: A programozók gyakran használják a [code]print()[/code] függvényt, hogy gyorsan lekérjék egy változó értékét miközben fut a játék. Az alkalmazásban készítettünk egy különleges kimeneti mezőt, ami elkapja a [code]print()[/code] függvény hívását és egy kártyán mutatja meg azt, hogy barátságosabb legyen számodra.
it: I programmatori spesso usano [code]print()[/code] per controllare rapidamente il valore delle loro variabili quando il loro gioco è in esecuzione. In questa applicazione, abbiamo creato una speciale finestra di output che cattura le chiamate di [code]print()[/code] e mostra una carta che la rende più facile per te.
ja: プログラマーはよく、ゲームの実行中に変数の値をすばやく確認するために[code]print()[/code]関数を使います。 このアプリでは、[code]print()[/code] 関数が呼び出された内容をキャプチャする特別な出力ウィンドウを用意しており、カードとして表示することでわかりやすくしました。
pl: Programiści często używają [code]print()[/code] do szybkiego sprawdzenia wartość swoich zmiennych podczas uruchamiania gry. W aplikacji stworzyliśmy specjalne okienko wyjściowe, które przechwytuje wywołania funkcji [code]print()[/code] i wyświetla odpowiednią kartę w przyjazny dla ciebie sposób.
pt: Os programadores costumam usar a função [code]print()[/code] para verificar rapidamente o valor das variáveis delas quando o jogo é executado. Na app criamos uma janela de saída especial que captura chamadas da função [code]print()[/code] e exibe um cartão no ecrã, para tornar as coisas mais amigável para si.
pt_br: Os programadores costumam usar a função [code]print()[/code] para verificar rapidamente o valor de suas variáveis quando o jogo é executado. No aplicativo, nós criamos uma janela de saída especial que captura chamadas da função [code]print()[/code] e exibe um cartão na tela, para tornar as coisas mais amigável para você.
ru: Программисты часто используют [code]print()[/code] для быстрой проверки значения переменных при запуске игры. В приложении мы сделали специальное окно вывода, которое перехватывает вызовы [code]print()[/code] и отображает результат выполнения на карточке, чтобы сделать его более дружелюбным для вас.
sv: Programmerare använder ofta [code]print()[/code] för att snabbt kontrollera värdet på en variabel medans deras spel körs. I appen har vi skapat ett speciellt utmatningsfönster som fångar anrop till [code]print()[/code] och visar ett kort för att göra det vänligare för dig.
tr: Programcılar, oyunları çalışırken, değişkenlerinin değerini hızlıca kontrol etmek için genellikle [code]print()[/code] kullanırlar. Uygulama içinde senin için, [code]print()[/code] fonksiyonuna yapılan çağrıları yakalayıp, daha arkadaş canlısı bir hale getirmek için, bir çıktı penceresi yaptık.
zh_hans: 程序员经常在游戏运行时使用 [code]print()[/code] 来快速检查变量的值。 在这个教程软件中，我们制作了一个特殊的输出窗口，它会捕获对 [code]print()[/code] 的调用并显示这些小卡片，这样对你来说用起来更友好。

source: Here, the verb [i]print[/i] means "to send information to display on the screen." The function "prints" things on your computer display; It does not relate to printers.
da: Her betyder verbet [i]print[/i] "at sende information til visning på skærmen". Funktionen "udskriver" ting på din computerskærm; den har ikke noget med printere at gøre.
de: Hier bedeutet das Verb [i]print[/i] "Informationen senden, um sie auf dem Bildschirm anzuzeigen". Die Funktion "druckt" Dinge auf Ihrem Computerdisplay; Es bezieht sich nicht auf Drucker.
fr: Ici, le verbe [i]print[/i] signifie « envoyer des informations à afficher sur l'écran ». La fonction « imprime » des choses sur l'écran de votre ordinateur ; elle ne concerne pas les imprimantes.
hu: Itt a [i]print[/i] azt jelenti, hogy "információ küldése a képernyőn való megjelenítéshez". A függvény információt "nyomtat" a képernyőre; nincs köze a nyomtatókhoz.
it: Qui, il verbo [i]print[/i] significa "inviare informazioni da mostrare sullo schermo". La funzione "stampa" cose sul tuo schermo del computer; Non ha a che fare con le stampanti.
ja: ここで、動詞の[i]print[/i]は「画面に表示するための情報を送る」ことを意味します。 「print」関数は、プリンターではなく、コンピューターのディスプレイに物事を「表示」します。
pl: Tutaj słówko [i]print[/i] oznacza „wysyłanie informacji do wyświetlenia na ekranie”. Funkcja "drukuje" rzeczy na ekranie twojego komputera; nie dotyczy ona drukarek.
pt: Aqui, o verbo [i]print[/i] (imprimir em inglês) significa "enviar informações para serem exibidas no ecrã". A função "imprime" coisas no ecrã do seu computador; Não tem nada a ver com impressoras.
pt_br: Aqui, o verbo [i]print[/i] (imprimir em inglês) significa "enviar informações para serem exibidas na tela". A função "imprime" coisas na tela do seu computador; Não tem nada a ver com impressoras.
ru: Здесь глагол [i]print[/i] означает "отправить информацию для отображения на экране". Функция "печатает" вещи на дисплее компьютера; она не относится к принтерам.
sv: Här, verbet [i]print[/i] betyder "för att skicka information som ska visas på skärmen." Funktionen "printar" ut saker på din dators skärm; Det har inget att göra med skrivare.
tr: Burada, [i]print[/i] (yazdır) fiili "ekranda görüntülenmek üzere bilgi göndermek" anlamına gelmektedir. Bu fonksiyon, bilgisayarının ekranına bir şeyler "yazdırır"; yazıcılarla ilgisi yoktur.
zh_hans: 在这里，动词 [i]print[/i]（打印） 的意思是“发送信息以显示在屏幕上”。 该函数在你的计算机显示器上“打印”东西；它与打印机无关。

source: Variables are like labels
da: Varer er som etiketter
de: Variablen sind wie Beschriftungen
fr: Les variables sont comme des étiquettes
hu: A változók olyanok, mint a címkék
it: Le variabili sono come delle etichette
ja: 変数はラベルのようなもの
pl: Zmienne są jak etykiety
pt: Variáveis são como rótulos
pt_br: Variáveis são como rótulos
ru: Переменные похожи на метки
sv: Variabler är som etiketter
tr: Değişkenler etiketler gibidir
zh_hans: 变量就像标签

source: As we hinted above, in GDScript, variables work a bit like labels. Assigning a value to a variable is like taking your label (the variable) and sticking it onto some item (the value).
da: Som vi antydede ovenfor, fungerer variabler i GDScript lidt ligesom etiketter. At tildele en værdi til en variabel er som at tage din etiket (variablen) og sætte den på et element (værdien).
de: Wie bereits erwähnt, funktionieren Variablen in GDScript ein wenig wie Beschriftungen. Das Zuweisen eines Werts zu einer Variablen ist so, als würde man seine Beschriftung (die Variable) nehmen und es auf ein Element (den Wert) kleben.
fr: Comme nous l'avons indiqué ci-dessus, dans GDScript, les variables fonctionnent un peu comme des étiquettes. Assigner une valeur à une variable revient à prendre votre étiquette (la variable) et à la coller sur un élément (la valeur).
hu: Ahogy fentebb már utaltunk rá, a GDScriptben a változók úgy működnek, mint a címkék. Érték adása a változónak olyan, mintha fognád a címkéd (változó) és rátennéd, valamilyen termékre (érték).
it: Come abbiamo accennato sopra, in GDScript, le variabili operano un po' come delle etichette. Assegnare un valore ad una variabile è come prendere la tua etichetta (la variabile) e appiccicarla su qualche prodotto (il valore).
ja: 先ほども少し触れましたが、GDScript での変数は、ラベルのような働きをします。 変数に値を代入することは、ラベル (変数) を取ってきて、何かのアイテム (値) に貼り付けるようなものです。
pl: Jak już wspominaliśmy powyżej, w języku GDScript zmienne działają trochę jak etykiety. Przypisanie wartości do zmiennej jest jak wzięcie danej etykiety (naszej zmiennej) i przyklejenie jej do jakiegoś elementu (wartości).
pt: Como sugerimos acima, no GDScript, as variáveis funcionam um pouco como rótulos. Atribuir um valor a uma variável é como levar o rótulo dela (da variável) e colá-lo em algum item (o valor).
pt_br: Como sugerimos acima, no GDScript, as variáveis funcionam um pouco como rótulos. Atribuir um valor a uma variável é como pegar o rótulo dela (da variável) e colá-lo em algum item (o valor).
ru: Как мы обозначили выше, по принципу работы переменные в GDScript немного похожи на метки. Присвоить значение переменной — это все равно что взять ярлык (переменную) и наклеить его на какой-либо предмет (значение).
sv: Som vi antydde ovan, i GDScript, variabler fungerar lite som etiketter. Tilldela ett värde till en variabel är lite som att ta din etikett(variabeln) och fästa den på en sak (värdet).
tr: Yukarıda işaret ettiğimiz gibi, GDScript'te, değişkenler biraz etiketlere benzer çalışır. Bir değişkene değer atamak, etiketini (değişken) alıp bir öğenin (değer) üzerine yapıştırmak gibidir.
zh_hans: 正如我们之前提到过的，在 GDScript 中，变量的工作方式有点像标签。 给变量赋值就像把你的标签（变量）贴到某个东西（值）上。
