Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-7-member-variables.po
Languages: hu, it, ja, pl, pt, tr, zh_hans

source: Draw three squares of size 100 by 100 that are 100 pixels apart on the horizontal axis. In other words, there should be a 100-pixel gap between two squares. You should draw the squares starting at the position (100, 100). This means you should position the first square at 100 on the X axis and 100 on the Y axis. Remember you need to use the equal sign ([code]=[/code]) to change the value of a variable, like the turtle's position. Write your code inside the [code]run()[/code] function so the computer can recognize it.
hu: Rajzolj 3 darab 100 pixel oldalhosszúságú négyzetet egymástól 100 pixel távolságra a vízszintes tengelyen. Más szóval, 100 pixel legyen 2 négyzet közt.. A (100, 100) pozíciótol kezdve rajzold a négyzeteket. Ez azt jelenti, hogy az első négyzet az X és Y tengelyen is 100-nál kezdődjön. Emlékezz, hogy az egyenlőségjelet ([code]=[/code]) kell használnod, hogy megváltoztasd egy változó értékét, például a teknős pozícióját. Írd a kódod a [code]run()[/code] függvénybe, hogy a számítógép értelmezni tudja.
pt: Desenhe três quadrados de tamanho 100 por 100, separados por 100 pixels no eixo horizontal. Em outras palavras, deve haver uma lacuna de 100 pixels entre os dois quadrados. Deve desenhar os quadrados começando na posição (100, 100). Isso significa que deve posicionar o primeiro quadrado em 100 no eixo X e 100 no eixo Y. Lembre-se que precisa usar o sinal de igual ([code]=[/code]) para alterar o valor de uma variável, como a posição da tartaruga. Escreva o seu código dentro da função [code]run()[/code] para que o computador possa reconhecer o código.
