Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-13-conditions.po
Languages: de, fr, hu, pl, tr, zh_hans

source: What does "pass" do in the code?
fr: Que fait « pass » dans le code ?
tr: Kodun içindeki "pass" ne işe yarar?
zh_hans: 在这段代码中，"pass "有什么作用？

source: The [code]pass[/code] keyword prevents errors in our code when a line cannot be empty. For example, we must have a line of code after a function definition or an [code]if[/code] block. When you don't know what to write yet, you can use the [code]pass[/code] keyword as a placeholder, and Godot won't give any errors. In the previous example, if there was nothing below the [code]if[/code] lines, Godot would give us an "Expected an indented block after 'if' " error.
fr: Le mot-clé [code]pass[/code] permet d'éviter les erreurs dans notre code lorsqu'une ligne ne peut pas être vide. Par exemple, nous devons avoir une ligne de code après une définition de fonction ou un bloc [code]if[/code]. Lorsque vous ne savez pas encore quoi écrire, vous pouvez utiliser le mot-clé [code]pass[/code] comme placeholder (« bouche-trou »), et Godot ne fera pas d'erreur. Dans l'exemple précédent, s'il n'y avait rien en dessous des lignes [code]if[/code], Godot nous donnerait une erreur "Expected an indented block after 'if'", à savoir « Un bloc en retrait après 'if' était attendu ».
tr: [code]pass[/code] anahtar kelimesi, bir satırın boş olmaması gerektiğinde, kodumuzda hata oluşmasını önler. Örneğin, bir fonksiyon tanımından veya [code]if[/code] kalıbından sonra bir kod satırına sahip olmalıyız. Henüz ne yazacağını bilmiyorsan, [code]pass[/code] anahtar sözcüğünü yer tutucu olarak kullanabilirsin, böylece Godot herhangi bir hata vermeyecektir. Önceki örnekte, [code]if[/code] satırlarının altında hiçbir şey olmasaydı, Godot bize, "Expected an indented block after 'if' " yani "'if' den sonra girintili bir gövde bekleniyor" hatası verecekti.
zh_hans: 当一行代码不能为空时，[code]pass[/code] （过！）关键字可以防止代码出错。 例如，我们必须在定义函数的代码块、 [code]if[/code] 代码块之后写一行代码。当你暂时不知道要写什么时，可以使用 [code]pass[/code] 关键字作为占位符，这样 Godot 就不会报错了。 在上一个示例中，如果 [code]if[/code] 行下面没有任何内容，Godot 就会抛出 "Expected an indented block after 'if' " （if后没有符合条件时可执行的代码块）的错误。

source: The comparison [code]3 > 1[/code] means "three is greater than one" which is [b]true[/b]. The comparison [code]2 < 3[/code] means "two is less than three" which is [b]true[/b]. The comparison [code]1 != 3[/code] means "one is not equal to three" which is [b]true[/b]. The comparison [code]2 == 1[/code] means "two is equal to one" which is [b]false[/b]. The comparison [code]3 < 1[/code] means "three is less than one" which is [b]false[/b].
de: Der Vergleich [code]3 > 1[/code] bedeutet "drei ist größer als eins", was wahr([b]true[/b]) ist. Der Vergleich [code]2 < 3[/code] bedeutet "zwei ist kleiner als drei", was wahr([b]true[/b]) ist. Der Vergleich [code]1 != 3[/code] bedeutet "eins ist ungleich drei", was wahr([b]true[/b]) ist. Der Vergleich [code]2 == 1[/code] bedeutet "zwei ist gleich eins", was falsch([b]false[/b]) ist. Der Vergleich [code]3 < 1[/code] bedeutet "drei ist kleiner als eins", was falsch([b]false[/b]) ist.
fr: La comparaison [code]3 > 1[/code] signifie « trois est supérieur à un », ce qui est [b]vrai[/b]. La comparaison [code]2 < 3[/code] signifie « deux est inférieur à trois », ce qui est [b]vrai[/b]. La comparaison [code]1 != 3[/code] signifie « un n'est pas égal à trois », ce qui est [b]vrai[/b]. La comparaison [code]2 == 1[/code] signifie « deux est égal à un », ce qui est [b]faux[/b]. La comparaison [code]3 < 1[/code] signifie « trois est inférieur à un », ce qui est [b]faux[/b].
hu: A [code]3 > 1[/code] azt jelenti: "három nagyobb, mint egy", ami [b]igaz[/b]. A [code]2 < 3[/code] azt jelenti: "kettő kisebb, mint három", ami [b]igaz[/b]. A [code]1 != 3[/code] azt jelenti: "egy nem egyenlő hárommal", ami [b]igaz[/b]. A [code]2 == 1[/code] azt jelenti: "kettő egyenlő eggyel", ami [b]hamis[/b]. A [code]3 < 1[/code] azt jelenti: "három kisebb, mint egy", ami [b]hamis[/b].
tr: [code]3 > 1[/code] karşılaştırması, "üç birden büyüktür" anlamına gelir ki bu [b]doğrudur[/b]. [code]2 < 3[/code] karşılaştırması, "iki üçten küçüktür" anlamına gelir ki bu [b]doğrudur[/b]. [code]1 != 3[/code] karşılaştırması, "bir üçe eşit değildir" anlamına gelir ki bu [b]doğrudur[/b]. [code]2 == 1[/code] karşılaştırması, "iki bire eşittir" anlamına gelir ki bu [b]yanlıştır[/b]. [code]3 < 1[/code] karşılaştırması, "üç birden küçüktür" anlamına gelir ki bu [b]yanlıştır[/b].
zh_hans: [code]3 > 1[/code] 表示“三大于一”，为 [b]true[/b]。 [code]2 < 3[/code] 表示“二小于三”，为 [b]true[/b]。 [code]1 != 3[/code] 表示“一不等于三”，为 [b]true[/b]。 [code]2 == 1[/code] 表示“二等于一”，为 [b]false[/b]。 [code]3 < 1[/code] 表示“三小于一”，为 [b]false[/b]。

source: The [code]if[/code] keyword comes with a complementary [code]else[/code] keyword. You can write an [code]else[/code] block after an [code]if[/code] block, like so.
de: Zu dem Schlüsselwort [code]if[/code] gibt es das ergänzende Schlüsselwort [code]else[/code](oder). Du kannst einen [code]else[/code]-Block nach einem [code]if[/code]-Block wie folgt schreiben.
fr: Le mot-clé [code]if[/code] est accompagné d'un mot-clé complémentaire : [code]else[/code], ce qui signifie « si non » . Vous pouvez écrire un bloc [code]else[/code] après un bloc [code]if[/code], comme ceci.
hu: Az [code]if[/code] szócskának van egy kiegészítő párja is, az [code]else[/code]. Az alábbiak szerint írhatsz egy [code]else[/code] blokkot az [code]if[/code] blokk után.
tr: [code]if[/code] anahtar kelimesi, tamamlayıcı bir [code]else[/code] anahtar kelimesi ile birlikte gelir. Bir [code]if[/code] kalıbından sonra, aşağıdaki gibi bir [code]else[/code] kalıbı yazabilirsin.
zh_hans: [code]if[/code] （如果）关键字带有一个搭配的 [code]else[/code]（否则） 关键字。 你可以在 [code]if[/code] 块之后接 [code]else[/code] 代码块，像下面这样。

source: This series of [code]if[/code] statements is all wrong. Change the comparisons so each comparison matches the instruction below it. Keep the values and statements as they are; only change the comparison signs. As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code] The line [code]health < 5:[/code] means "health is less than 5". Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
fr: Cette série d'affirmations [code]if[/code] est entièrement fausse. Changez les comparaisons pour que chaque comparaison corresponde à l'instruction qui la suit. Conservez les valeurs et les affirmations telles qu'elles sont ; changez seulement les signes de comparaison. Pour rappel, les signes de comparaison sont : [code] > supérieur à < inférieur à == égal à != pas égal à [code] La ligne [code]health < 5 :[/code] signifie « la santé est inférieure à 5 ». Comme [code]health = 100[/code], cette ligne est fausse et [code]print("health is greater than five.")[/code] ne s'exécutera pas.
tr: Bu [code]if[/code] ifadeleri dizisinin tamamı yanlıştır. Karşılaştırmaları değiştir, ki böylece her karşılaştırma bir altındaki komutla eşleşsin. Değerleri ve ifadeleri olduğu gibi koru; sadece karşılaştırma işaretlerini değiştir. Bir hatırlatma olarak, karşılaştırma işaretleri şunlardı: [code] > büyüktür < küçüktür == eşittir != eşit değil [/code] [code]health < 5:[/code] satırı, "sağlık 5'ten az" anlamına gelir. Mesela, [code]health = 100[/code] olduğu için, bu karşılaştırma yanlıştır ve [code]print("health is greater than five.")[/code] çalışmayacaktır. ifadeler: "health is greater than five." - "sağlık, 5'ten büyüktür". "One is less than health." - "bir, sağlıktan küçüktür". "health is equal to health" - "sağlık, sağlığa eşittir". "health is not equal to seven." - "sağlık, yediye eşit değildir".
zh_hans: 这一系列的 [code]if[/code] 语句都是错误的。更改它们的比较语句，使每个比较语句与下面的文本指示的意思匹配。 不要改动具体的数值和句子的意思；只更改比较符号。 提醒一下，比较符号和对应的英文是： [code] > 大于 (greater than) < 小于 (less than) == 等于 (equal to) != 不等于 (not equal to) [/code] [code]health < 5:[/code] 行的意思是“生命值小于 5（health is less than 5）”。 因为 [code]health = 100[/code]的比较结果是假（false），所以对应的 [code]print("health is greater than 5.")[/code] 不会被运行。

source: We have a heal function that adds an amount to the character's health. Add to the function so the character's health is never greater than [code]80[/code].
de: Wir haben eine Heilungsfunktion, die das Leben des Charakters einen bestimmten Betrag erhöht. Ändere die Funktion, so dass das Leben des Charakters niemals größer als [code]80[/code] ist.
fr: Nous avons une fonction de guérison qui ajoute un montant à la santé du personnage. Ajoutez du code à la fonction pour que la santé du personnage ne soit jamais supérieure à [code]80[/code].
hu: Van egy heal függvényünk, ami hozzáad egy értéket a karakter életéhez. Módosítsd úgy a függvényt, hogy a karakter élete soha ne legyen több, mint [code]80[/code].
tr: Karakterin sağlığına bir miktar ekleme yapan (amount) bir iyileştirme fonksiyonumuz var. Karakterin sağlığının hiçbir zaman [code]80[/code] değerinden büyük olmaması için fonksiyona ekleme yap.
zh_hans: 我们有一个治疗函数（heal），可以增加角色的生命值。 补全函数，使角色的生命值永远不会超过 [code]80[/code]。

source: When the robot takes damage, its health can be negative. We might want to display the health number on screen, like in Japanese RPGs. We don't want negative numbers. We want to stop at zero instead. Calling the function should reduce [code]health[/code] by [code]amount[/code]. If [code]health[/code] goes below [code]0[/code], set it to [code]0[/code] again.
de: Wenn der Roboter Schaden nimmt, kann seine Gesundheit negativ sein. Wir möchten vielleicht die Gesundheitszahl auf dem Bildschirm anzeigen, wie in japanischen RPGs. Wir wollen keine negativen Zahlen. Wir wollen stattdessen bei null aufhören. Der Aufruf der Funktion soll die Gesundheit von [code]health[/code] um den Betrag von [code]amount[/code] verringern. Wenn [code]health[/code] unter [code]0[/code] fällt, setzen Sie es wieder auf [code]0[/code].
fr: Lorsque le robot subit des dégâts, sa santé peut être négative. Nous pourrions vouloir afficher le nombre de la quantité de santé à l'écran, comme dans les RPG japonais. Nous ne voulons pas de nombres négatifs. Nous voulons plutôt nous arrêter à zéro. L'appel de la fonction devrait réduire la [code]health[/code] de [code]amount[/code]. Si la [code]health[/code] descend en dessous de [code]0[/code], remettez-la à [code]0[/code].
hu: Amikor a robot sebződik, az élete lehet negatív szám is. Tegyük fel, hogy meg akarjuk jeleníteni az életét a képernyőn, mint a japán RPG-k. Nem szeretnénk negatív számokat látni. Helyette meg akarunk állni nuláánál. A függvény hívásának csökkenteni kell a [code]health[/code] értékét [code]amount[/code]-tal. Ha a [code]health[/code] értéke kisebb, mint [code]0[/code], állítsd vissza [code]0[/code]-ra.
tr: Robot hasar aldığında, sağlığı negatif olabilir. Japon RPG'lerinde (rol yapma oyunları) olduğu gibi, sağlık değerini ekranda görüntülemek isteyebiliriz. Negatif sayılar istemiyoruz. Bunun yerine sıfırda durmak istiyoruz. Fonksiyonun çağrılması, sağlığı, [code]health[/code], verilen miktarda, [code]amount[/code], azaltmalıdır. Eğer [code]health[/code], [code]0[/code]'ın altına düşerse, tekrar [code]0[/code] olarak ayarla.
zh_hans: 当机器人受到伤害时，它的血量/生命值可能变成负的。 我们也许想在屏幕上显示出血量的数值，类似日式RPG（JRPG） 那样。 我们不希望出现负数。相反，我们希望扣血时会停在零。 每调用该函数一次都会在 [code]health[/code] 中减去 [code]amount[/code]大小 。 如果 [code]health[/code] 低于 [code]0[/code]，请重新将其设置为 [code]0[/code]。

source: When the computer checks a condition, this is called [b]to evaluate[/b] a condition. All conditions [b]evaluate[/b] to either [code]true[/code] or [code]false[/code]. Either the player is pressing the button, or not. Either the character is touching an enemy, or not. In our case, [i]if[/i] the health goes over a maximum value, we want to reset it to the maximum. To define a condition, we use the [code]if[/code] keyword. We write a line starting with [code]if[/code], type the condition to evaluate, and end the line with a colon.
de: Wenn der Computer eine Bedingung überprüft, wird dies als eine Bedingung [b]auswerten[/b] bezeichnet. Alle Bedingungen werden als Wahr([code]true[/code]) oder Falsch([code]false[/code]) [b]ausgewertet[/b]. Entweder der Spieler drückt die Taste oder nicht. Entweder berührt der Charakter einen Feind oder nicht. In unserem Fall, [i]wenn[/i] das Leben einen Maximalwert überschreitet, wollen wir es auf das Maximum zurücksetzen. Um eine Bedingung zu definieren, verwenden wir das Schlüsselwort [code]if[/code]. Wir schreiben eine Zeile, die mit [code]if[/code] beginnt, geben die auszuwertende Bedingung ein und beenden die Zeile mit einem Doppelpunkt.

source: Notice the [code]>[/code] comparison sign. We read this symbol as "greater than". We've seen how function definitions use a colon at the end of the first line and nest content inside. In GDScript, this syntax is a recurring pattern for all code blocks. The computer knows which instructions belong to the condition because they are indented.
de: Schaue dir das [code]>[/code]-Vergleichszeichen an. Wir lesen dieses Symbol als "größer als". Wir haben gesehen, wie Funktionsdefinitionen einen Doppelpunkt am Ende der ersten Zeile verwenden und Inhalte darin verschachteln. In GDScript ist diese Syntax ein wiederkehrendes Muster für alle Codeblöcke. Der Computer weiß, welche Anweisungen zu der Bedingung gehören, da sie eingerückt sind.

source: This series of [code]if[/code] statements is all wrong. Change the comparisons so each comparison matches the instruction below it. Keep the values and statements as they are; only change the comparison signs. As a reminder, the comparison signs are: [code] > greater than < less than == equal to != not equal to [/code] The line [code]health < 5:[/code] means "health is less than 5". Because [code]health = 100[/code], this is false so [code]print("health is greater than five.")[/code] won't run.
de: Diese Folge von [code]if[/code]-Anweisungen ist komplett falsch. Ändere die Vergleiche so, dass jeder Vergleich mit der Ausgabe darunter übereinstimmt. Behalte die Werte und Aussagen so bei, wie sie sind, ändere nur die Vergleichszeichen. Zur Erinnerung: Die Vergleichszeichen sind: [code] > größer als < kleiner als == gleich != ungleich [/code] Die Zeile [code]health < 5:[/code] bedeutet "health ist kleiner als 5". Da [code]health = 100[/code] ist, ist dies falsch, also [code]print("health is greater than five.")[/code] wird nicht ausgeführt.
