Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-23-append-to-arrays.po
Languages: da, fr, hu, it, nl, pt, pt_br, tr, uk, zh_hans

source: Another common use of arrays is [i]stacks[/i] of data. Take a factory management game where you need to retrieve materials from stacks of crates. They arrive at the factory piled up vertically, and you need to take them from top to bottom.
fr: Une autre utilisation courante des tableaux est les [i]piles[/i] de données. Prenez un jeu de gestion d'usine où vous devez récupérer des matériaux dans des piles de caisses. Elles arrivent à l'usine empilées verticalement, et vous devez les prendre de haut en bas.
it: Un altro uso comune per gli array sono le [i]pile[/i] di dati. Prendi un gioco gestionale riguardo ad una fabbrica in cui devi prelevare i materiali da pile di casse. Arrivano alla fabbrica impilate verticalmente e devi prenderle dall'alto verso il basso.
nl: Een ander veelvoorkomend gebruik van arrays is als [i]stapels[/i] van gegevens. Neem een fabrieksmanagementspel waarin je materialen uit stapels kratten moet halen. Ze komen verticaal opgestapeld aan in de fabriek en je moet ze er aan de bovenkant vanaf halen.
pt: Outro uso comum de arrays são [i]stacks[/i] (ou empilhamento) de dados. Imagine um jogo de gestão de fábrica onde recupera materiais de uma pilha de caixas. Elas chegam na fábrica empilhadas verticalmente e você precisa tirá-las de cima para baixo.
pt_br: Outro uso comum de arrays são [i]stacks[/i] (ou empilhamento) de dados. Imagine um jogo de gerenciamento de fábrica onde você precisa recuperar materiais de um pilha de caixas. Elas chegam na fábrica empilhadas verticalmente, e você precisa pegá-las de cima para baixo.
tr: Dizilerin bir diğer yaygın kullanımı veriyi [i]yığın[/i] yapmak şeklindedir. Yığın halindeki sandıklardan malzeme alman gereken bir fabrika yönetimi oyununu ele alalım. Fabrikaya dikey olarak üstüste yığılmış olarak gelirler ve onları yukarıdan aşağıya doğru alman gerekir.
zh_hans: 数组的另一个常见用途是对数据进行 [i]堆栈[/i]（stack）处理。 假设有一个工厂管理游戏，需要你从垒起来的板条箱中取回原材料。 箱子到达工厂时是垂直堆积起来的，需要你将它们从上到下拿走。

source: To take a crate from the back of the array, this time, we use the [code]pop_back()[/code] array function. This function removes (pops) the last value from the array and returns it to you. Here we pop the last value of the array and print what's left of the array to demonstrate how the array gets smaller.
fr: Pour prendre une caisse à l'arrière du tableau, cette fois, nous utilisons la fonction de tableau [code]pop_back()[/code]. Cette fonction retire la dernière valeur du tableau et vous la renvoie. Ici, nous sortons la dernière valeur du tableau et imprimons ce qui reste du tableau pour montrer comment le tableau devient plus petit.
it: Per prendere una cassa dalla fine dell'array, questa volta, usiamo la funzione dell'array [code]pop_back()[/code]. Questa funzione rimuove l'ultimo valore dell'array e te lo ritorna. Qui rimuoviamo l'ultimo valore dell'array e stampiamo quello che rimane nell'array per dimostrare in che modo l'array si rimpicciolisce.
nl: Om deze keer een krat uit de achterkant van de array te halen, gebruiken we de arrayfunctie [code]pop_back()[/code]. Deze functie verwijdert (popt) de laatste waarde uit de array en geeft deze terug. Hier halen we de laatste waarde uit de array en drukken we af wat er over is van de array om te laten zien hoe de array kleiner wordt.
pt: Para tirar uma caixa da parte de trás do array, dessa vez, usamos a função array [code]pop_back()[/code]. Essa função remove (a palavra 'pop' da função significa remover) o último valor do array e retorna-o para si. Aqui retiramos o último valor do array e imprimimos o que resta do array para demonstrar como o array ficou menor.
pt_br: Para pegar uma caixa da parte de trás do array, dessa vez, usamos a função array [code]pop_back()[/code]. Essa função remove (a palavra 'pop' da função significa remover) o último valor do array e o retorna para você. Aqui retiramos o último valor do array e imprimimos o que resta do array para demonstrar como o array ficou menor.
tr: Dizinin arkasındaki bir sandığı almak için, bu kez [code]pop_back()[/code] (çıkar_arkadaki) dizi fonksiyonunu kullanıyoruz. Bu fonksiyon dizideki son değeri çıkarır ve size geri döndürür. Burada dizinin son değerini atıyoruz ve dizinin küçüldüğünü göstermek için diziden kalanları yazdırıyoruz.
zh_hans: 为了从箱子数组的尾部取出一个箱子，这次，要用到数组函数 [code]pop_back()[/code] （尾部出列）。 此函数从数组中删除（弹出）最后一个值并将其作为参数返回。 在这里，我们弹出数组的最后一个值，然后打印出数组的剩余部分，以演示数组是如何变小的。

source: Like [code]pop_front()[/code], the function returns the value removed from the array. You will often store that value in a variable. The value in question could be the crate's content, which you can then use to give resources to the player. In the following practices, you will use the [code]append()[/code], [code]pop_front()[/code], and [code]pop_back()[/code] array functions.
fr: Comme [code]pop_front()[/code], la fonction renvoie la valeur retirée du tableau. Vous stockerez souvent cette valeur dans une variable. La valeur en question pourrait être le contenu de la caisse, que vous pourrez ensuite utiliser pour donner des ressources au joueur. Dans les exercices suivants, vous allez utiliser les fonctions de tableau [code]append()[/code], [code]pop_front()[/code] et [code]pop_back()[/code].
it: Come [code]pop_front()[/code], la funzione ritorna il valore rimosso dall'array. Spesso conserverai questo valore in una variabile. Il valore in questione potrebbe essere il contenuto della cassa, che poi puoi usare per dare le risorse al giocatore. Nelle seguenti pratiche, userai le funzioni array [code]append()[/code], [code]pop_front()[/code] e [code]pop_back()[/code].
nl: Net als [code]pop_front()[/code] geeft de functie de waarde terug die uit de array is verwijderd. Je zult die waarde vaak opslaan in een variabele. De waarde in kwestie kan de inhoud van het krat zijn, die je vervolgens kunt gebruiken om hulpmiddelen aan de speler te geven. In de volgende oefeningen gebruik je de arrayfuncties [code]append()[/code], [code]pop_front()[/code] en [code]pop_back()[/code].
pt: Assim como [code]pop_front()[/code], a função retorna o valor removido do array. Muitas vezes vai armazenar esse valor numa variável. O valor em questão pode ser o conteúdo da caixa, que pode usar para fornecer recursos ao jogador. Nas práticas a seguir, vai usar as funções do array [code]append()[/code], [code]pop_front()[/code] e [code]pop_back()[/code].
pt_br: Assim como [code]pop_front()[/code], a função retorna o valor removido do array. Muitas vezes, você vai armazenar esse valor em uma variável. O valor em questão pode ser o conteúdo da caixa, que você pode usar para fornecer recursos ao jogador. Nas práticas a seguir, você vai usar as funções do array [code]append()[/code], [code]pop_front()[/code] e [code]pop_back()[/code].
tr: [code]pop_front()[/code] gibi, bu fonksiyon da diziden kaldırılan değeri döndürür. Bu değeri genellikle bir değişkende saklarsın. Söz konusu değer, daha sonra oyuncuya kaynak vermek için kullanabileceğin bir sandığın içeriği olabilir. Sıradaki alıştırmalarda, [code]append()[/code], [code]pop_front()[/code], ve [code]pop_back()[/code] dizi fonksiyonlarını kullanacaksın.
zh_hans: 与 [code]pop_front()[/code] 一样，该函数会将从数组中删除的值返回。 通常需要将该值存储在某个变量中。 函数找到的值可以是箱子里装的具体的内容，然后你就可以使用这个栈来为玩家提供资源。 在以下练习中，你会用到数组的 [code]append()[/code]、[code]pop_front()[/code] 和 [code]pop_back()[/code] 函数。

source: The [code]waiting_orders[/code] array will be filled over time. Your job is to move orders from the waiting list to the [code]completed_orders[/code] list using the array's [code]append()[/code] and [code]pop_front()[/code] functions. Remember that the array's [code]pop_front()[/code] function returns the popped value, which allows you to store it in a variable and then pass it to another function.
fr: Le tableau de commandes de la liste d'attente ([code]waiting_orders[/code]) sera rempli au fil du temps. Votre travail consiste à déplacer les commandes de la liste d'attente vers la liste des commandes complétées ([code]completed_orders[/code]) à l'aide des fonctions [code]append()[/code] et [code]pop_front()[/code] du tableau. N'oubliez pas que la fonction [code]pop_front()[/code] du tableau renvoie la valeur extraite, ce qui vous permet de la stocker dans une variable, et puis, de la transmettre à une autre fonction.
it: L'array [code]waiting_orders[/code] si riempirà con il tempo. Il tuo obiettivo è quello di muovere gli ordini dalla lista d'attesa alla lista degli [code]completed_orders[/code] usando le funzioni array [code]append()[/code] e [code]pop_front()[/code]. Ricorda che la funzione di array [code]pop_front()[/code] ritorna il valore rimosso, questo ci consente di conservarlo in una variabile per poi passarlo ad un'altra funzione.
nl: De array [code]waiting_orders[/code] wordt gaandeweg gevuld. Het is jouw taak om bestellingen van de wachtlijst naar de lijst [code]completed_orders[/code] te verplaatsen met behulp van de functies [code]append()[/code] en [code]pop_front()[/code] van de array. Onthoud dat de functie [code]pop_front()[/code] van de array de gepopte waarde teruggeeft, waardoor je deze kunt opslaan in een variabele en vervolgens kunt doorgeven aan een andere functie.
pt: O array [code]waiting_orders[/code] vai ficar cheio com o tempo. O seu trabalho é mover pedidos da lista de espera para a lista [code]completed_orders[/code] usando as funções [code]append()[/code] e [code]pop_front()[/code] do array. Lembre-se que a função [code]pop_front()[/code] do array retorna o valor removido, que te permite armazená-lo numa variável e depois passá-lo para outra função.
pt_br: O array [code]waiting_orders[/code] vai ficar cheio com o tempo. Seu trabalho é mover pedidos da lista de espera para a lista [code]completed_orders[/code] usando as funções [code]append()[/code] e [code]pop_front()[/code] do array. Lembre-se de que a função [code]pop_front()[/code] do array retorna o valor removido, que te permite armazená-lo em uma variável e depois passá-lo para outra função.
tr: [code]waiting_orders[/code] (bekleniyor_siparişler) dizisi zaman içinde doldurulacaktır. Görevin, dizinin [code]append()[/code] (ekle_arkaya) ve [code]pop_front()[/code] (çıkar_öndeki) fonksiyonlarını kullanarak siparişleri bekleme listesinden alıp [code]completed_orders[/code] (tamamlanan_siparişler) listesine taşımaktır. Dizinin [code]pop_front()[/code] fonksiyonunun çıkarılan değeri geri döndürdüğünü unutma, bu da onu bir değişkende saklamana ve daha sonra başka bir fonksiyona aktarmana olanak tanır.
zh_hans: [code]waiting_orders[/code] 数组将随着时间的推移而被塞满订单。 你的工作是使用数组的 [code]append()[/code] 和 [code]pop_front()[/code] 函数将订单从等待列表（waiting_orders）移动到列表 [code]completed_orders[/code] 。 请记住，数组的 [code]pop_front()[/code] 函数会返回弹出的值，允许你将其存储在变量中，然后就可以传递给其他的函数。

source: Crates are piling up on the platform. Move them out of the way by popping them from the [code]crates[/code] array. You need to remove them from top to bottom using the array's [code]pop_back()[/code] function. Your code should remove all the crates in the array using a while loop. [b]Careful![/b] if you run a while loop carelessly, you can lock the software. You can check if the [code]crates[/code] array still contains values by writing [code]while crates:[/code]
fr: Les caisses s'empilent sur la plateforme. Déplacez-les en les enlevant du tableau [code]crates[/code]. Vous devez les retirer de haut en bas à l'aide de la fonction [code]pop_back()[/code] du tableau. Votre code doit retirer toutes les caisses du tableau en utilisant une boucle while. [b]Attention ![/b] Si vous exécutez une boucle while sans précaution, vous pouvez bloquer le logiciel. Vous pouvez vérifier si le tableau [code]crates[/code] contient encore des valeurs en écrivant [code]while crates:[/code]
it: Le casse si stanno accumulando sulla piattaforma. Spostale via rimuovendole dall'array [code]crates[/code]. Devi rimuoverle dall'alto verso il basso usando la funzione per array [code]pop_back()[/code]. Il tuo codice dovrebbe rimuovere tutte le casse nell'array usando un ciclo while. [b]Fa attenzione![/b] se esegui un ciclo while incautamente, potresti bloccare il programma. Puoi controllare se l'array [code]crates[/code] contiene ancora dei valori scrivendo [code]while crates:[/code].
nl: Kratten stapelen zich op op het platform. Haal ze uit de weg door ze uit de array [code]crates[/code] te halen. Je moet ze van boven naar beneden verwijderen met de functie [code]pop_back()[/code] van de array. Je code moet alle kratten in de array verwijderen met behulp van een while-lus. [b]Voorzichtig![/b] Als je een while-lus onvoorzichtig uitvoert, kun je de software vast doen lopen. Je kunt controleren of de array [code]crates[/code] nog waarden bevat door [code]while crates:[/code] te schrijven.
pt: As caixas acumulam-se na plataforma. Tire-as do caminho removendo-as do array [code]crates[/code]. Precisa removê-las de cima para baixo usando a função [code]pop_back()[/code] do array. O seu código deve remover todas as caixas do array usando um loop while. [b]Cuidado![/b] se executar um loop de while de forma descuidada, poderá travar a aplicação. Pode verificar se o array [code]crates[/code] ainda contém valores escrevendo [code]while crates:[/code]
pt_br: As caixas estão se acumulando na plataforma. Tire-as do caminho removendo elas do array [code]crates[/code]. Você precisa removê-las de cima para baixo usando a função [code]pop_back()[/code] do array. Seu código deve remover todas as caixas do array usando um loop while. [b]Cuidado![/b] se você executar um loop while de forma descuidada, poderá travar o aplicativo. Você pode checar se o array [code]crates[/code] ainda contém valores escrevendo [code]while crates:[/code]
tr: Sandıklar birikmeye başladı. Onları [code]crates[/code] (sandıklar) dizisinden kaldırıp yolu temizle. Dizinin [code]pop_back()[/code] fonksiyonunu kullanarak bunları yukarıdan aşağıya doğru kaldırman gerekir. Kodun, bir while döngüsü kullanarak dizideki tüm kasaları kaldırmalıdır. [b]Dikkatli ol![/b] while döngüsünü dikkatsizce çalıştırırsanız yazılımı kilitleyebilirsin. [code]crates[/code] dizisinin içinde, hala bir değer olup olmadığını (yani boş olmadığını) [code]while crates:[/code] yazarak kontrol edebilirsin
zh_hans: 板条箱在平台上堆积如山。 从 [code] crates[/code]（箱子）数组中弹出它们，将它们移走。 你需要用到数组的 [code]pop_back()[/code] 函数，从上到下地删除它们。 你的代码要用 while 循环依次删除数组中所有的箱子。 [b]当心！[/b]如果你不小心搞出了while死循环，搞不好会让这个软件宕机噢。 通过写[code]while crates:[/code]，可以检查到[code]crates[/code]数组中是否还含有值（意思是说空数组会返回false，还有东西会返回true）
