Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-1-what-code-*-like.po
Languages: es, fa, hu, ko, pl, pt_br, sk, sv, th, zh_hans, zh_hant

source: Creating games is more accessible than ever, but it still takes a lot of work and practice. Do not expect any single course, or book, to turn you into a professional. Programming is something you learn through practice. If something doesn't make immediate sense, don't stress it too much! Keep practicing and come back to it later. Enjoy the learning process, and celebrate every little success. It's important because you will never stop learning as a game designer and developer. You will keep discovering new and more expressive ways to program as you gain experience. It's part of the process.
es: Crear juegos es más accesible que nunca, pero sigue requiriendo mucho trabajo y práctica. No esperes que un solo curso o libro te convierta en un profesional. La programación es algo que se aprende con la práctica. Si algo no tiene sentido inmediatamente, ¡no te estreses demasiado! Sigue practicando y vuelve a ello más tarde. Disfruta del proceso de aprendizaje y celebra cada pequeño éxito. Es importante porque como diseñador(a) y desarrollador(a) de juegos nunca dejarás de aprender. Seguirás descubriendo formas nuevas y más expresivas de programar a medida que ganes experiencia. Es parte del proceso.

source: By the end of the series, you will create [b]this[/b].
es: Al final de la serie, crearás [b]esto[/b].

source: Along the way, we'll teach you: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - Some foundations of game programming. Knowing that will help you with any game engine. - How to write real GDScript code. - Most of the GDScript language's syntax. As you go through the course, you will have many questions. We will answer them the best we can as we go. But there is so much to cover that we'll have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things. We broke down the course into bite-size lessons with many short practices. If we put too much in each part, you'd learn slower. If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
es: En el camino, te enseñaremos: - Algo de la mentalidad que necesitas como desarrollador o desarrolladora. Demasiados cursos de programación se saltan esa parte esencial. - Algunos fundamentos de la programación de juegos. Saber esto te ayudará con cualquier motor de juego. - Cómo escribir código de GDScript real. - La mayor parte de la sintaxis del lenguaje GDScript. A medida que vayas avanzando en el curso, tendrás muchas preguntas. Las responderemos lo mejor que podamos sobre la marcha. Pero hay tanto que cubrir que tendremos que tomar algunos atajos. No queremos [i]abrumarte[i] con información. También queremos respetar el ritmo al que nuestro cerebro memoriza las cosas. Hemos dividido el curso en lecciones pequeñas con muchas prácticas cortas. Si pusiéramos demasiado en cada parte, aprenderías más lento. Si en algún momento te quedas con dudas que no pueden esperar, te invitamos a unirte a [url=https://discord.gg/87NNb3Z]nuestra comunidad de Discord[/url].

source: Programming is a skill, so to get good at it, you must practice. It is why we built this app. Each short lesson is immediately followed by an interactive practice to get you to use what you learned. Speaking of which, it's time to look at the practice screen! To continue, click the [i]Practice[/i] button below. It will give you a short run through how practices work.
es: Programar es una habilidad, así que para mejorar, debes practicar. Es por eso que hemos creado esta aplicación. A cada lección breve le sigue inmediatamente una práctica interactiva para que puedas usar lo que aprendiste. Hablando de eso, ¡es hora de ver la pantalla de práctica! Para continuar, haz clic en el botón [i]Práctica[/i] de abajo. Te dará una breve explicación de cómo funcionan las prácticas.
