Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-12-using-variables.po
Languages: es, hu, nl, pl, pt, tr, zh_hans

source: In this lesson, we'll make our code easier to follow and understand at a glance. Take a look at this example.
es: En esta lección, haremos que nuestro código sea más fácil de seguir y entender a simple vista. Mira el siguiente ejemplo.
hu: Ebben a leckében sokkal könnyebben követhetővé, és ránézésre érthetővé tesszük. Nézd meg ezt a példát.
nl: In deze les maken we onze code gemakkelijker te volgen en in één oogopslag te begrijpen. Kijk eens naar dit voorbeeld.
pl: W tej lekcji uczynimy nasz kod bardziej przejrzystym i łatwiejszym do zrozumienia już na pierwszy rzut oka. Weźmy poniższy przykład:
pt: Nessa lição, vamos tornar nosso código mais fácil de seguir e entender rapidamente. Observe esse exemplo.
tr: Bu derste, kodumuzu takip etmeyi ve bir bakışta anlamayı kolaylaştıracağız. Bu örneğe bir göz at.
zh_hans: 在本课中，我们将学习怎么让我们的代码更容易理解和看懂。 看看这个例子。

source: In the above example, what does the number 4 mean?
es: En el ejemplo anterior, ¿qué significa el número 4?
hu: A fenti példában mit jelent a 4-es szám?
nl: Wat betekent het getal 4 in het bovenstaande voorbeeld?
pl: Co oznacza liczba 4 w tym przykładzie?
pt: No exemplo acima, o que significa o número 4?
tr: Yukarıdaki örnekte, 4 sayısı ne anlama geliyor?
zh_hans: 在上面的例子中，数字 4 是什么意思？

source: The code above rotates the character [code]4[/code] radians per second.
es: El código anterior hace girar al personaje [code]4[/code] radianes por segundo.
hu: A fenti kód másodpercenként [code]4[/code] radiánnal forgatja a karaktert.
nl: De bovenstaande code draait het personage [code]4[/code] radialen per seconde.
pl: Powyższy kod obraca postać [code]4[/code] radiany na sekundę.
pt: O código acima rotaciona a personagem [code]4[/code] radianos por segundo.
tr: Yukarıdaki kod, karakterini saniyede [code]4[/code] radyan döndürür.
zh_hans: 上面的代码将角色每秒旋转[code]4[/code] 弧度。

source: It's how fast the character rotates.
es: Es la velocidad de rotación del personaje.
hu: Ilyen gyorsan forog a karakter.
nl: Het geeft aan hoe snel het personage draait.
pl: To jak szybko postać się obraca.
pt: É o quão rápido a personagem rotaciona.
tr: Karakterin ne kadar hızlı döndüğüdür.
zh_hans: 它代表的是角色旋转的速度。

source: It's how far the character moves in pixels.
es: Es la distancia que se mueve el personaje en pixeles.
hu: Ekkor pixel távolságra mozdul el a karakter.
nl: Het geeft aan hoe ver het personage beweegt in pixels.
pl: To jak daleko porusza się postać w pikselach.
pt: É o quão longe a personagem se move em pixels.
tr: Karakterin, piksel cinsinden ne kadar uzağa hareket ettiğidir.
zh_hans: 它代表角色移动的距离，以像素为单位。

source: It's how long the rotation takes.
es: Es el tiempo que dura la rotación.
hu: Ennyi ideig tart a forgás.
nl: Het geeft aan hoe lang de draaiing duurt.
pl: To jak długo zajmuje obrót.
pt: É a quantidade de tempo que leva a rotação.
tr: Dönme hareketinin ne kadar sürdüğüdür.
zh_hans: 它代表的是旋转会耗费的时间。

source: We can guess what a number represents by looking at the function names, but it's harder to recall what this number does by quickly looking at the code. We've seen how different functions have their own names. Using these names communicates to developers what the functions do.
es: Podemos adivinar lo que representa un número mirando los nombres de las funciones, pero es más difícil recordar lo que hace ese número mirando rápidamente el código. Hemos visto cómo diferentes funciones tienen sus propios nombres. El uso de estos nombres comunica a los desarrolladores lo que hacen las funciones.
hu: Tippelhetünk, hogy mit jelent egy szám, ha megnézzüka függvény nevét, de nehezebb emlékezni rá, hogy mit csinál ez a szám, ha csak gyorsan ránézünk a kódra. Láttuk már, hogy a különböző függvényekenk saját neve van. Ezek a neveket használva a fejlesztők tudják, hogy mit csinálnak.
nl: We kunnen raden wat een getal voorstelt door naar de functienamen te kijken, maar het is moeilijker om te bedenken wat dit getal doet door snel naar de code te kijken. We hebben gezien hoe verschillende functies hun eigen namen hebben. Het gebruik van deze namen communiceert aan ontwikkelaars wat de functies doen.
pl: Możemy odgadnąć, co liczba reprezentuje patrząc na nazwy funkcji, jednak trudniej jest przypomnieć sobie, co dana liczba robi, szybko zerkając na kod. Spotkaliśmy się już z własnymi nazwami różnych funkcji. Używanie tych nazw komunikuje programistom co funkcje robią.
pt: Podemos adivinhar o que um número representa observando os nomes das funções, mas é mais difícil de se lembrar o que esse número faz só olhando rapidamente ao código. Vimos como diferentes funções têm nomes próprios. O uso desses nomes diz aos programadores o que as funções fazem.
tr: Fonksiyon isimlerine bakarak, bir sayının neyi temsil ettiğini tahmin edebiliriz, ancak koda hızlıca bakarak bu sayının ne işe yaradığını hatırlamak oldukça zordur. Farklı fonksiyonların nasıl kendi isimleri olduğunu gördük. Bu isimleri kullanmak, geliştiricilere fonksiyonların ne yaptığını bildirir.
zh_hans: 我们能通过函数名称来推测函数里的一个数字代表什么，但只是简单看一遍代码的话，很难回想起这个数字的作用。 我们已经看过了各种不同的函数，它们都有自己的名字。这些名称可以向开发人员传达这些函数的具体作用。

source: As we learned in lesson 8, we can also assign labels to numbers to help us remember what they do. We call these labels [i]variables[/i]. [b]A variable is a label for a value we can save, change, and read later.[/b] Let's recap how to define a variable.
es: Como aprendimos en la lección 8, también podemos asignar etiquetas a los números para ayudarnos a recordar lo que hacen. A estas etiquetas las llamamos [i]variables[/i]. [b]Una variable es una etiqueta para un valor que podemos guardar, cambiar y leer más tarde[/b] Recapitulemos cómo se define una variable.
hu: Ahogy a 8-as leckében már láthattuk, a számokhoz is rendelhetünk címkéket, hogy segítsenek emlékezeni, mire jók. Ezeket a címkéket [i]változónak[/i] nevezzük. [b]A változó egy címke az értéken, amit menthetünk, módosíthatunk, és később felhasználhatunk.[/b] Nézzük át újra, hogyan hozhatunk létre egy változót.
nl: Zoals we in les 8 hebben geleerd, kunnen we ook labels toekennen aan getallen om ons te helpen onthouden wat ze doen. We noemen deze labels [i]variabelen[/i]. [b]Een variabele is een label voor een waarde die we kunnen opslaan, wijzigen en later lezen.[/b] Laten we nog eens bekijken hoe we een variabele definiëren.
pl: Jak dowiedzieliśmy się w lekcji 8, możemy również przypisywać etykiety do liczb, pomagając sobie zapamiętać, co takiego robią. Etykiety te nazywamy [i]zmiennymi[/i]. [b]Zmienna to etykieta wartości, którą możemy zapisać, zmienić i odczytać w późniejszym czasie.[/b] Przyjrzyjmy się temu, jak definiujemy zmienną:
pt: Como aprendemos na lição 8, também podemos atribuir rótulos (nomes) aos números para nos ajudar a se lembrar o que eles fazem. Chamamos esses nomes de [i]variáveis[/i]. [b]Uma variável é um nome que damos a um valor que podemos salvar, alterar e ler mais tarde.[/b] Vamos revisar como definir uma variável.
tr: Ders 8'de öğrendiğimiz gibi, ne işe yaradıklarını hatırlamamıza yardımcı olması için sayılara da etiketler atayabiliriz. Bu etiketlere, [i]değişkenler[/i] diyoruz. [b]Değişken, bir değer için kaydedebileceğimiz, değiştirebileceğimiz ve daha sonra okuyabileceğimiz bir etikettir.[/b] Bir değişkenin nasıl tanımlanacağını özetleyelim.
zh_hans: 正如我们在第 8 课中所学到的，我们还可以给数字贴标签，能帮助我们记住它们的作用。 我们称这些标签为[i]变量[/i]。 [b]变量是可以保存、更改和稍后读取的值的标签。[/b] 让我们回顾一下如何定义一个变量。

source: We improve the first example to make it clear what the number [code]4[/code] does.
es: Mejoramos el primer ejemplo para dejar claro lo que hace el número [code]4[/code].
hu: Javítani fogunk az előző példán, hogy pontosan látszódjon, mit csinál a [code]4[/code]-es szám.
nl: We verbeteren het eerste voorbeeld om duidelijk te maken wat het getal [code]4[/code] doet.
pl: Poprawmy pierwszy przykład, aby jasnym stało się, co robi liczba [code]4[/code]:
pt: Melhoramos o primeiro exemplo para deixar claro o que o número [code]4[/code] faz.
tr: İlk örneğimizi, [code]4[/code] sayısının ne işe yaradığını netleştirmek için geliştirelim.
zh_hans: 我们改进了开始的示例，现在数字 [code]4[/code] 的作用变得很清晰了。

source: Labeling a value makes the code easier for us to read now [i]and[/i] in the future.
es: Etiquetar un valor nos facilita la lectura del código ahora [i]y[/i] en el futuro.
hu: Az értékek felcímkézése egyszerűbbé teszi a kód olvasását most [i]és[/i] majd a jövőben is.
nl: Het labelen van een waarde maakt de code makkelijker te lezen voor ons, nu [i]en[/i] in de toekomst.
pl: Oznaczenie wartości etykietą sprawia, że napisany kod staje się dla nas czytelniejszym w chwili obecnej [i]oraz[/i] w przyszłości.
pt: Nomear um valor facilita a leitura do código agora [i]e[/i] no futuro.
tr: Bir değeri etiketlemek, kodu şimdi [i]ve[/i] gelecekte okumamızı kolaylaştırır.
zh_hans: 给一个值打标签，让我们在现在、[i] 更是为了 [/i] 在将来能更容易读懂这些代码。

source: In the above example, which line defines the angular speed variable?
es: En el ejemplo anterior, ¿qué línea define la variable de velocidad angular?
hu: A fenti példában melyik sor határozza meg a körsebesség (angular speed) változóját?
nl: Welke regel in het bovenstaande voorbeeld definieert de hoeksnelheidsvariabele?
pl: W powyższym przykładzie, która linia definiuje zmienną prędkości kątowej?
pt: No exemplo acima, qual linha define a variável de velocidade angular?
tr: Yukarıdaki örnekte, hangi satır açısal hız değişkenini (angular speed) tanımlıyor?
zh_hans: 在上面的例子中，哪一行定义了角速度（angular speed）变量？

source: We create the [code]angular_speed[/code] variable, then assign it the value of [code]4[/code].
es: Creamos la variable [code]angular_speed[/code] y luego le asignamos el valor de [code]4[/code].
hu: Létrehozzuk az [code]angular_speed[/code] változót, és megadjuk neki értékként a [code]4[/code]-et.
nl: We maken de variabele [code]angular_speed[/code] en wijzen deze de waarde [code]4[/code] toe.
pl: Tworzymy zmienną [code]angular_speed[/code], a następnie przypisujemy jej wartość [code]4[/code].
pt: Criamos a variável [code]angular_speed[/code] e atribuímos-la o valor [code]4[/code].
tr: Önce [code]angular_speed[/code] değişkenini oluşturup, sonra bu değişkene [code]4[/code] değerini atıyoruz.
zh_hans: 我们创建了 [code]angular_speed[/code] 变量，然后为它分配 [code]4[/code] 的值。

source: If we define variables outside of functions, we can re-use them in different functions. Because any function can use variables we define outside of them, we call these variables [b]script-wide[/b]. Here we use the [code]angular_speed[/code] script-wide variable in both the [code]_process()[/code] function and the [code]set_angular_speed()[/code] function.
es: Si definimos variables fuera de las funciones, podemos reutilizarlas en diferentes funciones. Debido a que cualquier función puede utilizar las variables que definimos fuera de ella, llamamos a estas variables [b]script-wide[/b]. Aquí utilizamos la variable script-wide [code]angular_speed[/code] tanto en la función [code]_process()[/code] como en la función [code]set_angular_speed()[/code].
hu: Ha a függvényen kívül hozunk létre változókat, azokat felhasználhatjuk más függvényekben is. Mivel minden függvény használhat olyan változót, ami rajta kívül lett létrehozva, ezért ezeket [b]szkript-szintű[/b] változónak hívjuk. Itt az [code]angular_speed[/code] nevű szkript-szintű változót a [code]_process()[/code] függvényben és a [code]set_angular_speed()[/code] függvényben is felhasználjuk.
nl: Als we variabelen buiten functies definiëren, kunnen we ze hergebruiken in verschillende functies. Omdat elke functie variabelen kan gebruiken die we buiten de functie definiëren, noemen we deze variabelen [b]script-breed[/b]. Hier gebruiken we de script-brede variabele [code]angular_speed[/code] in zowel de functie [code]_process()[/code] als de functie [code]set_angular_speed()[/code].
pl: Jeśli zdefiniujemy zmienne na zewnątrz funkcji, będziemy mogli użyć ich ponownie w innych funkcjach. Ponieważ każda funkcja może używać zmiennych zdefiniowanych poza ich ciałem, zmienne takie nazywamy [b]skryptoszerokimi[/b] (ang. script-wide - obejmującymi swoim zakresem cały skrypt). Tutaj używamy zmiennej [code]angular_speed[/code] skryptoszeroko, stąd użyć jej możemy zarówno w funkcji [code]_process()[/code], jak i w funkcji [code]set_angular_speed()[/code].
pt: Se definirmos variáveis fora das funções, podemos reutilizá-las em funções diferentes. Como qualquer função pode usar variáveis que definimos fora delas, chamamos essas variáveis de [b]script-wide[/b] (ou variáveis de script, ou seja, são variáveis que fazem parte de todo o script, não apenas de um só bloco de código). Aqui usamos a variável de script [code]angular_speed[/code] na função [code]_process()[/code] e na função [code]set_angular_speed()[/code].
tr: Eğer değişkenleri, fonksiyonların dışında tanımlarsak, onları farklı fonksiyonlarda tekrar kullanabiliriz. Herhangi bir fonksiyon, kendisinin dışında tanımladığımız değişkenleri kullanabileceği için, bu değişkenlere [b]betik-genelinde (script-wide)[/b] adını veriyoruz. Burada hem [code]_process()[/code] fonksiyonunda hem de [code]set_angular_speed()[/code] (ayarla_açısal_hız) fonksiyonunda, [code]angular_speed[/code] (açısal_hız) isimli betik-genelinde değişkenini kullanıyoruz.
zh_hans: 如果我们在函数之外定义变量，我们可以在不同的函数中重用它们。 因为任何函数都可以使用我们在函数外定义的变量，所以我们称这些变量是 [b]全脚本范围（script-wide）[/b]的。 这个例子里，我们在 [code]_process()[/code] 函数和 [code]set_angular_speed()[/code] 函数中都使用了 [code]angular_speed[/code] ，一个脚本范围的变量。

source: We can also define variables inside of functions. We align the variable assignment by indenting to make it part of the function body. Make sure to create the variable before using it! If we define a variable inside of a function, only that function can use it.
es: También podemos definir variables dentro de funciones. Alineamos la asignación de la variable agregando una sangría para que forme parte del cuerpo de la función. ¡Asegúrate de crear la variable antes de utilizarla! Si definimos una variable dentro de una función, sólo esa función puede utilizarla.
hu: Függvényen belül is létrehozhatunk változókat. A változó létrehozását beljebb kezdjük, hogy a függvény része legyen. Győzödj meg róla, hogy létrehozod a változót, mielőtt használnád! Ha a függvényen belül hozunk létre egy változót, akkor azt csak abban használhatjuk.
nl: We kunnen variabelen ook binnen functies definiëren. We lijnen de toewijzing aan de variabele uit door deze te laten inspringen, zodat deze deel uitmaakt van de functie. Zorg ervoor dat je de variabele aanmaakt voordat je hem gebruikt! Als we een variabele in een functie definiëren, kan alleen die functie deze gebruiken.
pl: Możemy również definiować zmienne wewnątrz funkcji. W tym celu wyrównujemy przypisanie zmiennej tabulatorem, aby stała się ona częścią ciała funkcji. Należy upewnić się, że zmienna została utworzona nim zdecydujemy się jej użyć! Jeśli definiujemy zmienną wewnątrz funkcji, wyłącznie ta funkcja będzie mogła jej używać.
pt: Também podemos definir variáveis dentro de funções. Alinhamos a atribuição de variável recuando ela (fazendo uma indentação) para torná-la parte do corpo da função. Certifique-se de criar a variável antes de usá-la! Se definirmos uma variável dentro de uma função, somente essa função vai poder usar ela.
tr: Değişkenleri, fonksiyonların içinde de tanımlayabiliriz. Değişken atamasını fonksiyon gövdesinin bir parçası haline getirmek için, girinti yaparak hizalıyoruz. Kullanmadan önce değişkeni oluşturduğundan emin ol! Bir değişkeni, bir fonksiyonun içinde tanımlarsak, bunu yalnızca o fonksiyon kullanabilir.
zh_hans: 我们还可以在函数内部定义变量。 通过缩进对齐（tab）变量赋值语句，使其成为函数结构的一部分。使用变量之前记得先创建！ 如果我们在函数内部定义一个变量，那么只有该函数可以使用它。

source: The [code]angular_speed[/code] variable only exists inside [code]_process()[/code], because we defined it there. The [code]set_angular_speed()[/code] function can't use it. Trying to use it there will result in an error. Here's what this error might look like.
es: La variable [code]angular_speed[/code] sólo existe dentro de [code]_process()[/code] porque la hemos definido allí. La función [code]set_angular_speed()[/code] no puede utilizarla. Tratar de usarla allí resultará en un error. Así es como podría verse este error.
hu: Az [code]angular_speed[/code] változó, csak a [code]_process()[/code] függvényben létezik, mert itt hoztuk létre. A [code]set_angular_speed()[/code] függvény nem használhatja. Ha megpróbáljuk ott használni, hibaüzenetet kapunk. Itt egy példa eg yilyen hibaüzentre.
nl: De variabele [code]angular_speed[/code] bestaat alleen binnen [code]_process()[/code], want daar hebben we haar gedefinieerd. De functie [code]set_angular_speed()[/code] kan haar niet gebruiken. Proberen haar daar te gebruiken zal een foutenmelding opleveren. Zo ziet deze foutmelding eruit.
pl: Zmienna [code]angular_speed[/code] istnieje tylko wewnątrz [code]_process()[/code], ponieważ tam ją zdefiniowaliśmy. Funkcja [code]set_angular_speed()[/code] nie może jej użyć. Próba użycia jej tam zakończy się błędem. Oto jak może wyglądać ten błąd:
pt: A variável [code]angular_speed[/code] só existe dentro da função [code]_process()[/code], porque a definimos lá. A função [code]set_angular_speed()[/code] não pode usá-la. Tentar usar ela vai resultar num erro. Veja aqui como pode ser esse erro.
tr: [code]angular_speed[/code] değişkeni, yalnızca [code]_process()[/code] içerisinde mevcuttur, çünkü onu orada tanımladık. [code]set_angular_speed()[/code] fonksiyonu bunu kullanamaz. Orada kullanmaya çalışmak bir hatayla sonuçlanacaktır. Bu hata şu şekilde görünebilir.
zh_hans: [code]angular_speed[/code] 变量只存在于 [code]_process()[/code] 中，因为我们在那里定义了它。 [code]set_angular_speed()[/code] 函数就不能使用。 尝试在那里使用它会导致错误。 这个错误大概是这样的。

source: Where can we define variables?
es: ¿Dónde podemos definir las variables?
hu: Hol hozhatunk létre változókat?
nl: Waar kunnen we variabelen definiëren?
pl: Gdzie możemy definiować zmienne?
pt: Onde podemos definir variáveis?
tr: Değişkenleri nerede tanımlayabiliriz?
zh_hans: 我们可以在哪些地方定义变量？

source: Functions can use any variables defined outside of functions. These variables are [b]script-wide[/b]. If we define a variable inside of a function, only that function can use it.
es: Las funciones pueden usar cualquier variable definida fuera de las funciones. Estas variables son [b]script-wide[/b]. Si definimos una variable dentro de una función, sólo esa función puede usarla.
hu: A függvények bármilyen változót használhatnak, amit rajtuk kívül hoztak létre. Ezek a [b]szkript-szintű[/b] változók. Ha függvényen belül hozunk létre változót, akkor csak ott tudjuk használni.
nl: Functies kunnen alle variabelen gebruiken die buiten functies zijn gedefinieerd. Deze variabelen zijn [b]script-breed[/b]. Als we een variabele binnen een functie definiëren, kan alleen die functie deze gebruiken.
pl: Funkcje mogą używać dowolnych zmiennych zdefiniowanych na zewnątrz funkcji. Zmienne takie nazywamy zmiennymi [b]skryptoszerokimi[/b]. Jeśli zdefiniujemy zmienną wewnątrz funkcji, wyłącznie ta funkcja będzie mogła jej używać.
pt: As funções podem usar quaisquer variáveis definidas fora das funções. Essas variáveis são [b]script-wide[/b] (variáveis de script). Se definirmos uma variável dentro de uma função, somente essa função poderá usá-la.
tr: Fonksiyonlar, fonksiyonların dışında tanımlanan değişkenleri kullanabilir. Bu değişkenler [b]betik-genelinde[/b]dir. Bir fonksiyonun içinde bir değişken tanımlarsak, bunu yalnızca o fonksiyon kullanabilir.
zh_hans: 函数可以使用在函数之外定义的任何变量。这些变量是 [b] 脚本范围 [/b]的。 如果我们在函数内部定义一个变量，那么只有该函数可以使用它。

source: Outside of functions.
es: Fuera de las funciones.
hu: Függvényeken kívül.
nl: Buiten functies.
pl: Na zewnątrz funkcji.
pt: Fora das funções.
tr: Fonksiyonların dışında.
zh_hans: 函数的外面。

source: Inside of functions.
es: Dentro de las funciones.
hu: Függvényeken belül.
nl: Binnen functies.
pl: Wewnątrz funkcji.
pt: Dentro das funções.
tr: Fonksiyonların içinde.
zh_hans: 函数内部。

source: Variables are also great at grouping values that control how a character behaves. Grouping them in this way allows us to easily change them.
es: Las variables también son excelentes para agrupar valores que controlan cómo se comporta un personaje. Agruparlas de este modo nos permite cambiarlas fácilmente.
hu: A változók arra is jók, hogy csoportosítsuk az értékeket, amelyek a karakter viselkedését befolyásolják. Ha így csoportosítjuk őket, akkor könnyen módosíthatjuk őket.
nl: Variabelen zijn ook ideaal voor het groeperen van waarden die bepalen hoe een personage zich gedraagt. Door ze op deze manier te groeperen, kunnen we ze gemakkelijk aanpassen.
pl: Zmienne są również świetne do grupowaniu wartości kontrolujących zachowanie postaci. Grupowanie wartości w ten sposób pozwoli nam łatwo je zmieniać:
pt: As variáveis também são ótimas para agrupar valores que controlam como uma personagem se comporta. Agrupá-las dessa maneira permite-nos alterá-las facilmente.
tr: Değişkenler, bir karakterin nasıl davranacağını kontrol eden değerleri gruplamak için de harikadır. Bu şekilde gruplandırmak, bunları kolayca değiştirebilmemizi sağlar.
zh_hans: 那些控制角色行为的值，使用变量也能很好地对它们进行分组。 像这样把它们分组，可以轻松地更改它们的值。

source: In the following practices, we'll define variables and use them with some familiar functions to make our code more readable.
es: En las siguientes prácticas, definiremos variables y las utilizaremos con algunas funciones familiares para hacer que nuestro código sea más legible.
hu: A következő gyakorlatokban, változókat fogunk létrehozni és néhány már ismerős függvényben fogjuk őket használni, hogy átláthatóbbá tegyük a kódunkat.
nl: In de volgende oefeningen zullen we variabelen definiëren en ze gebruiken met enkele bekende functies om onze code leesbaarder te maken.
pl: W czekających nas ćwiczeniach zdefiniujemy zmienne i użyjemy ich z kilkoma znajomymi funkcjami w taki sposób, aby nasz kod był bardziej czytelny.
pt: Nas práticas a seguir, vamos definir variáveis e as usaremos com algumas funções familiares para tornar nosso código mais legível.
tr: Sıradaki uygulamalarda, kodumuzu daha okunabilir hale getirmek için, değişkenler tanımlayacak ve bunları bazı tanıdık fonksiyonlarla birlikte kullanacağız.
zh_hans: 在接下来的练习中，我们将定义变量并结合一些熟悉的函数使用，让我们的代码更具可读性。

source: Clarifying Code Using Variables
es: Aclarar el código usando variables
hu: A kód átláthatóbbá tétele változók segítségével
nl: Code verduidelijken door middel van variabelen
pl: Uczyń kod klarownym wykorzystując zmienne
pt: Esclarecendo o Código Usando Variáveis
tr: Değişkenler Kullanarak Kodu Netleştirmek
zh_hans: 用变量使代码变清晰
