Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-20-looping-over-arrays.po
Languages: fr, nl, tr, zh_hans

source: We used the [code]range()[/code] function in combination with [code]for[/code] loops.
fr: Nous avons utilisé la fonction [code]range()[/code] en combinaison avec des boucles [code]for[/code].
nl: We hebben de functie [code]range()[/code] gebruikt in combinatie met [code]for[/code]-lussen.
tr: [code]range()[/code] fonksiyonunu, [code]for[/code] döngüleri ile birlikte kullanmıştık.
zh_hans: 之前我们把 [code]range()[/code] 函数和 [code]for[/code] 循环结合使用。

source: The [code]range()[/code] function produced an array that the [code]for[/code] keyword could loop over. We can give [code]for[/code] loops [i]any[/i] array, and they will loop over them just the same. Instead of using the [code]range()[/code] function, we could manually write the numbers and get the same result.
fr: La fonction [code]range()[/code] a produit un tableau sur lequel le mot-clé [code]for[/code] pouvait parcourir en boucle. Nous pouvons donner aux boucles [code]for[/code] [i]n'importe quel[/i] tableau, et elles boucleront dessus de la même manière. Au lieu d'utiliser la fonction [code]range()[/code], nous pourrions écrire manuellement les nombres et obtenir le même résultat.
nl: De functie [code]range()[/code] produceerde een array waar met behulp van het sleutelwoord [code]for[/code] doorheen kon worden gestapt. We kunnen [code]for[/code]-lussen[i]elke[/i] array geven en ze zullen er net zo doorheen lopen. In plaats van de functie [code]range()[/code] te gebruiken, zouden we de getallen handmatig kunnen schrijven en hetzelfde resultaat krijgen.
tr: [code]range()[/code] fonksiyonu, [code]for[/code] anahtar kelimesinin üzerinde döngü kurabileceği bir dizi üretiyor. [code]for[/code] döngülerine, [i]herhangi bir[/i] dizi verirsek, bunlar üzerinde de aynı şekilde döngü kurulacaktır. [code]range()[/code] fonksiyonunu kullanmak yerine, sayıları elle yazabilir ve aynı sonucu elde edebilirdik.
zh_hans: [code]range()[/code] 函数生成了一个数组，[code]for[/code] 关键字可以循环遍历该数组。 其实可以给 [code]for[/code] 循环 [i]任何[/i] 数组，它会以同样的方式循环遍历它们。 而且不用 [code]range()[/code] 函数，也可以手动编写数组并得到相同的结果。

source: For each element inside the array, the [code]for[/code] loop extracts it, stores it in the temporary variable named [code]number[/code], and executes the loop's code once. Inside the loop, you can access the [code]number[/code] variable, which changes on each [i]iteration[/i]. The code works regardless of the array or where you store it. Often, you will store arrays in variables for easy access.
fr: Pour chaque élément du tableau, la boucle [code]for[/code] l'extrait, le stocke dans la variable temporaire nommée [code]number[/code] et exécute le code de la boucle une fois. À l'intérieur de la boucle, vous pouvez accéder à la variable [code]number[/code], qui change à chaque [i]itération[/i]. Le code fonctionne quel que soit le tableau ou l'endroit où vous le stockez. Souvent, vous stockerez les tableaux dans des variables pour y accéder facilement.
nl: Voor elk element in de array haalt de [code]for[/code]-lus het eruit, slaat het op in de tijdelijke variabele met de naam [code]number[/code] en voert de code van de lus één keer uit. Binnen de lus heb je toegang tot de variabele [code]number[/code], die bij elke [i]iteratie[/i] verandert. De code werkt ongeacht de array of waar je deze opslaat. Vaak sla je arrays op in variabelen voor gemakkelijke toegang.
tr: Bir dizinin içindeki her bir öğe için, [code]for[/code] döngüsü bu öğeyi alır, [code]number[/code] isimli geçici değişkende saklar, ve döngü kodunu bir kez çalıştırır. Döngünün içinde, her [i]yinelemede[/i] değişen bu [code]number[/code] değişkenine erişebilirsin. Kod, diziden veya onu nerede sakladığına bakmadan çalışır. Genellikle, kolay erişim için dizileri değişkenlerde saklarsın.
zh_hans: 对于数组中的每个元素，[code]for[/code] 循环将其提取出来，存储在名为 [code]number[/code] 的临时变量中，并执行一次循环的代码。 在循环内部，可以访问到 [code]number[/code] 变量，该变量在每次 [i]迭代[/i] 时都会发生变化。 无论数组的形式是怎样的，数组存储位置在哪儿，该代码都有效。 通常来说，会将数组存储在变量中以便于访问。

source: What will this code print?
fr: Que va imprimer ce code ?
nl: Wat zal deze code afdrukken?
tr: Bu kod ne yazdıracak?
zh_hans: 这段代码会打印（print）什么？

source: Compared to previous examples, we store the array in the [code]numbers[/code] variable. Using the [code]numbers[/code] variable in our [code]for[/code] loop allows the computer to access the array of numbers like before. We have three numbers in the array: [code]0[/code], [code]1[/code], and [code]2[/code]. The loop extracts each of them sequentially and assigns it to the [code]number[/code] temporary variable. As the loop processes each number, the output will print [code]0[/code], then [code]1[/code], then [code]2[/code], each on a separate line.
fr: Par rapport aux exemples précédents, nous stockons le tableau dans la variable [code]numbers[/code]. L'utilisation de la variable [code]numbers[/code] dans notre boucle [code]for[/code] permet à l'ordinateur d'accéder au tableau de nombres comme auparavant. Nous avons trois nombres dans le tableau : [code]0[/code], [code]1[/code] et [code]2[/code]. La boucle extrait chacun d'eux séquentiellement et l'affecte à la variable temporaire [code]number[/code]. À mesure que la boucle traite chaque nombre, la sortie imprimera [code]0[/code], puis [code]1[/code], puis [code]2[/code], chacun sur une ligne distincte.
nl: In vergelijking met de vorige voorbeelden slaan we de array op in de variabele [code]numbers[/code]. Door de variabele [code]numbers[/code] in onze [code]for[/code]-lus te gebruiken, kan de computer de array van getallen gebruiken zoals voorheen. We hebben drie getallen in de array: [code]0[/code], [code]1[/code] en [code]2[/code]. De lus haalt elk getal opeenvolgend tevoorschijn en wijst het toe aan de tijdelijke variabele [code]number[/code]. Omdat de lus elk nummer verwerkt, zal [code]0[/code], dan [code]1[/code], dan [code]2[/code] worden afgedrukt, elk op een aparte regel.
tr: Önceki örneklerle karşılaştırırsak, diziyi [code]numbers[/code] değişkeninde saklıyoruz. [code]for[/code] döngümüzde [code]numbers[/code] değişkenini kullanmak, bilgisayarın sayı dizisine daha önce olduğu gibi erişmesini sağlar. Dizide üç tane sayımız var: [code]0[/code], [code]1[/code], ve [code]2[/code]. Döngü bunların her birini sırayla çıkarır ve [code]number[/code] geçici değişkenine atar. Döngü her bir sayıyı işledikçe, çıktıya, her biri ayrı bir satırda olacak şekilde, ilk başta [code]0[/code], sonra [code]1[/code], ve en son [code]2[/code] yazdırılır.
zh_hans: 与前面的示例不同的是，数组被存储在 [code]numbers[/code] 变量中。 在 [code]for[/code] 循环中使用 [code]numbers[/code] 数组变量，计算机也能像以前一样访问到数字数组。 在我们的数组中有三个数字：[code]0[/code]、[code]1[/code] 和 [code]2[/code]。 循环依次提取每一个数并将其分配给临时变量 [code]number[/code] 。 当循环依次处理数字时，输出将打印 [code]0[/code]，然后是 [code]1[/code]，然后是 [code]2[/code]，每个数字在单独的一行。

source: 0, 1, and 2
fr: 0, 1, et 2
nl: 0, 1 en 2
tr: 0, 1 ve 2
zh_hans: 0, 1, 和 2

source: 1, 2, and 3
fr: 1, 2, et 3
nl: 1, 2 en 3
tr: 1, 2 ve 3
zh_hans: 1, 2, 和 3

source: 0, 0, and 0
fr: 0, 0, et 0
nl: 0, 0 en 0
tr: 0, 0 ve 0
zh_hans: 0, 0, 和 0

source: Making the turtle walk, with a loop
fr: Faire marcher la tortue, avec une boucle
nl: De schildpad laten lopen, met een lus
tr: Kaplumbağayı, bir döngü kullanarak yürütmek
zh_hans: 用循环让小海龟移动

source: In the previous lesson, you made a turtle walk along a path by writing [code]Vector2[/code] coordinates in an array.
fr: Dans la leçon précédente, vous avez fait marcher une tortue sur un chemin en écrivant les coordonnées de [code]Vector2[/code] dans un tableau.
nl: In de vorige les heb je een schildpad langs een pad laten lopen door [code]Vector2[/code] coördinaten in een array te schrijven.
tr: Bir önceki derste, [code]Vector2[/code] konumlarını bir diziye yazarak, bir kaplumbağanın bir yol boyunca yürümesini sağladın.
zh_hans: 在上一课中，你在数组中写入 [code]Vector2[/code] 坐标组，成功让海龟沿着路径移动了。

source: It's a [code]for[/code] loop that makes the turtle walk along the path. The loop works like this: for each coordinate in the array, it moves the turtle once to that cell.
fr: C'est une boucle [code]for[/code] qui fait marcher la tortue le long du chemin. La boucle fonctionne comme ceci : pour chaque coordonnée du tableau, elle déplace la tortue une fois vers cette case.
nl: Het is een [code]for[/code]-lus die de schildpad langs het pad laat lopen. De lus werkt als volgt: voor elk stel coördinaten in de array wordt de schildpad één keer naar die cel verplaatst.
tr: Kaplumbağanın yol boyunca yürümesini sağlayan, bir [code]for[/code] döngüsüdür. Döngü şu şekilde çalışır: dizideki her konum için, kaplumbağayı o hücreye taşır.
zh_hans: 下面是一个 [code]for[/code] 循环，使海龟沿着路径移动。 循环的工作方式如下：对于数组中的每个坐标，它会让海龟移动一格。

source: It's the same principle with unit selection.
fr: C'est le même principe avec la sélection des unités.
nl: Hetzelfde principe geldt voor de selectie van spelstukken.
tr: Birimlerin seçiminde de aynı ilke geçerli.
zh_hans: 与选中多个单位的原理是相同的。

source: For each coordinate in an array named [code]selected_units[/code], we check if there is a unit in that cell. If so, we select it. In that case, we use an array, a loop, and a condition together.
fr: Pour chaque coordonnée dans un tableau nommé [code]selected_units[/code], nous vérifions s'il y a une unité dans cette case. Si c'est le cas, nous la sélectionnons. Dans ce cas, nous utilisons ensemble un tableau, une boucle et une condition.
nl: Voor elke coördinaat in een array met de naam [code]selected_units[/code] controleren we of er een spelstuk op die cel staat. Zo ja, dan selecteren we die. In dat geval gebruiken we een array, een lus en een conditie tegelijk.
tr: [code]selected_units[/code] (seçili_birimler) adlı dizideki her konum için, o hücrede bir birimin olup olmadığını kontrol ederiz. Eğer varsa, onu seçeriz. Bu durumda, bir dizi, bir döngü ve bir koşulu birlikte kullanırız.
zh_hans: 对于名为 [code]selected_units[/code] （选中单位）的数组中的每个坐标，我们检查该单元格中是否有一个单元。 如果是这样，选中它。 在这个例子中，会结合使用到数组、循环和条件语句。

source: The code above uses several features you haven't learned yet: - In a condition, the [code]in[/code] keyword allows you to check if a value exists [i]in[/i] an array. - The array's [code]append()[/code] function appends a new value at the end of the array. Notice the use of a period after the [code]selected_units[/code] variable, to call the [code]append()[/code] function. It's because this function exists only on arrays. When functions exist only on a specific value type, you write a dot after the value to call the function on it. We'll revisit those two features again in the following lessons.
fr: Le code ci-dessus utilise plusieurs fonctionnalités que vous n'avez pas encore apprises : - Dans une condition, le mot-clé [code]in[/code] vous permet de vérifier si une valeur existe [i]dans[/i] un tableau. - La fonction [code]append()[/code] du tableau ajoute une nouvelle valeur à la fin du tableau. Remarquez l'utilisation d'un point après la variable [code]selected_units[/code], pour appeler la fonction [code]append()[/code]. C'est parce que cette fonction n'existe que sur les tableaux. Lorsque les fonctions n'existent que sur un type de valeur spécifique, vous écrivez un point après la valeur pour appeler la fonction sur celle-ci. Nous reviendrons sur ces deux fonctionnalités dans les leçons suivantes.
nl: De bovenstaande code gebruikt verschillende functies die je nog niet hebt geleerd: - In een conditie kun je met het sleutelwoord [code]in[/code] controleren of een waarde aanwezig is [i]in[/i] een array. - De functie [code]append()[/code] van de array voegt een nieuwe waarde toe aan het einde van de array. Let op het gebruik van een punt na de variabele [code]selected_units[/code] om de functie [code]append()[/code] aan te roepen. Dat komt omdat deze functie alleen bestaat bij arrays. Wanneer functies alleen bestaan bij een specifiek waardentype, schrijf je een punt achter de waarde om de functie ermee aan te roepen. We zullen deze twee functies opnieuw bekijken in de volgende lessen.
tr: Yukarıdaki kod, henüz öğrenmediğin birkaç özelliği kullanıyor: - Bir koşul yazımında, [code]in[/code] anahtar kelimesi, bir değerin, bir dizinin [i]içinde[/i] var olup olmadığını kontrol etmeni sağlar. - Dizinin [code]append()[/code] üye fonksiyonu, dizinin sonuna yeni bir değer ekler. [code]append()[/code] fonksiyonunu çağırmak için, [code]selected_units[/code] değişkeninden sonra bir nokta kullanıldığına dikkat et. Bunun nedeni, bu fonksiyonun yalnızca dizilerde bulunmasıdır. Fonksiyonlar, eğer yalnızca belirli bir değer tipinde mevcut ise, fonksiyonu bu değer üzerinden çağırmak için, değerden sonra bir nokta yazarsın. Bu iki özelliği, ilerleyen derslerde tekrar gözden geçireceğiz.
zh_hans: 上面的代码使用了几个你还没有学过的特性： - 在条件中，[code]in[/code] 关键字可以检查变量cell的值是否在数组unit里。[i]在···里面（in）[/i] - 数组的 [code]append()[/code] 函数会在数组末尾追加一个新值。 注意在 [code]selected_units[/code] 变量之后使用句点（.）来调用 [code]append()[/code] 函数。 这是因为这个函数只依赖于数组存在。 当函数只在特定的值类型上存在时，你可以在值后面写一个点来调用属于它的函数。 在接下来的课程中，我们会重温这两个功能的。

source: The beauty of loops is that they work regardless of the size of your arrays. The code just works whether you have one or ten thousand units to select. It is all accomplished with only a couple lines of code. That's the power of computer programming. In the following practices, you will use arrays combined with [code]for[/code] loops to achieve similar results.
fr: La beauté des boucles est qu'elles fonctionnent quelle que soit la taille de vos tableaux. Le code fonctionne, que vous ayez une ou dix mille unités à sélectionner. Tout cela est accompli avec seulement quelques lignes de code. C'est la puissance de la programmation informatique. Dans les exercices suivants, vous utiliserez des tableaux combinés avec des boucles [code]for[/code] pour obtenir des résultats similaires.
nl: Het mooie van lussen is dat ze werken ongeacht de grootte van je arrays. De code werkt gewoon, of je nu duizend of tienduizend spelstukken moet selecteren. Dit alles wordt bereikt met slechts een paar regels code. Dat is de kracht van computerprogrammeren. In de volgende oefeningen zul je arrays gebruiken in combinatie met [code]for[/code]-lussen om vergelijkbare resultaten te bereiken.
tr: Döngülerin güzelliği, dizilerinizin boyutundan bağımsız olarak çalışmasıdır. Kod, seçilecek bir veya on bin birimin olsa da çalışır. Tüm bunlar sadece birkaç satır kod ile gerçekleştirilir. Bu bilgisayar programcılığının gücüdür. Sıradaki alıştırmalarda, benzer sonuçlar elde etmek için, [code]for[/code] döngüleriyle birlikte dizileri kullanacaksın.
zh_hans: 循环的美妙之处在于，无论数组大小如何，它都可以工作。 无论是要选择一个单位还是一万个单位，该代码都可以正常工作。 都只需要这几行代码即可完成。 这就是计算机编程的力量。 在下面的练习中，你要用数组结合 [code]for[/code] 循环来实现类似的结果。

source: Move the robot along the path
fr: Déplacer le robot le long du chemin
nl: Beweeg de robot langs het pad
tr: Robotu , verilen yol boyunca hareket ettir
zh_hans: 沿路径移动机器人

source: Our AI pathfinding algorithm provided a path for the robot to move to the right edge of the grid. Your task is to use a [code]for[/code] loop to make the robot move. To move the robot, call [i]its[/i] [code]move_to()[/code] function, like so: [code]robot.move_to()[/code]. The [code]move_to()[/code] function only exists on the robot, which is why you need to access it this way.
fr: Notre algorithme de recherche de chemin de l'IA a fourni un chemin pour que le robot se déplace vers le bord droit de la grille. Votre tâche consiste à utiliser une boucle [code]for[/code] pour faire bouger le robot. Pour déplacer le robot, appelez [i]sa[/i] fonction [code]move_to()[/code], comme suit : [code]robot.move_to()[/code]. La fonction [code]move_to()[/code] n'existe que sur le robot, c'est pourquoi vous devez y accéder de cette façon.
nl: Ons AI-padzoekalgoritme heeft de robot een pad gegeven naar de rechterrand van het rooster. Jouw taak is om een [code]for[/code]-lus te gebruiken om de robot te laten bewegen. Om de robot te verplaatsen, roep je [i]zijn[/i] functie [code]move_to()[/code] aan, op deze manier: [code]robot.move_to()[/code]. De functie [code]move_to()[/code] bestaat alleen bij de robot, daarom moet je hem op deze manier gebruiken.
tr: Yapay zeka yol bulma algoritmamız, robotun ızgaranın sağ kenarına gitmesi için bir yol verdi. Senin görevin, robotu hareket ettirmek için bir [code]for[/code] döngüsü kullanmak. Robotu hareket ettirmek için, onun [i]kendi[/i] [code]move_to()[/code] fonksiyonunu şu şekilde çağır: [code]robot.move_to()[/code]. [code]move_to()[/code] fonksiyonu sadece robot üzerinde mevcuttur, bu yüzden bu şekilde erişmen gerekiyor.
zh_hans: 我们的 AI 寻路算法为机器人移动到网格的右边提供了一条路径。 你的任务是使用 [code]for[/code] 循环使机器人移动。 要移动机器人，请调用[i]它的[/i] [code]move_to()[/code] 函数，如下所示：[code]robot.move_to()[/code]。 此处的 [code]move_to()[/code] 函数仅存在于机器人上，这就是需要以这种方式访问它的原因。

source: Our AI pathfinding algorithm is giving us a path to move the robot. Now, you need to make the turtle move along the path.
fr: Notre algorithme de recherche de chemin de l'IA nous donne un chemin pour déplacer le robot. Maintenant, vous devez faire en sorte que la tortue se déplace le long du chemin.
nl: Ons AI-padzoekalgoritme geeft ons een pad om de robot langs te bewegen. Nu moet je de schildpad langs het pad laten bewegen.
tr: Yapay zeka yol bulma algoritmamız bize robotu hareket ettirmek için bir yol verdi. Şimdi, kaplumbağayı, bu yol boyunca hareket ettirmen gerekiyor.
zh_hans: 我们的 AI 寻路算法为我们提供了移动机器人的路径。 现在，你需要让小海龟沿着路径移动。

source: Back to the drawing board
fr: Retour à la planche à dessin
nl: Terug naar de tekentafel
tr: Çizim tahtasına geri dönüş
zh_hans: 回到那个绘图板上

source: We want to draw many rectangles, something surprisingly common in games. However, writing this code by hand can get tedious. Instead, you could store the size of your shapes in arrays and use a loop to draw them all in batches. That's what you'll do in this practice. Use a [code]for[/code] loop to draw every rectangle in the [code]rectangle_sizes[/code] array with the [code]draw_rectangle()[/code] function. The rectangles shouldn't overlap or cross each other. To avoid that, you'll need to call the [code]jump()[/code] function.
fr: Nous voulons dessiner de nombreux rectangles, ce qui est étonnamment courant dans les jeux. Cependant, écrire ce code à la main peut devenir fastidieux. Au lieu de cela, vous pourriez stocker la taille de vos formes dans des tableaux et utiliser une boucle pour les dessiner toutes par lots. C'est ce que vous allez faire dans cet exercice. Utilisez une boucle [code]for[/code] pour dessiner chaque rectangle du tableau [code]rectangle_sizes[/code] avec la fonction [code]draw_rectangle()[/code]. Les rectangles ne doivent pas se chevaucher ou se croiser. Pour éviter cela, vous devrez appeler la fonction [code]jump()[/code].
nl: We willen veel rechthoeken tekenen, iets wat verrassend vaak voorkomt in spellen. Deze code met de hand schrijven kan echter snel vervelen. In plaats daarvan kun je de grootte van je vormen opslaan in arrays en een lus gebruiken om ze allemaal in een keer te tekenen. Dat is wat je in deze oefening zult doen. Gebruik een [code]for[/code]-lus om elke rechthoek in de array [code]rectangle_sizes[/code] te tekenen met de functie [code]draw_rectangle()[/code]. De rechthoeken mogen elkaar niet overlappen of kruisen. Om dat te vermijden, moet je de functie [code]jump()[/code] aanroepen.
tr: Oyunlarda, şaşırtıcı derecede yaygın olan, çok sayıda dikdörtgen çizmek istiyoruz. Ancak bu kodu elle yazmak sıkıntılı olabilir. Bunun yerine, şekillerinin boyutlarını dizilerde saklayabilir, ve hepsini toplu olarak çizmek için bir döngü kullanabilirsin. Bu uygulamada yapacağın şey tam da bu. [code]draw_rectangle()[/code] fonksiyonu ile [code]rectangle_sizes[/code] dizisindeki her bir dikdörtgeni çizmek için bir [code]for[/code] döngüsü kullan. Dikdörtgenler üst üste gelmemeli veya birbirini kesmemelidir. Bunu önlemek için [code]jump()[/code] fonksiyonunu da çağırman gerek. (Ayrıca, Vector2'nin x ve y değerlerini tuttuğunu hatırla).
zh_hans: 我们想要绘制许多矩形，这在游戏中非常常见。 但是，手动编写此代码可能会很乏味。 相反，你可以将形状的大小存储在数组中，并使用循环批量绘制它们。 这就是你在这个练习中要做的。 使用 [code]for[/code] 循环通过 [code]draw_rectangle()[/code] （画长方形）函数绘制 [code]rectangle_sizes[/code] （长方形尺寸）数组中的每个矩形。 矩形不能相互重叠或者交叉。 为避免这种情况，你需要调用 [code]jump()[/code] （让海龟跳走）函数。

source: The drawing turtle makes its comeback. Fear not! Armed with loops, you'll make it draw faster than ever before.
fr: La tortue dessinatrice fait son grand retour. N'ayez pas peur ! Armé(e) de boucles, vous allez la faire dessiner plus vite que jamais.
nl: De tekenschildpad is weer terug. Vrees niet! Gewapend met lussen kun je hem sneller dan ooit laten tekenen.
tr: Çizim kaplumbağası aramıza dönüyor. Ama korkma! Döngülerle donanmış olarak, her zamankinden daha hızlı çizmesini sağlayacaksın.
zh_hans: 绘图小海龟卷土重来。 不要害怕！ 装备循环这个新武器，你将能让它的绘制速度比以往任何时候都快。

source: Looping over arrays
fr: Faire des boucles sur des tableaux
nl: Door arrays heen stappen
tr: Diziler üzerinde döngü kurmak
zh_hans: 用循环遍历数组
