Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-6-multiple-function-parameters.po
Languages: da, hu, pl, sk, sv, tr, uk, zh_hans

source: Many programmers do either or both of the above.
da: Mange programmører gør en eller begge af ovenstående.
hu: Sok programozó használja vagy az egyiket, vagy mindkettőt.
sk: Mnohí programátori robia jednu z týchto možností alebo obe.
tr: Birçok programcı bunların ikisini de yapıyor.
uk: Багато програмістів вибирають один або обидва зі згаданих вище варіантів.

source: At GDQuest, we favor complete and explicit names.
da: Hos GDQuest foretrækker vi komplette og eksplicitte navne.
hu: A GDQuestnél, mi a teljes, kifejező neveket részesítjük előnyben.
sk: V GDQuest uprednostňujeme úplné a explicitné názvy.
tr: GDQuest'te, bütün ve belirgin isimler tercih ederiz.
uk: У GDQuest ми надаємо перевагу повним і ясним назвам.

source: We generally try to write code that is explicit and relatively easy to read.
da: Vi forsøger generelt at skrive kode, der er eksplicit og relativt let at læse.
hu: Általában olyan kódot próbálunk írni, ami kifejező és viszonylag könnyen olvasható.
sk: Vo všeobecnosti sa snažíme písať kód, ktorý je explicitný a relatívne ľahko čitateľný.
tr: Genel olarak, yazdığımız kodun belirgin ve okuması kolay olması için çabalarız
uk: Зазвичай ми намагаємося писати зрозумілий і відносно легко прочитний код.

source: Right now, you have to enter every letter when you code, so long names may feel inconvenient.
da: Lige nu skal du indtaste hvert bogstav, når du koder, så lange navne kan føles ubelejlige.
hu: Jelenleg, minden betűt le kell írnod, szóval a hosszab nevek kényelmetlennek tűnhetnek.
sk: Práve teraz musíte pri kódovaní zadávať každé písmeno, takže dlhé názvy vám môžu pripadať nepohodlné.
tr: Şu an için, kodlama yaparken, her harfi tek tek girmeniz gerekiyor, ve uzun isimler biraz zahmetli gelebilir.
uk: Зараз при написанні коду вам доводиться вводити кожну букву, тому довгі назви можуть здатися незручними.

source: However, this is good for learning: it trains your fingers to [ignore]type precisely.
da: Dette er dog godt til læring: det træner dine fingre til at skrive præcist.
hu: Azonban, ez jó a tanuláshoz: megtanítja az ujjaid pontosan gépelni.
sk: Je to však dobré na učenie: trénuje to vaše prsty na presné [ignore] písanie.
tr: Ancak bu, öğrenmek için çok iyidir: parmaklarınızı, kusursuz kesinlikte yazabilmek için eğitmeye yarar.
uk: Однак це корисно для навчання: це тренує ваші пальці [ignore]друкувати точніше.

source: Then, after you finish this course, you will see that the computer assists you a lot when you code real games with a feature called auto-completion.
da: Når du er færdig med dette kursus, vil du se, at computeren hjælper dig meget, når du koder rigtige spil med en funktion kaldet automatisk fuldførelse.
hu: ha már befejezted ezt a kurzust, aakkor látni fogod, hogy a számítógép sokat segít a játékok elkészítésében egy auto-complete nevű funkciónak köszönhetően.
sk: Potom, keď dokončíte tento kurz, uvidíte, že počítač vám pri kódovaní skutočných hier veľmi pomáha pomocou funkcie nazývanej automatické dokončovanie.
tr: Ayrıca, bu kursu bitirdikten sonra göreceksiniz, gerçek oyunlar kodlarken bilgisayar size, kendi-tamamlama (auto-complete) özelliği ile yardımcı olur.
uk: Пізніше, по закінченні цього курсу, ви побачите, що комп'ютер дуже допомагає вам при програмуванні реальних ігор завдяки функції, яку називають автодоповненням.

source: Based on a few characters you [ignore]type, it will offer you to complete long names.
da: Baseret på et par tegn, du skriver, vil den tilbyde dig at fuldføre lange navne.
hu: Az első néhány karakter begépelése után fel fogja ajánlani a változó név befejezését.
sk: Na základe niekoľkých znakov, ktoré [ignore]zadáte, vám ponúkne dokončenie dlhých názvov.
tr: Siz birkaç karakter yazınca, tamamlayabileceği uzun isimlerin listesini seçmeniz için gösterir.
uk: На основі кількох [ignore]надрукованих символів, він пропонуватиме вам варіанти закінчення довгих назв.

source: When defining a function, parameters are...
da: Når du definerer en funktion, er parametre...
hu: Függvény deklarálásakor a paraméterek...
pl: Podczas definiowania funkcji parametry są…
sk: Keď definujete funkciu parametre sú...
sv: När du definierar en funktion är parametrarna...
tr: Bir fonksiyon tanımlarken, alınan değişkenler...
uk: При визначенні функції параметри...
zh_hans: 定义函数时，参数...

source: You can define functions with or without parameters, depending on your needs.
da: Du kan definere funktioner med eller uden parametre, afhængigt af dine behov.
hu: Függvényeket paraméterekkel és azok nélkül is létrehozhatsz, az igényeidnek megfelelően.
pl: Możesz zdefiniować funkcje zarówno z parametrami lub bez nich - wszystko zależy od twoich potrzeb.
sk: Podľa potreby môžete definovať funkcie s parametrami alebo bez nich.
sv: Du kan definiera funktioner med eller utan parametrar, beroende på dina behov.
tr: İhtiyacına bağlı olarak, fonksiyon tanımlarında alınan değişkenleri kullanırsınız ya da kullanmazsınız.
uk: Ви можете оголошувати функції з параметрами або без них, залежно від ваших потреб.
zh_hans: 您可以根据需要定义带或不带参数的函数。

source: Optional
da: Valgfrit
hu: ...opcionálisak
pl: Opcjonalne
sk: Voliteľné
sv: Valfri
tr: İsteğe bağlıdır
uk: Необов'язкові
zh_hans: 可选

source: Mandatory
da: Obligatorisk
hu: ...kötelezőek
pl: Obowiązkowe
sk: Povinné
sv: Obligatorisk
tr: Zorunludur
uk: Обов'язкові
zh_hans: 强制的

source: What's the correct syntax to define a function with multiple parameters?
da: Hvad er den korrekte syntaks for at definere en funktion med flere parametre?
hu: Mi a megfelől szintaktika egy több paraméterrel rendelkező függvény létrehozásakor?
pl: Która składnia do zdefiniowania funkcji z wieloma parametrami jest poprawna?
sk: Aká je správna syntax na definovanie funkcie s viacerými parametrami?
sv: Vad är rätt syntax för att definiera en funktion med flera parametrar?
tr: Birden fazla alınan değişkeni olan bir fonksiyon tanımlamanın doğru yazım şekli nedir?
uk: Який синтаксис використовують для оголошення функції з кількома параметрами?
zh_hans: 定义具有多个参数的函数的正确语法是什么？

source: You always write the function parameters inside of the parentheses. To define multiple parameters, you separate them with a comma.
da: Du skriver altid funktionsparametrene inde i parentes. Hvis du vil definere flere parametre, kan du adskille dem med en komma.
hu: A függvény paraméterei mindig a zárójelbe kerülnek. Több paraméter megadásakor vesszővel kell őket elválasztani.
pl: Parametry funkcji zawsze wpisujesz w nawiasach. Aby zdefiniować wiele parametrów, musisz oddzielić je przecinkami.
sk: Parametre funkcie sa vždy zapisujú do zátvoriek. Ak chcete definovať viacero parametrov, oddeľte ich čiarkou.
sv: Du skriver alltid funktionsparametrarna inom parentes. För att definiera flera parametrar separerar du dem med ett kommatecken.
tr: Fonkiyonun alınan değişkenlerini, her zaman parantez içerisinde yazarsınız. Birden çok alınan değer tanımlamak için de bunları virgül ile ayırırsınız.
uk: Параметри функції завжди пишуть у круглих дужках. Щоб задати кілька параметрів, відокремлюйте їх комою.
zh_hans: 您总是将函数参数写在括号内。 要定义多个参数，请用逗号分隔它们。

source: Now it's your turn to create a function with multiple parameters.
uk: Тепер ваша черга створити функцію з кількома параметрами.

source: In the following practices, you'll write functions that I will call with different values. Your functions need to work correctly no matter what values the app passes to them.
uk: У наступних вправах ви будете писати функції, які я буду викликати з різними значеннями. Ваші функції повинні працювати коректно незалежно від того, які значення їм передає програма.

source: Drawing corners of different sizes
da: Tegning af hjørner af forskellige størrelser
hu: Különböző méretű sarkok rajzolása
pl: Rysowanie rogów o różnych rozmiarach
sk: Kreslenie rohov rôznych veľkostí
sv: Rita hörn av olika storlekar
tr: Farklı boyutlarda köşeler çizmek
uk: Малювання кутів зі сторонами різних розмірів
zh_hans: 绘制不同大小的角

source: Before we create a rectangle of any size, let's first practice with a simpler shape.
uk: Перш ніж створювати прямокутник будь-якого розміру, давайте спочатку потренуємося з більш простою фігурою.

source: I will call your function twice with different values:
uk: Я двічі викличу вашу функцію з різними значеннями:

source: Your task is to add a parameter named [code]length[/code] to your function definition. This creates a placeholder. When the app calls your function, the placeholder will get replaced with the value in parentheses.
uk: Ваше завдання полягає в тому, щоб додати параметр з назвою [code]length[/code] до визначення вашої функції. Це створить замінник. Коли програма викличе вашу функцію, замінник буде замінений значенням у дужках.

source: Your function should move the turtle forward by an amount defined by the [code]length[/code] parameter, turn right [code]90[/code] degrees, then move forward by [code]length[/code] again.
uk: Ваша функція повинна перемістити черепашку вперед на відстань, визначену параметром [code]length[/code], повернути праворуч на [code]90[/code] градусів, а потім знову перемістити вперед на [code]length[/code].

source: Each time the app calls your function, [code]length[/code] will be replaced with a different value: first [code]240[/code], then [code]120[/code].
uk: Щоразу, коли програма викликає вашу функцію, [code]length[/code] буде замінено іншим значенням: спочатку [code]240[/code], потім [code]120[/code].

source: Using function parameters, code a function you can reuse to draw corners with lines of varying sizes.
da: Brug funktionsparametre til at kode en funktion, som du kan genbruge til at tegne hjørner med linjer af varierende størrelser.
hu: Függvény paraméterek használatával írj egy függvényt, amit újrafelhasználhatsz sarkok rajzolására.
pl: Używając parametrów funkcji, zakoduj funkcję, której będziesz mógł użyć ponownie do narysowania rogów z wykorzystaniem linii o różnych długościach.
sk: Pomocou parametrov funkcie nakódujte funkciu, ktorú môžete opakovane použiť na kreslenie rohov s čiarami rôznych veľkostí.
sv: Använd funktionsparametrar och koda en funktion som du kan återanvända för att rita hörn med linjer av varierande storlek.
tr: Fonksiyonun alınan değişkenlerini kullanarak, değişen boylarda çizgiler kullanarak bir köşe çizebilen bir fonksiyon kodlayın.
uk: Використовуючи параметри функції, створіть функцію, яку можна використовувати для малювання кутів зі сторонами різних розмірів.
zh_hans: 使用函数参数，编写一个函数，您可以重复使用以绘制不同大小的线的角。

source: Using multiple parameters
da: Brug af flere parametre
hu: Több paraméter használata
pl: Używanie kilku parametrów
sk: Použitie viacerých parametrov
sv: Använder flera parametrar
tr: Birden çok alınan değişken kullanmak
uk: Використання кількох параметрів
zh_hans: 使用多个参数

source: Now let's make the [code]draw_corner()[/code] function even more flexible. We'll add a second placeholder so the angle can also vary.
uk: Тепер зробимо функцію [code]draw_corner()[/code] ще більш гнучкою. Ми додамо другий заповнювач, щоб кут також міг змінюватися.

source: I will call your function with different length and angle values:
uk: Я викличу вашу функцію з різними значеннями довжини та кута:

source: Your task is to add the [code]angle[/code] parameter after [code]length[/code] in the function definition. Remember to separate the two placeholders with a comma.
uk: Ваше завдання полягає в тому, щоб додати параметр [code]angle[/code] після [code]length[/code] у визначенні функції. Не забудьте розділити два заповнювачі комою.

source: Remember: When the app calls [code]draw_corner(240, 45)[/code], the parameter [code]length[/code] will get replaced with [code]240[/code] and [code]angle[/code] will get replaced with [code]45[/code].
uk: Пам'ятайте: коли програма викликає [code]draw_corner(240, 45)[/code], параметр [code]length[/code] буде замінений на [code]240[/code], а [code]angle[/code] — на [code]45[/code].

source: With two parameters, code a function to draw corners with any angle.
da: Med to parametre skal du kode en funktion til at tegne hjørner med en hvilken som helst vinkel.
hu: Készíts egy függvényt két paraméter használatával, ami bármilyen szögben álló sarkot tud rajzolni.
pl: Używając dwóch parametrów zakoduj funkcję do rysowania rogów o dowolnym kącie.
sk: S dvoma parametrami nakódujte funkciu na vykresľovanie rohov s ľubovoľným uhlom.
sv: Med två parametrar, koda en funktion för att rita hörn med valfri vinkel.
tr: İki tane alınan değişken kullanarak, herhangi bir açıda köşe çizen bir fonksiyon kodlayın.
uk: Напишіть функцію для малювання кутів будь-якої величини за допомогою двох параметрів.
zh_hans: 使用两个参数，编写一个函数来绘制任意角度的角。

source: Drawing squares of any size
da: Tegne firkanter af enhver størrelse
hu: Tetszőleges méretű négyzetek rajzolása
pl: Rysowanie kwadratów o dowolnym rozmiarze
sk: Kreslenie štvorcov ľubovoľnej veľkosti
sv: Rita rutor av alla storlekar
tr: Herhangi bir boyda kareler çizmek
uk: Малювання квадратів будь-якого розміру
zh_hans: 绘制任意大小的正方形

source: Time to write a complete function from scratch! You'll make a function that draws squares of any size.
uk: Час написати повну функцію з нуля! Ви створите функцію, яка малює квадрати будь-якого розміру.

source: I will call your function with different sizes:
uk: Я викличу вашу функцію з різними розмірами:

source: Write a function named [code]draw_square()[/code] with one parameter called [code]length[/code]. Remember, this parameter is a placeholder that gets filled with the actual value when the function is called.
uk: Напишіть функцію з назвою [code]draw_square()[/code] з одним параметром під назвою [code]length[/code]. Пам'ятайте, що цей параметр є місцем для заповнення, яке заповнюється фактичним значенням під час виклику функції.

source: Your function needs to move forward by [code]length[/code], turn right 90 degrees, and do this four times to complete all four sides of the square.
uk: Ваша функція повинна рухатися вперед на [code]length[/code], повернути праворуч на 90 градусів і повторити це чотири рази, щоб пройти всі чотири сторони квадрата.

source: [b]Important:[/b] When the turtle finishes drawing, it should face right. So you need to turn right a total of four times.
uk: [b]Важливо:[/b] Коли черепашка закінчить малювати, вона повинна бути обернена вправо. Тому вам потрібно повернути вправо в цілому чотири рази.

source: In the previous lesson, your function would draw squares of a fixed size. Using a parameter, code a function to draw squares of any size.
da: I den forrige lektion ville din funktion tegne firkanter af en fast størrelse. Brug en parameter til at kode en funktion til at tegne firkanter af en hvilken som helst størrelse.
hu: Az előző leckében a függvényed fix oldalhosszúságú négyzeteket rajzolt. Paraméter használatával, készíts egy függvényt tetszőleges méretű négyzet rajzolásához.
pl: W poprzedniej lekcji twoja funkcja rysowała kwadraty o ustalonym rozmiarze. Używając parametru, zakoduj funkcję rysującą kwadraty o dowolnym rozmiarze.
sk: V predchádzajúcej lekcii vaša funkcia kreslila štvorce pevnej veľkosti. Pomocou parametra nakódujte funkciu, ktorá bude kresliť štvorce ľubovoľnej veľkosti.
sv: I föregående lektion ritade din funktion rutor med en fast storlek. Använd en parameter och koda en funktion för att rita kvadrater av valfri storlek.
tr: Önceki derste, fonksiyonun sabit boyda kareler çizdirmişti. Alınan değişkenleri kullanarak, her boyda kareler çizdiren bir fonksiyon kodlayın.
uk: У попередньому уроці ваша функція малювала квадрати фіксованого розміру. Скориставшись параметром, напишіть функцію для малювання квадратів будь-якого розміру.
zh_hans: 在上一课中，您的函数将绘制固定大小的正方形。 使用一个参数，编写一个函数来绘制任意大小的正方形。

source: Drawing rectangles of any size
da: Tegning af rektangler i enhver størrelse
hu: Tetszőleges méretű téglalpok rajzolása
pl: Rysowanie prostokątów o dowolnych rozmiarach
sk: Kreslenie obdĺžnikov ľubovoľnej veľkosti
sv: Rita rektanglar av alla storlekar
tr: Her boyda dikdörtgenler çizmek
uk: Малювання прямокутників будь-якого розміру
zh_hans: 绘制任意大小的矩形

source: Let's create a function to draw rectangles with any length and height.
uk: Створимо функцію для малювання прямокутників будь-якої довжини та висоти.

source: I will call your function twice with different sizes:
uk: Я двічі викличу вашу функцію з різними розмірами:

source: Your function needs two parameters: [code]length[/code] and [code]height[/code]. When the app calls your function, the first number replaces [code]length[/code], and the second number replaces [code]height[/code].
uk: Ваша функція потребує двох параметрів: [code]length[/code] та [code]height[/code]. Коли програма викликає вашу функцію, перше число замінює [code]length[/code], а друге число замінює [code]height[/code].

source: Use [code]length[/code] when you move horizontally and [code]height[/code] when you move vertically.
uk: Використовуйте [code]length[/code] при горизонтальному переміщенні та [code]height[/code] при вертикальному переміщенні.

source: This is the pattern you need to follow: move forward by [code]length[/code], turn right, move forward by [code]height[/code], turn right, then repeat this sequence once more.
uk: Ось схема, якої потрібно дотримуватися: рухайтеся вперед на [code]length[/code], поверніть праворуч, рухайтеся вперед на [code]height[/code], поверніть праворуч, а потім повторіть цю послідовність ще раз.

source: [b]Important:[/b] When the turtle finishes drawing, it should face right. Make sure you turn right four times in total.
uk: [b]Важливо:[/b] Коли черепашка закінчить малювати, вона повинна стояти обличчям вправо. Переконайтеся, що ви повернули вправо в цілому чотири рази.

source: With one parameter, you can make squares of any size. With two, you can draw any rectangle! You'll do so in this practice.
da: Med én parameter kan du lave firkanter i enhver størrelse. Med to kan du tegne ethvert rektangel! Det skal du gøre i denne øvelse.
hu: Egy paraméterrel bármekkora négyzetet rajzolhatsz. Két paraméterrel már bármilyen téglalapot! Így is fogsz tenni ebben a gyakorlatban.
pl: Z jednym parametrem możesz stworzyć kwadraty o dowolnym rozmiarze. Za pomocą dwóch parametrów możesz narysować dowolny prostokąt! To właśnie zrobisz w tym ćwiczeniu.
sk: Pomocou jedného parametra môžete vytvoriť štvorce ľubovoľnej veľkosti. S dvoma parametrami môžete nakresliť ľubovoľný obdĺžnik! Urobíte tak v tomto cvičení.
sv: Med en parameter kan du göra rutor av vilken storlek som helst. Med två kan du rita vilken rektangel som helst! Du kommer att göra det i den här övningen.
tr: Tek bir alınan değişken ile, her boyda kareler yapabilirsiniz. İki tanesi ile, dikdörtgenler çizebilirsiniz! Bu alıştırmada bunu yapacaksınız.
uk: Один параметр дає змогу малювати квадрати будь-якого розміру. Два параметри дають змогу намалювати будь-який прямокутник! Цим ви займетеся в цій вправі.
zh_hans: 使用一个参数，您可以制作任意大小的正方形。 有了两个，您可以绘制任何矩形！ 您将在本练习中这样做。

source: Your First Function Parameter
da: Din Første Funktionsparameter
hu: Az első függvény paramétered
pl: Twój pierwszy parametr funkcji
sk: Váš prvý parameter funkcie
sv: Din första funktionsparameter
tr: İlk Fonksiyon Alınan Değişkenin (Parametre)
uk: Ваш перший параметр функції
zh_hans: 您的第一个函数参数

source: In previous lessons, you used the [code]rotate()[/code] function and gave it an [i]argument[/i].
hu: Az előző leckékben a [code]rotate()[/code] függvényt használtad, egy [i]parameter[/i] megadásával.

source: Just like [code]rotate()[/code], we can also give our function [i]parameters[/i]. Parameters are labels you give to values passed to the function.
hu: A [code]rotate()[/code] függvényhez hasonlóan, a saját függvényeinkenk is adhatunk [i]paramétereket[/i]. A paraméterek olyan címkék, amiket a függvénynek átadott változókra ragasztasz.
pl: Podobnie jak w przypadku [code]rotate()[/code], my również możemy podawać naszej funkcji [i]parametry[/i]. Parametry to etykiety, które nadajemy wartościom przekazywanym do funkcji.
sk: Rovnako ako [code]rotate()[/code], môžeme našej funkcii zadať [i]parameters[/i]. Parametre sú označenia, ktoré dávate hodnotám odovzdaným funkcii.
sv: Precis som [code]rotate()[/code] kan vi också ge vår funktion [i]parametrar[/i]. Parametrar är etiketter du ger till värden som skickas till funktionen.
zh_hans: 就像 [code]rotate()[/code] 一样，我们也可以给我们的函数 [i]parameters[/i]。 参数是您赋予传递给函数的值的标签。

source: The [code]radians[/code] can be a positive or negative number, which allows you to rotate both clockwise and counter-clockwise.
hu: A [code] radián[/code] lehet pozitív és negatív szám is, így az óramutató járásával megegyezően és azzal ellenkezőleg is forgathatsz.
pl: Wartość podawana w radianach ([code]radians[/code]) może być zarówno liczbą dodatnią, jak i ujemną, co umożliwia nam obracanie zarówno zgodnie z ruchem wskazówek zegara, jak i przeciwnie do ruchu wskazówek zegara.
sk: [code]radians[/code] môže byť kladné alebo záporné číslo, čo umožňuje otáčanie v smere aj proti smeru hodinových ručičiek.
sv: [code]radianer[/code] kan vara ett positivt eller negativt tal, vilket gör att du kan rotera både medurs och moturs.
zh_hans: [code]radians[/code] 可以是正数或负数，它允许您顺时针和逆时针旋转。

source: For now, please focus on the first line: [code]func rotate(radians)[/code].
hu: Egyelőre koncentrálj az első sorra: [code]func rotate(radians)[/code].
sk: Teraz sa prosím zamerajte na prvý riadok: [code]func rotate(radians)[/code].

source: When you call [code]rotate(0.5)[/code], the computer binds the value [code]0.5[/code] to the label [code]radians[/code].
hu: Amikor hívod a [code]rotate(0.5)[/code] függvényt, a számítógép hozzárendeli a [code]0.5[/code] értéket a [code]radians[/code] címkéhez.
sk: Keď použijete [code]rotate(0.5)[/code], počítač priradí hodnotu [code]0.5[/code] k označeniu [code]radians[/code].

source: Wherever the computer sees the identifier [code]radians[/code] inside the function, it replaces it with the [code]0.5[/code] value.
hu: Ezután, ha a számítógép bárhol találkozik a függvényben a [code]radians[/code] címkével, lecseréli azt a [code]0.5[/code] értékre.
sk: Všade, kde počítač vidí vo vnútri funkcie identifikátor [code]radians[/code], nahradí ho hodnotou [code]0,5[/code].

source: The parameter name is always a label you use to refer to a [i]value[/i]. The value in question can be a number, text, or anything else.
hu: A paraméter neve mindig egy címke, amivel az [i]értékre[/i] hivatkozol. A kérdéses érték lehet szám, szöveg és még sok más is.
sk: Názov parametra je vždy označenie, ktoré používate na odkazovanie na [i]hodnotu[/i]. Daná hodnota môže byť číslo, text alebo čokoľvek iné.

source: For now, we'll stick to numbers as we have yet to see other value types.
hu: Egyelőre, a szémoknál maradunk, mert más változótípusokkal még nem találkoztunk.
sk: Zatiaľ zostaneme pri číslach, pretože s inými typmi hodnôt sme sa ešte nestretli.

source: A parameter is a label that represents a value.
hu: A paraméter egy címke, ami az értéket képviseli.
sk: Parameter je označenie, ktoré predstavuje hodnotu.

source: The value in question can change: it depends on what you put in parentheses when calling a function.
hu: A kérdéses érték változhat: attól függ, hogy mit írsz a zárójelbe, amikor hívod a függvényt.
sk: Daná hodnota sa môže meniť: závisí od toho, čo ste pri použití funkcie vložili do zátvoriek.

source: You can give your function parameters when writing its [i]definition[/i] (the line starting with the [code]func[/code] keyword).
hu: Adhatsz a függvényednek paramétereket, amikor [i]deklarálod[/i] azt (a [code]func[/code] kulcsszóval kezdődő sorban).
sk: Parametre funkcie môžete zadať pri písaní jej [i]definície[/i] (riadok začínajúci kľúčovým slovom [code]func[/code]).

source: To do so, you add a name inside of the parentheses.
hu: Ehhez, adj meg egy nevet a zárójelben.
sk: Urobíte to tak, že do zátvoriek pridáte názov.
