Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-17-while-loops.po
Languages: ja, nl, pt, pt_br, ru, tr, zh_hans

source: You've seen that you can use functions to [i]reuse[/i] code. In this lesson, you'll learn about [b]loops[/b]. Loops help you [i]repeat[/i] code. To illustrate how loops work, let's take a game board split into a grid. Our robot can move to neighboring cells by changing a [code]Vector2[/code] variable named [code]cell[/code]. It represents the current cell the robot is in. When we increase [code]cell.x[/code], the robot moves to the right. Note that we delay the robot's movement in the app to help you visualize how it moves. The following code would normally move the robot instantly.
ja: 関数を使用してコードを[i]再利用[/i]できることを見てきました。このレッスンでは、[b]ループ[/b]について学習します。ループは、コードを[i]繰り返す[/i]のに役立ちます。 ループがどのように機能するかを説明するために、グリッドに分割されたゲームボードを見てみましょう。 ロボットは、[code]cell[/code] という名前の [code]Vector2[/code] 変数を変更することで、隣接するセルに移動できます。これは、ロボットが現在いるセルを表します。 [code]cell.x[/code] を増やすと、ロボットは右に移動します。 アプリ内でロボットの動きを遅らせて、ロボットの動きを視覚化することに注意してください。次のコードは、通常、ロボットを瞬時に動かします。
nl: Je hebt gezien dat je functies kunt gebruiken om code te [i]hergebruiken[/i]. In deze les leer je over [b]lussen[/b]. Lussen helpen je om code te [i]herhalen[/i]. Om te laten zien hoe lussen werken, nemen we een bord dat is opgedeeld door een raster. Onze robot kan naar naburige cellen bewegen door een [code]Vector2[/code] variabele genaamd [code]cell[/code] te bewerken. Deze vertegenwoordigt het huidige vakje waar de robot zich bevindt. Wanneer we [code]cell.x[/code] verhogen, beweegt de robot naar rechts. Merk op dat we de beweging van de robot in de app vertragen om je te helpen te zien hoe hij beweegt. De volgende code zou de robot normaal gesproken onmiddellijk verplaatsen.
pt_br: Você viu que você pode usar funções para [i]reutilizar[/i] código. Nessa lição, você vai aprender sobre [b]loops[/b]. Loops ajudam você a [i]repetir[/i] código. Para ilustrar como os loops funcionam, vamos pegar um jogo de tabuleiro dividido em uma grade. Nosso robô pode se mover para células vizinhas alterando uma variável do tipo [code]Vector2[/code] chamada [code]cell[/code]. Ela representa a célula atual que se encontra nosso robô. Quando aumentamos [code]cell.x[/code], o robô se move para a direita. Observe que atrasamos o movimento do robô aqui no aplicativo para te ajudar a visualizar como ele se move. Normalmente, o código a seguir moveria o robô instantaneamente.
ru: Вы видели, что функции можно использовать для [i]повторного использования[/i] кода. В этом уроке вы узнаете о [b]циклах[/b]. Циклы помогают вам [i]повторять[/i] выполнение кода. Чтобы проиллюстрировать работу циклов, рассмотрим игровую доску, разбитую на сетку. При изменении переменной [code]Vector2[/code] с именем [code]cell[/code], наш робот перемещается на соседние клетки. Переменная представляет текущую ячейку, в которой находится робот. Когда мы увеличиваем [code]cell.x[/code], робот перемещается вправо. Обратите внимание, что мы задерживаем движение робота в приложении, чтобы помочь вам наглядно увидеть, как он движется. Приведённый ниже код обычно перемещает робота мгновенно.
tr: Fonksiyonları, kodunu [i]yeniden kullanmak[/i] için kullanabileceğini gördün. Bu derste, [b]döngüler[/b] hakkında bilgi edineceksin. Döngüler, kodunu [i]tekrarlamana[/i] yardımcı olur. Döngülerin nasıl çalıştığını göstermek için, ızgaraya bölünmüş bir oyun tahtasını ele alalım. Robotumuz, hücre, [code]cell[/code], isimli bir [code]Vector2[/code] değişkenini değiştirerek komşu hücrelere geçebilir. Bu, robotun içinde bulunduğu mevcut hücreyi temsil eder. [code]cell.x[/code] değerini arttırdığımızda robot sağa doğru hareket eder. Nasıl hareket ettiğini görselleştirmene yardımcı olmak için uygulamada robotun hareketini yavaşlattığımızı unutma. Aşağıdaki kod normalde robotu anında hareket ettirecektir.
zh_hans: 你已经看过可以使用函数来[i]复用[/i]代码。在本课中，你将了解 [b]循环[/b]（loops）。循环帮助你[i]重复执行[/i]代码。 为了说明循环是如何工作的，让我们将游戏场景分成小格子。 我们的机器人可以通过更改名为 [code]cell[/code] （格子）的 [code]Vector2[/code] 变量移动到相邻单元格。 当我们增加 [code]cell.x[/code] 时，机器人向右移动。 请注意，我们给在这里的机器人的移动施加了一个延迟，以帮助你直观地了解它的移动方式。通常情况下，以下代码会瞬间完成移动。

source: We can move diagonally by adding a [code]Vector2[/code] directly.
ja: [code]Vector2[/code]を直接追加することで斜めに移動できます。
nl: We kunnen diagonaal bewegen door er direct een [code]Vector2[/code] bij op te tellen.
pt: Podemos mover na diagonal a adicionar um [code]Vector2[/code] diretamente.
pt_br: Podemos mover na diagonal adicionando um [code]Vector2[/code] diretamente.
ru: Мы можем перемещаться по диагонали, прибавлением [code]Vector2[/code] напрямую.
tr: Doğrudan bir [code]Vector2[/code] ekleyerek çapraz hareket edebiliriz.
zh_hans: 要沿对角线移动，可以直接加上一个 [code]Vector2[/code] 。

source: The above code works for a pre-defined board with a size of [code]Vector2(3, 3)[/code], but the [code]move_to_end()[/code] function wouldn't work if the size of the board was different. The robot would either stop before the end or go too far. To implement a general solution for all board sizes, we can repeat the robot's movement until it gets to the end. For code that repeats, we can use [i]loops[/i].
ja: 上記のコードは、サイズが [code]Vector2(3, 3)[/code] の定義済みのボードでは機能しますが、ボードのサイズが異なる場合、[code]move_to_end()[/code] 関数は機能しません。 ロボットは終了手前で停止するか、行き過ぎるかのどちらかです。 すべてのボードサイズに対して一般的なソリューションを実装するには、ロボットの動きを最後まで繰り返すことができます。 繰り返されるコードには、[i]ループ[/i]を使用できます。
nl: De bovenstaande code werkt voor een voorgedefinieerd bord met een grootte van [code]Vector2(3, 3)[/code], maar de functie [code]move_to_end()[/code] zou niet werken als het bord een andere grootte had. De robot zou stoppen vóór het einde of juist te ver door gaan. Om een algemene oplossing te implementeren voor alle bordgroottes, kunnen we de beweging van de robot herhalen tot hij het einde bereikt. Voor code die herhaalt, kunnen we [i]lussen[/i] gebruiken.
pt: O código acima funciona para um tabuleiro pré-definido com um tamanho de [code]Vector2(3, 3)[/code], mas a função [code]move_to_end()[/code] não funcionaria se o tamanho do placa fosse diferente. O robô pararia antes do final ou iria longe demais. Para implementar uma solução geral para todos os tamanhos de tabuleiro, podemos repetir o movimento do robô até ele chegar no final. Para código que se repete, podemos usar [i]loops[/i].
pt_br: O código acima funciona para um tabuleiro pré-definido com um tamanho de [code]Vector2(3, 3)[/code], mas a função [code]move_to_end()[/code] não funcionaria se o tamanho do placa fosse diferente. O robô pararia antes do final ou iria longe demais. Para implementar uma solução geral para todos os tamanhos de tabuleiro, podemos repetir o movimento do robô até ele chegar no final. Para código que se repete, podemos usar [i]loops[/i].
ru: Приведённый выше код работает исправно для предварительно созданной доски размером [code]Vector2(3, 3)[/code], но функция [code]move_to_end()[/code] не будет работать, если размер доски будет другим. Робот будет либо останавливаться перед концом, либо проходить слишком далеко. Чтобы реализовать общее решение для досок любого размера, мы можем повторять движение робота вправо, пока он не дойдёт до конца. Для повторяющегося кода мы используем [i]циклы[/i].
tr: Yukarıdaki kod, [code]Vector2(3, 3)[/code] boyutunda önceden tanımlanmış bir tahta için çalışır, ancak [code]move_to_end()[/code] (ilerle_sona) fonksiyonu, tahtanın boyutu farklı olsaydı çalışmazdı. Robot ya sona varmadan duracak ya da çok ileri gidecekti. Tüm tahta boyutları için genel bir çözüm bulmak için, robotun hareketini sona gelene kadar tekrarlayabiliriz. Tekrar eden kodlar için [i]döngüleri[/i] kullanabiliriz.
zh_hans: 上面的代码适用于一个定义好的大小为 [code]Vector2(3, 3)[/code] 的格子，但对于不同大小的格子来说，函数[code]move_to_end()[/code]（走到底）是行不通的。 机器人要么在终点前停止，要么走得太远。 为了实现适用于各种尺寸的通用解决方案，我们可以让机器人的运动反复进行，直到它到达终点。 对于反复执行的代码，我们可以使用 [i]循环[/i]（loops）。

source: Using while loops to repeat code
ja: while ループを使用してコードを繰り返す
nl: While-lussen gebruiken om code te herhalen
pt: Usar loops de while para repetir código
pt_br: Usando loops while para repetir o código
ru: Использование циклов while для повторения кода
tr: Kodu yinelemek için "while" döngülerini kullanmak
zh_hans: 使用 while 循环反复执行代码

source: You can use a [code]while[/code] loop to make the computer repeat a block of code until you meet a specific condition or decide to break from the loop. Here's how we use a [code]while[/code] loop.
ja: [code]while[/code] ループを使用すると、特定の条件を満たすか、ループから抜け出すまで、コンピューターにコード ブロックを繰り返すことができます。 [code]while[/code]ループの使用方法は次のとおりです。
nl: Je kunt een [code]while[/code]-lus gebruiken om de computer een blok code te laten herhalen totdat je een bepaalde conditie bereikt of besluit de lus te onderbreken. Hier zie je hoe we een [code]while[/code]-lus gebruiken.
pt: Pode usar um loop [code]while[/code] para fazer o computador repetir um bloco de código até que condiz com a uma condição específica ou decide de sair do loop. Veja como usamos um loop de [code]while[/code].
pt_br: Você pode usar um loop [code]while[/code] para fazer o computador repetir um bloco de código até que você atenda a uma condição específica ou decida sair do loop. Veja como usamos um loop [code]while[/code].
ru: Вы можете использовать цикл [code]while[/code], чтобы заставить компьютер повторять блок кода, пока определённое условие не будет выполнено или пока вы не решите выйти из цикла. Вот как мы используем цикл [code]while[/code].
tr: Belirli bir koşulu karşılayana kadar, veya döngüden çıkmaya karar verene kadar, bilgisayarın bir kod parçasını yinelemesini sağlamak için bir [code]while[/code] (-iken) döngüsü kullanabilirsin. İşte bir [code]while[/code] döngüsünü nasıl kullandığımızın örneği.
zh_hans: 你可以用 [code]while[/code] 循环让计算机反复执行一段代码，直到满足特定条件或中途决定退出循环。 下面是 [code]while[/code] 循环的使用方法。

source: We use the variable [code]number[/code] to keep track of how many loops the [code]while[/code] loop completes. Each time we go through the [code]while[/code] loop, we add [code]1[/code] to [code]number[/code]. The [code]while[/code] loop keeps running for as long as the condition is true. In this case, it keeps running while [code]number[/code] is less than [code]4[/code]. You can see that the following code is executed four times in the console.
ja: 変数 [code]number[/code] を使用して、[code]while[/code] ループが完了したループの数を追跡します。 [code]while[/code]ループを実行するたびに、[code]1[/code]を[code]number[/code]に追加します。 [code]while[/code] ループは、条件が true である限り実行し続けます。この場合、[code]number[/code] が [code]4[/code] より小さい間は実行し続けます。 コンソールでは、以下のコードが 4 回実行されていることがわかります。
nl: We gebruiken de variabele [code]number[/code] om bij te houden hoeveel lussen de [code]while[/code]-lus voltooit. Elke keer dat we door de [code]while[/code]-lus gaan, tellen we [code]1[/code] op bij [code]number[/code]. De [code]while[/code]-lus blijft lopen zolang de conditie waar is. In dit geval blijft ze lopen zolang [code]number[/code] kleiner is dan [code]4[/code]. Je ziet dat de volgende code vier keer wordt uitgevoerd in de console.
pt: Usamos a variável [code]number[/code] para controlar quantos vezes o loop [code]while[/code] completa. Cada vez que passamos pelo loop [code]while[/code], adicionamos [code]1[/code] na variável [code]number[/code]. O loop [code]while[/code] continua executando aquele bloco de código enquanto a condição for verdadeira (while significa "enquanto" em Inglês). Nesse caso, ele continua executando enquanto a variável [code]number[/code] for menor que [code]4[/code]. Pode ver que o código a seguir é executado quatro vezes no console de saída.
pt_br: Usamos a variável [code]number[/code] para acompanhar quantos loops o loop [code]while[/code] completa. Cada vez que passamos pelo loop [code]while[/code], adicionamos [code]1[/code] na variável [code]number[/code]. O loop [code]while[/code] continua executando aquele bloco de código enquanto a condição for verdadeira (while significa "enquanto" em Inglês). Nesse caso, ele continua executando enquanto a variável [code]number[/code] for menor que [code]4[/code]. Você pode ver que o código a seguir é executado quatro vezes no console de saída.
ru: Мы используем переменную [code]number[/code] для того, чтобы отследить количество итераций, совершённых циклом [code]while[/code]. Каждый раз, когда мы проходим итерацию цикла [code]while[/code], к переменной [code]number[/code] прибавляется [code]1[/code]. Цикл [code]while[/code] работает до тех пор, пока условие истинно. В примере он будет работать пока [code]number[/code] меньше чем [code]4[/code]. В консоли вы можете увидеть, что приведённый ниже код выполнился четыре раза.
tr: [code]while[/code] döngüsünün, kaç döngü yaptığını takip etmek için [code]number[/code] (sayı) değişkenini kullanıyoruz. [code]while[/code] döngüsününün her tekrarında, [code]number[/code] değişkenine [code]1[/code] ekleriz. [code]while[/code] döngüsü, koşul doğru olduğu sürece çalışmaya devam eder. Bu durumda, [code]number[/code] değeri, [code]4[/code] sayısından küçük olduğu sürece çalışmaya devam eder. Aşağıdaki çıktı ekranında, kodun dört kez çalıştırıldığını görebilirsin.
zh_hans: 我们使用变量 [code]number[/code]（数量） 来跟踪 [code]while[/code] 循环完成了多少次循环。 每轮执行 [code]while[/code] 循环时，我们将 [code]number[/code] 加上 [code]1[/code]。 只要条件为真，[code]while[/code] 循环就会一直运行。在这种情况下，它会在 [code]number[/code] 小于 [code]4[/code] 时持续执行。 可以看到以下代码在控制台中执行了四次。

source: Let's apply this to our [code]move_to_end()[/code] function. This time, we compare the number of loops to the board's width. We go through the loop until we reach the width of the board. Note that we move the robot until its position is one less than the board's width because we are counting tiles from [code]0[/code]. A board of [code]3[/code] by [code]3[/code] cells would have cell coordinates going from [code]0[/code] to [code]2[/code] on both the X and Y axes.
ja: これを [code]move_to_end()[/code] 関数に適用してみましょう。 今回は、ループの数とボードの幅を比較します。ボードの幅に達するまでループを通過します。 [code]0[/code] からタイルを数えているため、その位置がボードの幅より 1 つ小さくなるまでロボットを動かすことに注意してください。 [code]3[/code] セルによる [code]3[/code] のボードは、X 軸と Y 軸の両方で [code]0[/code] から [code]2[/code] までのセル座標を持ちます。
nl: Laten we dit toepassen in onze [code]move_to_end()[/code] functie. Deze keer vergelijken we het aantal lussen met de breedte van het bord. We doorlopen de lus totdat we de breedte van het bord hebben bereikt. Merk op dat we de robot verplaatsen tot zijn positie één minder is dan de breedte van het bord omdat we tegels tellen vanaf [code]0[/code]. Een bord van [code]3[/code] bij [code]3[/code] cellen zou celcoördinaten hebben die gaan van [code]0[/code] tot [code]2[/code] op zowel de X-as als de Y-as.
pt_br: Vamos aplicar isso na nossa função [code]move_to_end()[/code]. Dessa vez, comparamos o número de loops com a largura do tabuleiro. Continuamos no loop até chegarmos na largura do tabuleiro. Observe que movemos o robô até que sua posição seja um a menos que a largura do tabuleiro, já que começamos a contar do [code]0[/code]. Um tabuleiro de células [code]3[/code] por [code]3[/code] irá ter as coordenadas das células indo de [code]0[/code] a [code]2[/code] em ambos os eixos X e Y.
ru: Давайте применим это к нашей функции [code]move_to_end()[/code]. В этот раз мы сравним порядковый номер итерации с шириной доски. Мы будем проходить через цикл до тех пор, пока не достигнем ширины доски. Обратите внимание, что мы выполняем на одну итерацию цикла меньше, чем ширина доски, так как робот уже находится в первой ячейке и отсчёт тайлов начинается с [code]0[/code]. Доска, с ячейками [code]3[/code] на [code]3[/code], будет иметь координаты ячеек от [code]0[/code] до [code]2[/code] как по оси X, так и по оси Y.
tr: Hadi bunu [code]move_to_end()[/code] fonksiyonumuza uygulayalım. Bu kez, döngü sayısını tahtanın genişliğiyle karşılaştırıyoruz. Tahtanın genişliğine ulaşana kadar döngüyü yineliyoruz. Kareleri saymaya [code]0[/code]'danbaşladığımız için, robotun konumu tahtanın genişliğinden bir eksik olana kadar hareket ettirdiğimizi unutma. [code]3[/code] 'e [code]3[/code] hücrelerden oluşan bir tahtanın hücre konumları, hem X hem de Y eksenlerinde [code]0[/code] ile [code]2[/code] arasında değişecektir.
zh_hans: 让我们将其应用于我们的 [code]move_to_end()[/code] 函数。 这一次，我们将循环次数与格子图的宽度（有多少格）进行比较。我们遍历循环，直到循环次数达到了格子数次。 注意，我们移动到终点的位置比格子数小一，这是因为我们是从 [code]0[/code] 开始计数的。 一个 [code]3[/code] x [code]3[/code] 的格子板的话，坐标会分别沿X轴和Y轴从 [code]0[/code] 记到 [code]2[/code] 。

source: While loops can cause issues
ja: while ループは問題を引き起こす可能性があります
nl: While-lussen kunnen problemen veroorzaken
pt: Loops while podem causar problemas
pt_br: Loops while podem causar problemas
ru: Циклы while могут приводить к проблемам
tr: While döngüleri, sorunlara neden olabilir
zh_hans: While循环可能会导致问题

source: If you're not careful, your [code]while[/code] loop can run infinitely. In that case, the application will freeze. Take a look at this code example.
ja: 注意しないと、[code]while[/code]ループが無限に実行される可能性があります。その場合、アプリケーションはフリーズします。 このコード例を見てください。
nl: Als je niet voorzichtig bent, kan je [code]while[/code]-lus oneindig doorlopen. In dat geval zal de toepassing bevriezen. Kijk eens naar dit codevoorbeeld.
pt: Se não tomar cuidado, o seu loop [code]while[/code] pode ser executado infinitamente. Nesse caso, a aplicação irá travar. Dê uma olhada neste código de exemplo.
pt_br: Se você não tomar cuidado, seu loop [code]while[/code] pode ser executado infinitamente. Nesse caso, o aplicativo irá travar. Dê uma olhada nesse código de exemplo.
ru: Если вы будете пользоваться циклами [code]while[/code] неосторожно, то сможете застрять в бесконечном цикле. В этом случае приложение зависнет. Взгляните на этот пример.
tr: Eğer dikkatli olmazsan, [code]while[/code] döngüsü sonsuza kadar çalışabilir. Bu durumda uygulama donacaktır. Bu kod örneğine bir göz at.
zh_hans: 如果你粗心大意，你的 [code]while[/code] 循环可能会无限运行。在这种情况下，应用程序会卡死。 看看这个代码示例。

source: What would happen if the computer tried to run the code above?
ja: コンピューターが上記のコードを実行しようとするとどうなるでしょうか？
nl: Wat zou er gebeuren als de computer de bovenstaande code probeerde uit te voeren?
pt: O que aconteceria se o computador tentasse executar o código acima?
pt_br: O que aconteceria se o computador tentasse executar o código acima?
ru: Что произойдет, если компьютер попытается выполнить приведённый выше код?
tr: Bilgisayar yukarıdaki kodu çalıştırmayı denerse ne olur?
zh_hans: 如果计算机试图运行上面的代码会发生什么？

source: Because we don't increment [code]number[/code] within the [code]while[/code] loop, it always stays at [code]0[/code]. As a result, the number is always lower than [code]10[/code], so we never break out of the loop. Since there's no way to exit the [code]while[/code] loop, the computer will attempt to draw squares infinitely, which will freeze the program. When programs stop responding on your computer, it's often due to an infinite loop!
ja: [code]while[/code] ループ内で [code]number[/code] をインクリメントしないため、常に [code]0[/code] にとどまります。 その結果、数値は常に [code]10[/code] よりも小さくなるため、ループから抜け出すことはありません。 [code]while[/code]ループを抜ける方法がないため、コンピューターは無限に正方形を描画しようとし、プログラムをフリーズさせます。 コンピュータでプログラムが応答しなくなるのは、多くの場合、無限ループが原因です！
nl: Omdat we [code]number[/code] niet verhogen binnen de [code]while[/code]-lus, blijft het altijd op [code]0[/code] staan. Als gevolg daarvan is het getal altijd kleiner dan [code]10[/code], dus we onderbreken de lus nooit. Omdat er geen manier is om de [code]while[/code]-lus te verlaten, zal de computer proberen oneindig vierkanten te tekenen, waardoor het programma vastloopt. Als programma's op je computer niet meer reageren, komt dat vaak door een oneindige lus!
pt: Como não incrementamos a variável [code]number[/code] dentro do loop [code]while[/code], ela sempre fica em [code]0[/code]. Como resultado, o número na variável é sempre menor que [code]10[/code], então nunca vamos sair do loop. Como não há como sair do loop [code]while[/code], o computador vai tentar desenhar quadrados infinitamente, o que vai fazer o programa congelar. Quando os programas param de responder no seu computador, geralmente é devido a um loop infinito!
pt_br: Como não incrementamos a variável [code]number[/code] dentro do loop [code]while[/code], ela sempre fica em [code]0[/code]. Como resultado, o número dentro da variável é sempre menor que [code]10[/code], então nunca vamos sair do loop. Como não há como sair do loop [code]while[/code], o computador vai tentar desenhar quadrados infinitamente, o que vai fazer o programa congelar. Quando os programas param de responder no seu computador, geralmente é devido a um loop infinito!
ru: Из-за того, что мы не увеличиваем [code]number[/code] внутри цикла [code]while[/code], он всегда будет равен [code]0[/code]. В результате, number всегда будет меньше [code]10[/code] и мы никогда не выйдем из цикла. По причине того, что из цикла [code]while[/code] будет невозможно выбраться, компьютер попытается рисовать квадраты бесконечно, что приведёт к полному зависанию программы. Когда программы перестают отвечать на вашем компьютере, они, как правило, находятся в бесконечном цикле!
tr: [code]while[/code] döngüsü içinde [code]number[/code] değişkenini arttırmadığımız için, her zaman [code]0[/code] değerinde kalır. Sonuç olarak, sayı her zaman [code]10[/code] 'dan küçüktür, bu nedenle döngüden asla çıkamayız. [code]while[/code] döngüsünden çıkmanın bir yolu olmadığından da, bilgisayar sonsuza kadar kare çizmeye çalışacak ve bu da programı donduracaktır. Bilgisayarında programlar yanıt vermeyi durdurduğunda, bunun nedeni genellikle sonsuz bir döngüdür!
zh_hans: 因为我们没有在 [code]while[/code] 循环中让 [code]number[/code] 增加，所以它始终保持在 [code]0[/code]。 结果，这个数字总是小于[code]10[/code]，所以我们永远不会跳出循环。 由于无法退出 [code]while[/code] 循环，计算机将无限次地尝试绘制正方形，这会卡死程序。 当你的计算机上的程序停止响应时，通常是死循环造成的！

source: It would draw squares infinitely until the program is terminated
ja: プログラムが終了するまで無限に正方形を描画します
nl: Het zou oneindig vierkanten tekenen totdat het programma wordt beëindigd
pt: Ele desenharia quadrados infinitamente até que o programa fosse forçado a terminar
pt_br: Ele desenharia quadrados infinitamente até que o programa fosse forçado a terminar
ru: Он будет рисовать квадраты бесконечно, пока выполнение программы не прекратится
tr: Program sonlandırılmazsa, sonsuza kadar kareler çizecek
zh_hans: 它会无限次地绘制正方形，直到程序被终止

source: It would draw 10 squares
ja: 10個の正方形を描画します
nl: Het zou 10 vierkanten tekenen
pt: desenharia 10 quadrados
pt_br: desenharia 10 quadrados
ru: Он нарисует 10 квадратов
tr: 10 tane kare çizecek
zh_hans: 它会画10个正方形

source: It would draw 20 squares
ja: 20個の正方形を描きます
nl: Het zou 20 vierkanten tekenen
pt: desenharia 20 quadrados
pt_br: desenharia 20 quadrados
ru: Он нарисует 20 квадратов
tr: 20 tane kare çizecek
zh_hans: 它会画20个正方形

source: When to use while loops
ja: while ループを使用する場合
nl: Wanneer while-lussen te gebruiken
pt: Quando usar loops while
pt_br: Quando usar loops while
ru: Где использовать циклы while
tr: While döngüleri ne zaman kullanılır
zh_hans: 何时使用 while 循环
