Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-8-defining-variables.po
Languages: da, de, fr, hu, it, ja, pl, pt, pt_br, ru, sv, tr, zh_hans

source: Like a supermarket has a database of product labels, the computer keeps a list of all variables in your code. Given the variable name, the computer can look up the attached value. It has an important consequence. In GDScript, you can stick that label to any other value.
da: Ligesom et supermarked har en database med produktetiketter, opbevarer computeren en liste over alle variabler i din kode. Med variabelnavnet kan computeren slå den tilknyttede værdi op. Det har en vigtig konsekvens. I GDScript kan du hæfte denne etiket til enhver anden værdi.
de: Wie ein Supermarkt eine Datenbank mit Produktetiketten hat, führt der Computer eine Liste aller Variablen in deinem Code. Mit dem Variablennamen kann der Computer den angehängten Wert nachschlagen. Das hat eine wichtige Konsequenz: In GDScript kannst Du diese Beschriftung an einen beliebigen anderen Wert kleben.
fr: Comme un supermarché dispose d'une base de données des étiquettes des produits, l'ordinateur conserve une liste de toutes les variables de votre code. En donnant le nom de la variable, l'ordinateur peut rechercher la valeur jointe. Cela a une conséquence importante. Dans GDScript, vous pouvez coller cette étiquette à n'importe quelle autre valeur.
hu: Ahogy egy áruháznak is van listája az árucímkékről, úgy a számítógépnek is van egy a kódodban lévő változókról. A változó nevének segítségével, a számítógép le tudja kérdezni annak az értékét. Ennek van egy fontos következménye. A GDScriptben, bármilyen más értékre rá tudod biggyeszteni azt a címkét.
it: Come un supermercato possiede il suo database di etichette di prodotti, il computer tiene una lista di tutte le variabili nel tuo codice. Dato il nome della variabile, il computer può guardare il valore collegato. Questo ha un'importante conseguenza. In GDScript, puoi attaccare quell'etichetta ad ogni altro valore.
ja: スーパーマーケットが商品のラベルのデータベースを持っているように、コンピューターはあなたのコード内の全ての変数のリストを保持しています。 変数名さえわかれば、コンピューターはその変数に紐付けられた値を調べることができます。 この仕組みには、GDScript において重要なポイントがあります。 貼ったラベルは、別の値に貼り直すこともできるのです。
pl: Tak jak supermarket ma bazę danych etykiet produktowych, tak nasz komputer przechowuje listę wszystkich zmiennych w kodzie. Mając nazwę zmiennej, komputer może wyszukać załączoną do niej wartość. Skutkuje to ważną konsekwencją: w GDScript możesz przekleić tę etykietę do dowolnej innej wartości.
pt: Assim como um supermercado tem um banco de dados de rótulos dos produtos, o computador mantém uma lista de todas as variáveis no seu código. Depois de dar um nome à variável, o computador pode procurar o valor anexado. Tem uma consequência importante nisso. No GDScript, pode colar esse rótulo em qualquer outro valor.
pt_br: Assim como um supermercado tem um banco de dados de rótulos dos produtos, o computador mantém uma lista de todas as variáveis no seu código. Depois de dar um nome para a variável, o computador pode procurar o valor anexado. Tem uma consequência importante nisso. No GDScript, você pode colar esse rótulo em qualquer outro valor.
ru: Как в супермаркете есть база данных этикеток товаров, так и компьютер хранит список всех переменных в вашем коде. Используя заданное имя переменной, компьютер может найти прикреплённое к ней значение. Из этого вытекает важное следствие — в GDScript вы можете приклеить эту метку к любому другому значению.
sv: Precis som en stormarknad har en databas över produkt etiketter, håller datorn en lista av variabler i din kod. Genom variabelnamnet kan datorn leta upp och kontrollera det bundna värdet. Det har en viktig konsekvens. I GDScript så kan du sätta den etiketten på vilket värde som helst.
tr: Bir süpermarketin ürün etiketlerinden oluşan bir veritabanına sahip olması gibi, bilgisayar da kodun içindeki tüm değişkenlerin bir listesini tutar. Bir değişkenin adı verildiğinde, bilgisayar onunla ilişkili değeri arayabilir. Bunun önemli bir sonucu vardır. GDScript'te, bu etiketi başka herhangi bir değere yapıştırabilirsin.
zh_hans: 就像超市有一个产品标签数据库一样，计算机会在你的代码中保存一份所有变量的列表。 给定变量名称，计算机可以查找对应的值。 它有一个重要的效果。在 GDScript 中，你可以将该标签粘贴到任何其他值上。

source: The above code is like taking a label from the appropriate item and sticking it to the wrong thing: - At line 2, the [code]health[/code] variable holds a number. - From line 3, [code]health[/code] holds text. The computer will let you do that! The code's syntax and "grammar" are correct, but it's not good. Variable names should describe the value they contain, so a [code]health[/code] variable with a text value will confuse your future self and other coders. It can also cause errors in your game. Later on, we'll see how to avoid this issue with [i]variable types[/i]. For now, let's practice creating variables!
da: Ovenstående kode er som at tage en etiket fra den relevante genstand og sætte den på den forkerte ting: - På linje 2 indeholder variablen [code]health[/code] et tal. - Fra linje 3 indeholder [code]health[/code] tekst. Computeren lader dig gøre det! Kodens syntaks og "grammatik" er korrekt, men den er ikke god. Variabelnavne bør beskrive den værdi, de indeholder, så en [code]health[/code]-variabel med en tekstværdi vil forvirre dit fremtidige jeg og andre kodere. Det kan også forårsage fejl i dit spil. Senere vil vi se, hvordan man undgår dette problem med [i]variabeltyper[/i]. Lad os nu øve os i at oprette variabler!
de: Der obige Code ist so, als würde man ein Etikett vom entsprechenden Gegenstand ablösen und es auf einen anderen, aber Falschen Gegenstand kleben: - in Zeile 1 enthält die Variable [code]health[/code] eine Zahl. - ab Zeile 2 enthält [code]health[/code] Text. Der Computer lässt das zu, da die Syntax und "Grammatik" des Codes korrekt ist. Dies hat allerdings Nachteile und ist nicht zu empfehlen. Variablennamen sollen den Wert beschreiben, den sie enthalten. Eine [code]health[/code] Variable mit einen Textwert wird dein zukünftiges ich und auch andere Programmierer verwirren. Außerdem kann sie Folgefehler in deinem Spiel provozieren. Später werden sehen wir noch wie wir dieses Problem mit [i]Variablentypen[/i] vermeiden können. Lass uns aber vorerst üben ein paar Variablen zu erstellen!
fr: Le code ci-dessus revient à prendre une étiquette de l'article approprié et à la coller sur le mauvais article : - Sur la ligne 2, la variable [code]health[/code] contient un nombre. - À partir de la ligne 3, [code]health[/code] contient du texte. L'ordinateur vous permettra de le faire ! La syntaxe et la « grammaire » du code sont correctes, mais ce n'est pas bon. Les noms de variables devraient décrire la valeur qu'elles contiennent, donc une variable [code]health[/code] avec une valeur texte va embrouiller votre futur moi et les autres codeurs. Cela peut également provoquer des erreurs dans votre jeu. Plus tard, nous verrons comment éviter ce problème avec les [i]types de variables[/i]. Pour l'instant, exerçons-nous à créer des variables !
it: Il codice precedente è come se prendesse un'etichetta dall'elemento appropriato e la attaccasse a quello sbagliato: - Alla riga 2, la variabile [code]health[/code] contiene un numero. - Alla riga 3, [code]health[/code] contiene un testo. Il computer vi permetterà di farlo! La sintassi e la "grammatica" del codice sono corrette, ma non vanno bene. I nomi delle variabili devono descrivere il valore che contengono, quindi una variabile [code]health[/code] con un valore di testo confonderà il vostro futuro io e gli altri codificatori. Può anche causare errori nel gioco. Più avanti vedremo come evitare questo problema con i [i]tipi di variabili[/i]. Per ora, esercitiamoci a creare le variabili!
ja: 上記のコードは、あるアイテムから本来のラベルをはがして、別の間違ったものに貼り付けるようなものです。 ・2行目では、[code]health[/code]変数は数値を持っています。(本来のラベルが貼られている) ・3行目からは、[code]health[/code]変数はテキストを持っています。(本来のラベルをはがして、別のラベルを貼った) コンピュータは、このようなことを許容してしまいます。コードの構文と "文法" は正しくても、望ましい動作ではありません。 変数名は、その中に含まれている値を説明するものでなければなりません。そのため、[code]health[/code]という変数にテキスト値を入れると、将来の自分や他のプログラマーを混乱させる可能性があります。ゲーム内でエラーが発生する原因にもなりえます。 後ほど、[i]変数型[/i] を使ってこのような問題を回避する方法を見ていきます。 今回は、変数作成の演習をしてみましょう！
pt_br: O código acima é como pegar um rótulo de um item que já estava certo e colá-lo na coisa errada: - Na linha 2, a variável [code]health[/code] contém um número. - A partir da linha 3, [code]health[/code] passar a ter um texto. O computador vai deixar você fazer isso! A sintaxe e a "gramática" do código estão corretas, mas não são boas. É boa prática dar um nome que descreve bem o valor de uma variável. Uma variável [code]health[/code] com um valor de texto pode confundir você e outros programadores no futuro. Também pode causar erros no seu jogo. Mais tarde, veremos como evitar esse problema com [i]tipos de variável[/i]. Por enquanto, vamos praticar a criação de variáveis!
ru: Приведенный выше код похож на то, как если бы вы взяли ярлык с подходящего элемента и приклеили его к неправильному: - В строке 2 переменная [code]health[/code] содержит число. - После выполнения строки 3, переменная [code]health[/code] будет содержать текст. Компьютер позволит вам так сделать! Синтаксис и "грамматика" кода правильные, но делать так — плохо. Имена переменных должны описывать содержащееся в них значение, поэтому переменная [code]health[/code] с текстовым значением запутает вас и других программистов в будущем. Это также может вызвать ошибки в вашей игре. Позже мы увидим, как избежать этой проблемы с помощью [i]типов переменных[/i]. А пока давайте попрактикуемся в создании переменных!
tr: Yukarıdaki kod, uygun bir üründen etiketini alıp, yanlış bir şeye yapıştırmak gibidir: - 2. satırda, [code]health[/code] değişkeni bir sayı tutuyor. - 3. satırdan itibaren, [code]health[/code] metin tutmaya başlıyor. Bilgisayar bunu yapmana izin verir! Çünkü kodun sözdizimi ve "dilbilgisi" doğrudur, ama bu iyi bir şey değil. Değişkenlerin isimleri, içerdikleri değeri tanımlamalıdır, bu nedenle metin içeriği olan bir [code]health[/code] değişkeni gelecekteki senin ve diğer kodlayıcıların kafasını karıştıracaktır. Ayrıca oyununda hatalara da neden olabilir. İleride, [i]değişken tipleri[/i] ile bu sorundan nasıl kaçınacağımızı göreceğiz. Şimdilik, değişkenleri oluşturma alıştırması yapalım!
zh_hans: 上面的代码就像把标签从合适的物品上取下又贴到了错误的东西上： - 在第 2 行时，[code]health[/code] 变量装的是数字。 - 从第 3 行开始，[code]health[/code] 装的是文本了。 电脑会允许你这么做！这段代码是符合句法（syntax）和“语法（grammar）”的，但这样做不太好。 变量名最好能描述它里面的值是什么，所以一个叫做[code]health[/code] 的变量里面的值却是文本，将来的你和你的同事看到这里会很懵。这样还会让你的游戏出现错误。 稍后的课程里，我们会看到如何使用 [i] 变量类型 [/i] 来避免这个问题。但是现在，让我们来练习创建变量！

source: Define a health variable
da: Definer en livsvariabel
de: Definieren einer Lebensvariable
fr: Définir une variable de santé
hu: Hozz létre egy "health" változót
it: Definisci una variabile di vita
ja: ヘルス変数を定義する
pl: Zdefiniuj zmienną dla zdrowia
pt: Defina uma variável de vida
pt_br: Defina uma variável de vida
ru: Определите переменную здоровья
sv: Definiera en hälsovariabel
tr: Bir sağlık değişkeni tanımla
zh_hans: 定义一个health变量

source: Define a variable named [code]health[/code] with a starting value of [code]100[/code]. You can define variables inside or outside functions. In this practice, you shouldn't create a function.
da: Definer en variabel med navnet [code]health[/code] med en startværdi på [code]100[/code]. Du kan definere variabler inden for eller uden for funktioner. I denne øvelse bør du ikke oprette en funktion.
de: Definiere eine Variable mit dem Namen [code]health[/code](Leben) mit dem Startwert [code]100[/code]. Du kannst Variablen innerhalb oder außerhalb von Funktionen definieren. In dieser Übung sollst Du keine Funktion erstellen.
fr: Définissez une variable nommée [code]health[/code] avec une valeur de départ de [code]100[/code]. Vous pouvez définir des variables à l'intérieur ou à l'extérieur des fonctions. Dans cet exercice, vous ne devez pas créer de fonction.
hu: Hozz létre egy [code]health[/code] nevűzót, melynek a kezdőértéke [code]100[/code]. Változókat függvényekben és azokon kívül is létrehozhatsz. Ebben a gyakorlatban ne hozz létre új függvényt.
it: Definisci una variabile chiamata [code]health[/code] con un valore iniziale di [code]100[/code]. Puoi definire le variabili dentro o fuori le funzioni. In questa pratica, non dovresti creare una funzione.
ja: [code]health[/code] という名前の変数を、開始値 [code]100[/code] で定義します。 関数の内部または外部で変数を定義できます。 この実践では、関数を作成しないでください。
pl: Zdefiniuj zmienną o nazwie [code]health[/code] i nadaj jej wartość początkową [code]100[/code]. Możesz definiować zmienne wewnątrz lub na zewnątrz funkcji. W tym ćwiczeniu nie powinieneś tworzyć funkcji.
pt: Defina uma variável chamada [code]health[/code] com um valor inicial de [code]100[/code]. Pode definir variáveis dentro ou fora das funções. Nesta prática, não deve criar uma função.
pt_br: Defina uma variável chamada [code]health[/code] com um valor inicial de [code]100[/code]. Você pode definir variáveis dentro ou fora das funções. Nesta prática, você não deve criar uma função.
ru: Определите переменную здоровья с именем [code]health[/code] и начальным значением [code]100[/code]. Вы можете определять переменные внутри или снаружи функций. В данном упражнении функцию создавать не нужно.
sv: Definiera en variabel som heter [code]health[/code] med ett startvärde på [code]100[/code]. Du kan definiera variabler inom eller utanför funktioner. I denna övningen så borde du inte skapa en funktion.
tr: Başlangıç değeri [code]100[/code] olan, [code]health[/code] isminde bir değişken tanımla. Değişkenleri fonksiyonların içinde veya dışında tanımlayabilirsin. Bu uygulamada, bir fonksiyon oluşturmamalısın.
zh_hans: 定义一个名为 [code]health[/code] 的变量，其起始值为 [code]100[/code]。 在函数内部或外部定义变量都是可以的。在这个练习中，你犯不上创建一个函数。

source: In this practice, you'll define your first variable and give it a specific starting value.
da: I denne øvelse definerer du din første variabel og giver den en specifik startværdi.
de: In dieser Übung definierst Du deine erste Variable und gibst ihr einen bestimmten Startwert.
fr: Dans cet exercice, vous allez définir votre première variable et lui donner une valeur de départ spécifique.
hu: Ebben a gyakorlatban létre fogod hozni az első változód, és adni fogsz neki egy egyedi kezdőértéket.
it: In questa pratica, definirai la tua prima varibile e gli darai un valore specifico.
ja: この演習では、最初の変数を定義し、その変数に具体的な初期値を設定します。
pl: W tym ćwiczeniu zdefiniujesz swoją pierwszą zmienną i nadasz jej konkretną wartość początkową.
pt: Nesta prática, vai definir a sua primeira variável e dará-lhe um valor inicial específico.
pt_br: Nesta prática, você vai definir sua primeira variável e dará a ela um valor inicial específico.
ru: В этом упражнении вы определите свою первую переменную и зададите ей конкретное начальное значение.
sv: I denna övning så kommer du att definiera din första variabel och ge den ett specifikt start-värde.
tr: Bu uygulamada, ilk değişkenini tanımlayacak ve ona belirli bir başlangıç değeri vereceksin.
zh_hans: 在本练习中，你将定义你的第一个变量并为其指定一个特定的起始值。

source: Defining Your Own Variables
da: Definering af dine egne variabler
de: Eigene Variablen definieren
fr: Définir vos propres variables
hu: Saját változók létrehozása
it: Definendo Le Tue Variabili
ja: 独自の変数を定義する
pl: Definiowanie własnych zmiennych
pt: Definir as Suas Próprias Variáveis
pt_br: Definindo Suas Próprias Variáveis
ru: Определение собственных переменных
sv: Definiera Dina Egna Variabler
tr: Kendi Değişkenlerini Tanımlamak
zh_hans: 定义你自己的变量

source: In the previous lesson, you used a predefined member variable named [code]position[/code]. In your projects, you will need to define your own variables. Imagine that you need to track the player's health in your game. They may start with [code]5[/code] health points. When taking a hit, the health should go down to [code]4[/code]. After another hit, it should be [code]3[/code]. And so on. To keep track of that, you can create a variable named [code]health[/code] to which you add and subtract points. [i]The example below introduces the [code]print()[/code] function, which outputs its parameter to the output box on the left.[/i]
hu: Az előző leckében egy [code]position[/code] nevű beépített változót használtál. A saját projektjeidben létre kell majd hoznod a saját változóid is. Képzeld el, hogy számon kell tartanod a játékos életerejét. Kezdhet például [code]5[/code] ponttal. ha találat éri, akkor le kell mennie [code]4[/code]-re. A következő találat után [code]3[/code]-ra. És így tovább. Hogy ezt követni tudd, létrehozhatsz egy [code]health[/code] nevű változót, amiből levonod a pontokat. [i]A lenti példában megismerkedünk a [code]print()[/code] függvénnyel, ami kiírja a paraméterét a bal oldali output mezőbe.[/i]
pt: Na lição anterior, usou uma variável membro predefinida chamada [code]position[/code]. Nos seus projetos, vai precisar de definir as suas próprias variáveis. Imagine que precisa acompanhar a vida do jogador no seu jogo. Ela pode começar com [code]5[/code] pontos. Ao receber um golpe, a vida cai para [code]4[/code]. Depois de outro hit, deve ser [code]3[/code]. E assim por diante. Para acompanhar isso, pode criar uma variável chamada [code]health[/code] que pode usar para adicionar e subtrair pontos. [i]O exemplo abaixo apresenta a função [code]print()[/code], que emite o parâmetro dele à caixa de saída à esquerda.[/i]
sv: I föregående lektion använde du en fördefinierad medlems variabel som hette [code]position[/code] I dina egna projekt kommer du behöva definiera dina egna variabler. Föreställ dig att du måste hålla reda på spelarens hälsa i ditt spel. Dom startar kanske med [code]5[/code] hälsopoäng. När dom blir träffade av ett slag borde hälsan gå ner till [code]4[/code]. Efter ännu en träff borde hälsan vara [code]3[/code], och så vidare och så vidare... För att hålla reda på detta, kan du skapa en variabel som heter [code]health[/code] som gör att du kan lägga till eller ta bort hälsopoäng. [i]Exemplet nedan introducerar [code]print()[/code] funktionen, som skriver ut dess parameter till utmatnings boxen till vänster.[/i]

source: To use a variable, you must first define it so the computer registers its name. To do so, you start a line of code with the [code]var[/code] keyword followed by your desired variable name. Like [code]func[/code] stands for [i]function[/i], [code]var[/code] stands for [i]variable[/i]. The following line defines a [code]health[/code] variable pointing to no value. You can think of it as creating a product label you have yet to stick onto something.
hu: Változó használatához először létre kell azt hozni, hogy a számítógép regisztrálja a nevét. Ehhez a sort a [code]var[/code] kulcsszóval kell kezdeni, majd a változó nevével folytatva. Ahogyan a [code]func[/code] [i]function[/i] (függvény) rövidítése, úgy a [code]var[/code] a [i]variable[/i] (változó) rövidítése. Az alábbi sor létrehoz egy érték nélküli [code]health[/code] változót. Gondolhastz úgy is rá, mint egy címkére, amit még nem ragasztottak rá egy termékre.
pt: Para usar uma variável, primeiro deve defini-la para que o computador registe o nome dela. Para fazer isso, inicie uma linha de código com a palavra-chave [code]var[/code] seguida do nome da variável desejada. Assim como [code]func[/code] significa [i]função[/i], [code]var[/code] significa [i]variável[/i]. A linha a seguir define uma variável [code]health[/code] que não possui nenhum valor. Pode pensar nisso como criar um nome de um produto que ainda precisa colar em algo (ou seja, criou a variável e não colocou nenhum valor nela ainda).
sv: För att använda en variabel måste du först definiera den så att datorn registrerar dess namn. För att göra så, börja en rad kod med [code]var[/code] nyckelordet följt med vad du önskar att variabeln ska heta. Som att [code]func[/code] står för [i]funktion[/i], [code]var[/code] står för [i]variabel[/i]. Följande rad definierar en [code]health[/code] variabel som pekar mot inget värde. Du kan se det som att du skapar en produktetikett som du ännu inte har satt fast på något ännu.

source: The above code is like taking a label from the appropriate item and sticking it to the wrong thing: - At line 1, the [code]health[/code] variable holds a number. - From line 2, [code]health[/code] holds text. The computer will let you do that! The code's syntax and "grammar" are correct, but it's not good. Later on, we'll see how to avoid this issue with [i]variable types[/i]. For now, let's practice creating variables!
hu: A fenti kód olyan, mintha levennéd a címkét a a helyes áruról és egy nem megfelőle raknád át: - Az 1. sorban, a [code]health[/code] változó egy számot tárol. - A 2. sortól kezdve, a [code]health[/code] már szöveget tárol. A számítógép ezt meg fogja engedni! A kód szintaktikája és "nyelvtana" helyes, de ez nem jó. Később majd megnézzük, hogy kerülhetjük el az ilyen hibákat a [i]változó típusokkal[/i]. Egyelőre, gyakorljuk a változók létrehozását!
pt: O código acima é como levar um rótulo de um item que já estava certo e colá-lo na coisa errada: - Na linha 1, a variável [code]health[/code] contém um número. - A partir da linha 2, [code]health[/code] passar a ter um texto. O computador vai deixar fazer isso! A sintaxe e a "gramática" do código estão corretas, mas não são boas. Mais tarde, veremos como evitar esse problema com [i]tipos de variável[/i]. Por enquanto, vamos praticar a criação de variáveis!
sv: Koden ovan är som att man tar en etikett från den lämpliga artikeln och sätter den på fel sak: - På linje 1, håller [code]health[/code] variabeln ett nummer. - Från linje 2, [code]health[/code] håller variabeln text. Datorn kommer att låta dig göra detta! Kodens syntax och "grammatik" är korrekt, men det är inte bra. Senare kommer vi att se hur vi kan undvika detta med [i]variabel typer[/i]. För tillfället, låt oss öva på att skapa variabler!

source: The code above will display the number [code]100[/code] to some output window. Notice we don't use the [code]var[/code] keyword anymore as we only need it to [i]define[/i] a variable. Also, once you defined a variable, you can change its value anytime with the equal sign.
sv: Koden ovan kommer visa nummert [code]100[/code] till något utmatningsfönster. Uppmärksamma att vi inte använde [code]var[/code] nyckelordet längre eftersom det bara behövs för att [i]definiera[/i] en variabel. Notera också att när du väl definierat en variabel kan du ändra värdet när som helst genom att använda likhetstecknet.
