Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-1-what-code-*-like.po
Languages: es, fa, hu, ko, pl, pt_br, sk, sv, th, zh_hans, zh_hant

source: We designed it for [i]absolute beginners[/i], but if you already know another language, it can be a fun way to get started with Godot.
fa: این دوره را برای [i]نوآموزترین‌ها[/i] طراحی کردیم ولی اگر هم‌اکنون زبان دیگری هم می‌دانید می‌تواند راه جالبی برای راه افتادن در گودوت باشد.
ko: 우리는 [i]아무것도 모르는 입문자[/i]를 위해 이 강좌를 만들었지만, 이미 다른 언어를 알고 계시다면 고도를 시작하는 흥미로운 계기가 될 지도 모릅니다.
sk: Navrhli sme ho pre [i]úplných začiatočníkov[/i], ale ak už viete iný jazyk, môže to byť zábavný spôsob, ako začať s Godotom.
sv: Vi gjorde den för [i]absoluta nybörjare[/i], men om du redan kan ett annat programmeringsspråk kan det vara ett roligt sätt att komma igång med Godot.

source: We will give you the coding foundations you need to start making games and applications with Godot.
fa: به شما پایه‌های کدنویسی‌ای که برای آغاز به بازی‌سازی و برنامه‌سازی با گودوت به آنها نیاز دارید را به شما خواهیم داد.
ko: 고도 엔진을 사용해 게임과 앱을 만드실 수 있도록, 우리가 코딩의 기초를 쌓아드리겠습니다.
sk: Dáme vám základy programovania, aby ste mohli začať vytvárať hry a aplikácie s Godotom.
sv: Vi ger dig de grunder i kodning som du behöver för att kunna börja göra spel och program med Godot.

source: Please be patient. It will take time before you can make your first complete game alone.
fa: خواهشمندیم شکیبا و صبور باشید. پیش از اینکه بتوانید به‌تنهایی نخستین بازی کامل‌تان را بسازید اندازه‌ای زمان خواهد برد.
ko: 인내심을 가지세요. 여러분의 첫 게임이 완성될 때까지는 시간이 필요합니다.
sk: Buďte, prosím, trpezliví. Chvíľu potrvá, než budete vedieť vytvoriť sami svoju prvú celú hru.
sv: Ha tålamod. Det kommer att ta ett tag innan du kan göra ditt första fullständiga spel på egen hand.

source: Learning to make games takes practice
fa: آموختن بازی‌سازی تمرین می‌خواهد
hu: A játékfejlesztés megtanulása, gyakorlást igényel
ko: 게임을 만드려면 실습이 필요하다
pl: Nauka tworzenia gier wymaga praktyki
pt_br: Aprender a fazer jogos requer prática
sk: Naučiť sa tvoriť hry vyžaduje prax
sv: Att lära sig göra spel kräver övning
th: การเรียนรู้ที่จะทำเกมจำเป็นต้องรับการฝึกฝน
zh_hans: 学习游戏制作需要练习
zh_hant: 學習製作遊戲需要練習

source: Creating games is more accessible than ever, but it still takes a lot of work and practice.
fa: بازی‌سازی از هر زمان دیگری دردسترس‌تر است، ولی هنوز نیاز بسیاری به کوشش و تمرین دارد.
ko: 게임을 만드는 게 정말 쉬운 시대가 되었지만, 여전히 많은 노력과 연습이 필요합니다.
sk: Tvorba hier je dostupnejšia než kedykoľvek predtým, stále si však žiada veľa práce a praxe.
sv: Att göra spel är mer lättillgängligt än någonsin men det kräver fortfarande mycket arbete och övning.

source: Do not expect any single course or book to turn you into a professional. [b]Programming is something you learn through practice.[/b]
fa: انتظار نداشته باشید که با یک دوره یا کتاب تبدیل به بازی‌سازی حرفه‌ای شوید. [b]برنامه‌نویسی چیزی‌ست که از راه تمرین می‌آموزید.[/b]
ko: 강좌나 책 하나 읽었다고 프로가 될 거란 생각은 버리세요. [b]프로그래밍은 단련해야 하는 기술입니다.[/b]
sk: Neočakávajte, že z vás jediný kurz alebo kniha spravia profíka. [b]Programovanie sa učí praxou.[/b]
sv: Förvänta dig inte att en enda kurs eller bok ska göra dig till ett proffs. [b]Programmering är någonting du lär dig genom att öva.[/b]

source: If something doesn't make immediate sense, don't stress it too much! Keep learning and come back to it later.
fa: اگر چیزی را درجا نفهمیدید، نگران نباشید! به آموختن ادامه دهید و بعداً به آن برگردید.
ko: 뭔가가 이해가 안 된다고요? 너무 걱정 마세요! 계속 배워나가면서 나중에 다시 돌아보시면 됩니다.
sk: Ak niečomu hneď neporozumiete, nestresujte sa tým! Pokračujte v učení a neskôr sa k tomu vráťte.
sv: Om det är något som du inte genast förstår ska du inte oroa dig speciellt mycket! Fortsätt lära dig och kom tillbaka till det senare.

source: Enjoy the process and celebrate every little success. You will never stop learning as a game developer.
fa: از فرایند آموزش لذّت ببرید هر پیروزی کوچکی را جشن بگیرید. به‌عنوان بازی‌ساز هرگز دست از آموختن بر نخواهید داشت.
ko: 과정을 즐기며 사소하지만 아름다운 성공을 하나하나 축하하세요. 게임 개발자는 계속 배워나가는 존재입니다.
sk: Užívajte si postup a oslavujte každý malý úspech. Ako vývojár hier sa nikdy neprestanete učiť.
sv: Njut av processen och fira varje litet framsteg. Du slutar aldrig lära dig nya saker då du är en spelutvecklare.

source: What and how you'll learn
es: Qué y cómo aprenderás
fa: چی و چجوری خواهید آموخت
hu: Mit, és hogyan tanulsz majd
ko: 무엇을 어떻게 배워야 하는가
pl: Czego i jak się nauczysz
pt_br: O que e como você irá aprender
sk: Čo a ako sa naučíte
sv: Vad och hur du lär dig
th: คุณจะได้เรียนรู้อะไรอย่างไรบ้าง
zh_hans: 你会学到什么、如何学习
zh_hant: 學習的內容與方法

source: In this free course, you will learn the foundations you need to start coding things like these:
fa: در این دورهٔ رایگان، پایه‌هایی که برای آغاز به کدنویسی چیزهایی که در زیر می‌بینید به آنها نیاز دارید را خواهید آموخت:
ko: 이번 무료 강좌에서는, 이런 것들을 만들어낼 수 있도록 코딩의 기초를 배울 것입니다.
pl: W tym bezpłatnym kursie nauczysz się podstaw potrzebnych do rozpoczęcia kodowania takich rzeczy:
pt_br: Nesse curso gratuito, você vai aprender os fundamentos que você precisa para começar a programar coisas como essas:
sk: V tomto kurze zadarmo sa naučíte základy, aby ste mohli začať programovať veci ako tieto:
zh_hans: 在这个免费教程中，你将开始学到编写此类内容所需的基础知识：

source: Along the way, we'll teach you:
fa: در درازای راه، به شما خواهیم آموزاند:
ko: 이 여정에선 다음과 같은 사항을 배울 것입니다.
sk: Postupne vás naučíme:
sv: Samtidigt lär vi dig:

source: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - How to write GDScript code. - Essential programming foundations to get you started.
fa: - برخی از نگرش‌هایی که به‌عنوان توسعه‌دهنده نیاز دارید. دوره‌های برنامه‌نویسی بسیاری این بخش مهم را رد می‌کنند. - چگونه کد جی‌دی‌اسکریپت بنویسید. - پایه‌های مهم برنامه‌نویسی برای راه انداختن‌تان.
ko: -게임 개발자에게 필요한 마음가짐. 너무 많은 강좌가 이 중요한 부분을 무시하고 넘어갑니다. -GDScript 코드를 작성하는 법. -시작하는 데 필수적인 프로그래밍 기초.
sk: - Niektoré myšlienkové postupy, ktoré ako vývojár potrebujete. Príliš veľa kurzov programovania túto podstatnú časť vynecháva. - Ako písať kód v GDScripte. - Nevyhnutné základy programovania do vašich začiatkov.
sv: - En del av de tankesätt man behöver som en programmerare. Allt för många programmeringskurser hoppar över den här viktiga biten. - Hur man kodar i GDscript. - Viktiga grunder för programmering som behövs för att börjar programmera.

source: As you go through the course, you will have many questions. We will answer them the best we can as we go.
fa: در طول این دوره، پرسش‌های بسیاری خواهید داشت. تا اندازه‌ای که بتوانیم آنها را در راه پاسخ خواهیم داد.
ko: 강좌를 듣다 보면 분명 많은 의문이 생길 것입니다. 그 모든 질문에 최대한 답해드리겠습니다.
sk: V priebehu kurzu budete mať veľa otázok. Postupne vám na ne odpovieme ako najlepšie vieme.
sv: Under kursens gång kommer du ha många frågor. Vi kommer besvara dem så bra vi kan innan kursen är slut.

source: But there is so much to cover that we have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things.
fa: ولی چیزهای بسیاری برای پوشش دادن هست که باید به‌خاطرشان چند میانبر بزنیم. نمی‌خواهیم که شما را با اطلاعات [i]کلافه کنیم[/i]. همچنین می‌خواهیم سرعتی که مغزهایمان برای به خاطر سپردن اطلاعات نیاز دارد را در نظر داشته باشیم.
ko: 다만 배울 것이 너무 많으므로 때론 지름길을 택할 것입니다. 너무 많은 정보로 [i]부담[/i]드리고 싶지 않고, 우리의 뇌가 정보를 기록하는 속도도 존중하고 싶으니까요.
sk: Je toho však toľko, že sa musíme uchýliť k pár skratkám. Nechceme vás [i]zahltiť[/i] informáciami. Taktiež chceme rešpektovať tempo, akým sa naše mozgy učia.
sv: Men det finns så mycket att behandla att vi måste ta några genvägar. Vi vill inte [i]överväldiga[/i] dig med information. Vi försöker också respektera det tempo som våra hjärnor klarar av att memorera saker.

source: We broke down the course into short lessons and practices. If we put too much into each part, you'd learn slower.
fa: دوره را به آموزه‌های کوتاه و تمرین‌ها بخش کردیم. اگر در هر بخش بیش از اندازه قرار می‌دادیم کندتر می‌آموختید.
ko: 각 부분에 너무 많은 걸 넣으면 진행이 느려질 수 있으므로, 강좌를 짧은 수업과 실습으로 쪼개놓았습니다.
sk: Kurz sme rozdelili do krátkych lekcií a cvičení. Keby sme do každej časti toho dali priveľa, učili by ste sa pomalšie.
sv: Vi delade in kursen i korta lektioner och övningar. Om vi skulle sätta in för mycket i varje del, skulle du lära dig långsammare.

source: If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
fa: هرگاه که با پرسش‌های داغی روبه‌رو شدید، در [url=https://discord.gg/87NNb3Z]انجمن دیسکوردمان[/url] قدمتان روی چشم‌مان خواهد بود.
ko: 만약 어떻게 해도 의문이 해결되지 않아 속이 타신다면, 언제든지 [url=https://discord.gg/87NNb3Z]우리 디스코드 채널[/url]에 가입하세요.
sk: Ak by ste kedykoľvek narazili na pálčivé otázky, ste vítaní pripojiť sa k [url=https://discord.gg/87NNb3Z]našej Discord komunite[/url].
sv: Om du i något skede känner att du har lämnats med obesvarade frågor är du mer än välkommen att ansluta dig till [url=https://discord.gg/87NNb3Z]vår diskord kommunitet[/url].

source: Is this for Godot 4?
fa: آیا این برای گودوت ۴ است؟
ko: 이 강좌는 고도 4를 위한 것인가?
sk: Je toto pre Godot 4?
zh_hans: 这个教程适用于Godot 4吗？

source: What you'll learn in this free course is fully compatible with Godot 4. While we initially designed this series for Godot 3, the foundations of GDScript are still the same in Godot 4.
fa: چیزهایی که در این دورهٔ رایگان خواهید آموخت به‌خوبی با گودوت ۴ سازگار است. با اینکه در آغاز این دوره را برای گودوت ۳ طراحی کرده بودیم، پایه‌های جی‌دی‌اسکریپت در گودوت ۴ یکسان مانده‌اند.
ko: 이 무료 강좌에서 배울 내용은 고도 4에서 완전히 호환됩니다. 원래는 고도 3를 위해 이 강좌를 디자인했지만, GDScript 의 기초는 여전히 고도 4에서도 동일합니다.
sk: Všetko, čo sa naučíte v tomto kurze zadarmo je úplne kompatibilné s Godotom 4. Hoci sme tento kurz pôvodne navrhli pre Godot 3, základy GDScriptu ostávajú v Godote 4 rovnaké.
zh_hans: 在这个免费课程里你能学到的东西都是完全兼容Godot 4的。虽然我们一开始是基于Godot 3设计的这些课程，但是GDScript的基础功能同样适用于Godot4。

source: Programming is a skill
es: Programar es una habilidad
fa: برنامه‌نویسی مهارت است
hu: A programozás egy készség
ko: 프로그래밍은 기술이다
pl: Programowanie to umiejętność
pt_br: Programar é uma habilidade
sk: Programovanie je zručnosť
sv: Programmering kräver färdighet
th: การเขียนโปรแกรมคือทักษะ
zh_hans: 编程是一项技能
zh_hant: 程式是種技能

source: Programming is a skill, so to get good at it, you must practice. It is why we built this app.
fa: برنامه‌نویسی مهارت است، پس برای بهتر شدن در آن باید تمرین کنید. دلیل ساخت این برنامه همین است.
ko: 프로그래밍은 기술입니다. 고로 잘 하려면 반드시 실습을 해야 합니다. 그래서 이 앱을 만들었습니다.
sk: Programovanie je zručnosť, takže aby ste sa v ňom zlepšili, musíte cvičiť. Preto sme vytvorili túto aplikáciu.
sv: Programmering kräver färdighet. För att bli duktig på det måste du öva. Därför byggde vi den här appen.

source: Each lesson is followed by an interactive practice to use what you learned.
fa: هر آموزه تمرینی تعاملی پس از خود دارد که با آن چیزی که آموختید را به کار ببرید.
ko: 각 수업에는 상호작용형 실습과제가 붙어있어 배운 것을 써보실 수 있습니다.
sk: Po každej lekcii nasleduje interaktívne cvičenie, kde využijete čo ste sa naučili.
sv: Varje lektion följs av en interaktiv övning där vi använder det vi har lärt oss.

source: Speaking of which, it's time to look at the practice screen!
fa: اکنون که بحثش پیش آمد، زمان آن رسیده است که نگاهی به صفحهٔ تمرین بیندازیم!
ko: 말이 나온 김에 실습 화면을 직접 들여다보세요!
sk: Keď o tom hovoríme, je načase pozrieť sa na obrazovku cvičenia!
sv: På tal om det, är det dags att titta på övningsskärmen!

source: To continue, click the [i]Practice[/i] button below. It will give you a short run through how practices work.
fa: برای ادامه، روی دکمهٔ [i]تمرین[/i] در زیر کلیک کنید. به شما چکیدهٔ کوتاهی دربارهٔ چگونگی کارکرد تمرین‌ها خواهد داد.
ko: 계속하려면 아래에 있는 [i]실습[/i] 단추를 누르세요. 실습 과정을 짤막하게 체험하실 수 있습니다.
sk: Pre pokračovanie kliknite tlačidlo [i]Practice[/i] dole. Stručne sa zoznámite s tým, ako cvičenia fungujú.
sv: Fortsätt genom att klicka på [i]Öva[/i]knappen nedanför. Det kommer att ge dig en inblick i hur övningarna går till.

source: Try Your First Code
es: Prueba tu primer código
fa: نخستین کدتان را بنویسید
hu: Írd meg az első kódod
ko: 첫 코드를 실행해보자
pl: Wypróbuj swój pierwszy kod
pt_br: Experimente seu primeiro código
sk: Vyskúšajte svoj prvý kód
sv: Testa din första kod
th: ลองเขียนโค้ดแรกของคุณ
zh_hans: 尝试你的第一段代码
zh_hant: 試試你的第一個程式碼

source: We prepared a code sample for you. For this practice, you don't need to change anything.
fa: برای‌تان کد نمونه آماده کردیم. برای این تمرین، نیاز نیست چیزی را دگرگون کنید.
ko: 여러분을 위해 코드 예제를 준비했습니다. 이번 실습에선 딱히 건드릴 필요가 없습니다.
sk: Pripravili sme pre vás ukážku kódu. V tomto cvičení nemusíte nič meniť.
sv: Vi förberedde en kodsnutt för dig. För den här övningen behöver du inte ändra någonting.

source: To test the code, click the [i]Run[/i] button below the code editor.
fa: برای آزمودن این کد، روی دکمهٔ [i]اجرا[/i] در زیر ویراستار کد کلیک کنید.
ko: 코드를 테스트하려면 에디터 밑에 있는 [i]실행[/i] 버튼을 누르세요.
sk: Ak chcete kód vyskúšať. kliknite na tlačidlo [i]Run[/i] dole pod editorom kódu.
sv: Testa koden genom att klicka på [i]Kör[/i]knappen nedanför kodredigeraren.

source: Run your first bit of code and see the result.
es: Ejecuta tu primer pedacito de código y mira el resultado.
fa: نخستین تکهٔ کدتان را اجرا کنید و نتیجه را ببینید.
hu: Futtasd az első kódod, és nézd mi történik.
ko: 첫 코드를 실행하고 결과를 관찰해보세요.
pl: Uruchom swój pierwszy fragment kodu i zobacz wynik.
pt_br: Execute seu primeiro código e veja o resultado.
sk: Spusťte svoj prvý kúsok kódu a uvidíte výsledok.
sv: Kör din första kodsnutt och se resultatet.
th: เรียกใช้โค้ดแรกของคุณและดูผลลัพธ์
zh_hans: 请运行你的第一段代码并查看结果。
zh_hant: 執行你的第一個程式碼並檢視結果。

source: What Code is Like
es: Cómo es el código
fa: کد چگونه است
hu: Milyen a kód
ko: 코드란
pl: Czym jest kod
pt_br: Como o código se parece
sk: Ako kód vyzerá
sv: Hur kod är
th: โค้ดเหมือนกับอะไร
zh_hans: 代码是什么
zh_hant: 程式碼是什麼

source: Learning to program can be daunting. Yet, you want to make video games, so [b]there is no way around learning to program[/b]. [i]Every[/i] video game is a computer program.
hu: Megtanulni programozni elég ijesztő lehet. És mégis, videójátékokat szeretnél készíteni, tehát [b]nem lehet elekrülni a megtanulását[/b]. [i]Minden[/i] videójáték egy számítógépes program.
pt_br: Aprender a programar pode ser assustador. No entanto, se você quer fazer videogames, então [b]não há como evitar como aprender a programar[/b]. [i]Todo videogame[/i] é um programa de computador.
th: นึกจะหัดเขียนโปรแกรมแต่ละที ก็มีแต่จะสยอง แต่ทำไงล่ะ อยากสร้างวิดีโอเกมส์ให้ได้ด้วยตัวเอง [b]มันก็ไม่มีทางเลี่ยงการฝึกเขียนโปรแกรมไปได้[/b] [i]เพราะทุก ๆ เกมส์[/i] มันคือโปรแกรมคอมพิวเตอร์นี่หน่า
zh_hans: 学习编程可能令人生畏。 然而，你想要制作游戏，那么[b]除了学习编程别无他法[/b]。[i]所有[/i]游戏都是计算机程序。
zh_hant: 學習程式可能令人恐懼。 然而，你想要做遊戲，那就[b]不可能避開學習撰寫程式[/b]。[i]每個[/i]電玩遊戲都是電腦程式。

source: Programming is the process of writing precise instructions that tell a computer how to perform a task. A game's instructions are, for example: moving a character, drawing a life bar, or playing a sound.
hu: A programozás az a folyamat, amikor precíz utasításokat írunk, hogy elmondjuk a számítógépnek, hogyan hajtson végre egy feladatot. Egy játék utasításai példál a következők lehetnek: egy karakter mozgatása, életerőcsík kirajzolása, vagy egy hang lejátszása.
pt_br: Programação é o processo de escrever instruções precisas que informam a um computador como realizar uma tarefa. As instruções de um jogo são, por exemplo: mover um personagem, desenhar uma barra de vida ou tocar um som.
th: การเขียนโปรแกรม คือ กระบวนการเขียน ชุดคำสั่ง ที่มีความเฉพาะเจาะจงแบบเป๊ะ ๆ เพื่อบอกให้คอมพิวเตอร์ทำงานอะไรสักอย่าง สมมติว่าเราจะสร้าง ชุดคำสั่ง สำหรับเกมส์ อาจจะเป็นได้ว่า: ขยับตัวฮีโร่เราไปข้างหน้า, อัพเดตแถบเลือด, เล่นเสียงเอฟเฟคตอนยิงปืน เป็นต้น
zh_hans: 编程就是写出精确的指令的过程，告诉计算机如何执行某项任务。 就比如游戏的指令有：移动角色、绘制血条、播放音效等等。
zh_hant: 程式是撰寫精確指示告訴電腦該如何做事的過程。 而遊戲的指示有，像是：移動角色、繪製生命條，或播放音效。

source: Programming languages are different from natural ones like English or Spanish. The computer does not think. Unlike us, it can't [i]interpret[/i] what you tell it. You can't tell it something vague like "draw a circle." Which circle? Where? Which color should it be? How big should it be?
pt_br: Linguagens de programação são diferentes das linguagens naturais, como inglês ou espanhol. O computador não pensa. Ao contrário de nós, ele não pode [i]interpretar[/i] o que você diz. Você não pode dizer algo vago como "desenhe um círculo". Qual círculo? Onde? Qual cor ele deve ter? O quão grande ele deve ser?
zh_hans: 编程语言和英语、西班牙语之类的自然语言不同。计算机不会思考。与我们不同，它不会 [i]解释[/i] 你告诉它的内容。 你不能让它去做一些模糊的事情，比如“画一个圆”。 哪个圆？画到哪里？该用什么颜色画？该画多大？

source: To draw a filled circle, the computer needs to know exact drawing coordinates, the radius, the thickness, and color you want. The code to do so [i]may[/i] look like this. [i]Click the button to run the code example and see the result.[/i]
hu: Ahhoz, hogy egy teli kört rajzoljon, a számítógépnek tudnia kell a pontos koordinátákat, a sugarat, a vastagságot, és a kívánt színt. A szükséges kód [i]valahogy így[/i] nézhet ki. [i]Kattints a gombra, hogy futtasd a kódot és lásd az eredményét.[/i]
pt_br: Para desenhar um círculo preenchido, o computador precisa saber as coordenadas exatas do desenho, o raio, a espessura e a cor desejada. O código para fazer isso [i]pode[/i] ficar assim. [i]Clique no botão para executar o código de exemplo e ver o resultado.[/i]
th: เอาล่ะ ถ้าจะวาดวงกลมที่ระบายสีทึบ คอมพิวเตอร์ต้องการรู้ว่า วาดที่พิกัดตรงไหน รัศมีเท่าไหร่ เส้นหนาแค่ไหน สีที่ต้องการ โค้ด ที่ทำงาน [i]อาจจะหน้าตาประมาณนี้[/i] [i]คลิกปุ่ม เพื่อเรียกใช้โค้ดตัวอย่าง และลองสังเกตผลลัพธ์[/i]
zh_hans: 要绘制填充的圆形，计算机需要确切知道你想要的绘制坐标、半径、厚度、颜色。 相应的代码[i]可能[/i]类似这样。 [i]点击按钮运行示例代码，查看结果。[/i]
zh_hant: 要繪製塗滿的圓圈，電腦需要知道你想要的繪製座標、半徑、厚度，還有顏色。 程式碼看起來[i]可能[/i]是這個樣子。 [i]點擊按鈕以執行範例程式碼並查看結果。[/i]

source: In the following lessons, you'll learn how this code works. For now, we want to give you a sense of what computer code looks like. In this example, everything matters: each parenthesis, capital letter, period, and comma. The computer always does [b]exactly[/b] what you tell it to. No more, no less. It [i]blindly[/i] follows every instruction. [b]When you program, you're the one in charge, and you're free to do [i]anything[/i] you want.[/b]
hu: Az elkövetkezendő leckékben meg fogod tanulni, hogy működik ez a kód. Egyelőre, csak egy kis ízelítőt akartunk mutatni abból, hogy néz ki a számítógépes kód. Ebben a példában minden számít: az összes zárójel, a nagybetűk, a pont és a vessző. A számítógép mindig [b]pontosan[/b] azt teszi, amit mondasz neki. Se többet, se kevesebbet. [i]Vakon[/i] követ minden utasítást. [b]Amikor programozol, te irányítasz, és [i]bármit[/i] megtehetsz.[/b]
pt_br: Nas aulas a seguir, você aprenderá como esse código funciona. Por enquanto, queremos dar uma ideia de como se parece um código de computador. Neste exemplo, tudo importa: cada parêntese, letra maiúscula, ponto e vírgula. O computador sempre faz [b]exatamente[/b] o que você manda. Nem mais nem menos. Ele [i]cegamente[/i] segue todas as instruções. [b]Quando você programa, você é quem manda e é livre para fazer [i]qualquer coisa[/i] que quiser.[/b]
th: ในบทเรียนต่อไปนี้ คุณจะได้เรียนรู้เกี่ยวกับวิธีการทำงานของโค้ดนี้ สำหรับตอนนี้ เราต้องการให้คุณเข้าใจก่อนว่าโค้ดคอมพิวเตอร์เป็นยังไง จากตัวอย่างนี้ ทุกอย่างนี้ล้วนมีความสำคัญ: วงเล็บแต่ละตัว ตัวพิมพ์ใหญ่ จุด และลูกน้ำ คอมพิวเตอร์จะกระทำทุกสิ่งที่คุณบอก[b]เสมอ[/b] ไม่มากไม่น้อยไป มัน [i]ทำโดยไม่สนใจ[/i]ทำทุกคำสั่งของคุณ [b]เมื่อคุณสร้างโปรแกรมขึ้นมาแล้วคุณคือผู้ที่ต้องรับผิดชอบ และคุณก็มีอิสระที่จะทำ [i]ทุกสิ่ง[/i] ที่ใจคุณปรารถนาได้[/b]
zh_hans: 接下来的课程中，你会学到这段代码的工作原理。 目前，我们只是想让你感受一下计算机代码是什么样子的。在这个例子中，一切都很重要：每一个括号、大写字母、句点、逗号。 计算机总是会[b]完全[/b]遵照你告诉他的内容行事，不多也不少，会[i]盲目地[/i]遵循每一条指令。 [b]编程时，掌控一切的是你，你可以做[i]任何[/i]你想做的事情。[/b]
zh_hant: 在接下來的課程中，你會學習到這個程式碼是怎麼運作的。 現階段，我們只是想給你電腦程式碼看起來的感覺。在這個範例中，每件事都很重要：每個小括號、大小寫、句號，還有逗號。 電腦永遠會[b]完全遵照[/b]你告訴它要做的事。不多，不少。它[i]盲目地[/i]跟隨每一步指示。 [b]撰寫程式時，控制權在你身上，你能做[i]任何[/i]想做的事。[/b]

source: In this course, you'll learn the GDScript programming language (the name stands for "Godot script"). This is a language by game developers for game developers. You can use it within the Godot game engine to create games and applications. It's the language used by games like [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] and [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url]. Engineers at Tesla also used it for their cars' dashboards.
zh_hans: 本教程中，你会学习 GDScript 编程语言（意思是“Godot script”，Godot 脚本）。 这是一门由游戏开发者开发、为游戏开发者而生的语言。你可以在 Godot 游戏引擎中用它来制作游戏和应用程序。 像游戏 [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] 和 [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]土豆兄弟[/url]都是用Godot制作的. 特斯拉的工程师用它制作了汽车的仪表盘。

source: Don't be afraid of being locked in. The concepts you learn in your first programming language will apply to all the others. Most languages have more similarities than differences. Once you learn one, it takes much less time to become productive with the next one. Here's an example of the same code in three languages: GDScript, JavaScript, and Python. Try to spot the similarities and differences.
hu: Ne aggódj amiatt, hogy egy zárt rendszerbe kerülsz. A fogalmak, amiket megtanulsz az első nyelvedben, érvényesek lesznek az összes többiben is. A legtöbb nyelvben több a hasonlóság, mint az eltérés. Ha egyet megtanulsz, akkor sokkal kevesebb ideig fog tartani, hogy produktív legyél egy másikban is. Itt egy példa, ugynarra a kódra, 3 nyelven: GDScript, JavaScript és Python. Próbáld meg észrevenni a hasonlóságokat és a különbségeket.
pt_br: Não tenha medo de ficar preso nessa linguagem. Os conceitos que você aprende na sua primeira linguagem de programação vão se aplicar para todas as outras. A maioria das linguagens possuem mais similaridades do que diferenças. Uma vez que você aprende uma, leva muito menos tempo para se tornar produtivo com a próxima. Aqui tem um exemplo de um mesmo código em três linguagens: GDScript, JavaScript e Python. Tente achar as similaridades e as diferenças.
th: ไม่ต้องกลัวที่จะถูกล็อคเพราะแนวคิดที่คุณเรียนรู้ในภาษาโปรแกรมที่เป็นภาษาแรกของคุณนั้นสามารถนำไปใช้กับภาษาอื่นๆได้ทั้งหมด ภาษาส่วนใหญ่มีความเหมือนกันมากอาจจะแตกต่างกันนิดหน่อย เมื่อคุณเรียนรู้สิ่งใดสิ่งหนึ่งแล้ว มันจะช่วยลดเวลามากในการทำงานกับภาษาอื่นๆต่อไป นี่คือตัวอย่างโค้ดเดียวกันที่เขียนด้วยสามภาษา: GDScript, JavaScript และ Python ลองสังเกตความเหมือนและความแตกต่างดู
zh_hans: 不要担心会被限制住。你在第一门编程语言中学到的概念也适用于其他语言。 大多数语言之间相同点远比不同点要多。一旦你学会了一门语言，熟练掌握下一门所需的时间就会少很多。 以下是使用三种语言编写的相同代码：GDScript、JavaScript、Python。 请找一找它们的相同点和不同点。
zh_hant: 不用擔心被困住。你在第一個程式語言中學到的概念能套用在其他所有語言。 大部分的語言相似處都多於相異處。學會一個後，要在下個語言取得生產力的時間便縮短許多。 這裡有個用三種語言寫同樣程式碼的例子，分別為：GDScript、JavaScript，和Python。 請試著看出相似處與相異處。
