Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-3-standing-on-shoulders-of-giants.po
Languages: hu, pl, pt, sk, sv, tr, zh_hans

source: The value of [code]0.3[/code] is an angle in [i]radians[/i]. In daily life, we're used to measuring angles in degrees. The radian is another scale commonly used in video games and math. You can convert radians into degrees by multiplying them by 180 and dividing them by PI: [code]degrees = radians * 180 / PI[/code] An angle of [code]PI[/code] radians corresponds to [code]180[/code] degrees. And [code]2 * PI[/code] is a full turn: [code]360[/code] degrees. [b]How do radians work exactly?[/b] Radians are a way to measure angles based on the radius of a circle. To get the angle in radians, you take the circle's radius and wrap it around the circle. That angle is [code]1[/code] radian because you are wrapping the radius [code]1[/code] time around the circle. Because the perimeter of a circle is [code]2 * PI * radius[/code], a full turn (360°) corresponds to [code]2 * PI[/code] radians: you need to wrap the radius of a circle [code]2 * PI[/code] times around the circle to make a full circle.
pl: Wartość [code]0.3[/code] to kąt w [i]radianach[/i]. W życiu codziennym jesteśmy przyzwyczajeni do mierzenia kątów w stopniach. Radian to kolejna skala powszechnie używana w grach wideo i matematyce. Możesz przekonwertować radiany na stopnie, pomnóż je przez 180 i podziel przez PI: [code]degrees = radians * 180 / PI[/code] Kąt radianów [code]PI[/code]odpowiada [code]180[/code] stopniom. Zaś [code]2 * PI[/code] to pełny obrót [code]360[/code] stopni. [b]Jak dokładnie działają radiany?[/b] Radiany to sposób mierzenia kątów na podstawie promienia okręgu. Aby uzyskać kąt w radianach, bierzesz promień okręgu i owijasz go wokół okręgu. Ten kąt to [code]1[/code] radian, ponieważ owijasz promień [code]1[/code] raz wokół okręgu. Ponieważ obwód okręgu to [code]2 * PI * radius[/code], pełny obrót (360°) odpowiada [code]2 * PI[/code] radianom: musisz owinąć promień okręgu [code]2 * PI[/code] razy wokół niego, aby utworzyć pełny okrąg.
pt: O valor [code]0.3[/code] é um ângulo em [i]radiano[/i]. No nosso dia a dia, estamos acostumados a medir ângulos em graus. O radiano é uma outra medida usada em jogos e na matemática. Pode converter radiano em graus multiplicando o valor por 180 e depois dividindo o resultado por PI: [code]graus = radiano * 180 / PI[/code] Um ângulo que possui [code]PI[/code] radiano corresponde a [code]180[/code] graus. E [code]2 * PI[/code] é uma volta completa no círculo: [code]360[/code] graus. [b]Como exatamente funciona o radiano?[/b] Radiano é um jeito de medir ângulos baseados no raio de um círculo. Para obter o ângulo em radiano, toma o valor do raio do círculo e envolve-o ao redor do círculo. Esse ângulo é [code]1[/code] radiano porque envolve o raio [code]1[/code] vez ao redor do círculo. Por causa que o perímetro do círculo é [code]2 * PI * raio[/code], uma volta completa (360°) corresponde a [code]2 * PI[/code] radiano: precisa envolver o raio de um círculo [code]2 * PI[/code] vezes em volta do círculo para fazer um círculo completo.
sv: Värdet på [code]0.3[/code] är en vinkel i [i]radianer[/i]. I det dagliga livet är vi vana vid att mäta vinklar i grader. Radianen är en annan skala som ofta används i videospel och matematik. Du kan omvandla radianer till grader genom att multiplicera dem med 180 och dividera dem med PI: [code]degrees = radians * 180 / PI[/code] En vinkel med [code]PI[/code] radianer motsvarar [code]180[/code] grader. Och [code]2 * PI[/code] är ett helt varv: [code]360[/code] grader. [b]Hur fungerar radianer exakt?[/b] Radianer är ett sätt att mäta vinklar baserat på en cirkels radie. För att få vinkeln i radianer tar du cirkelns radie och lindar den runt cirkeln. Den vinkeln är [code]1[/code] radian eftersom du lindar radien [code]1[/code] gång runt cirkeln. Eftersom omkretsen av en cirkel är [code]2 * PI * radie[/code], motsvarar ett helt varv (360°) [code]2 * PI[/code] radianer: du måste linda radien på en cirkel [code]2 * PI[/code] gånger runt cirkeln för att göra en hel cirkel.
tr: [code]0.3[/code] değeri [i]radyan[/i] cinsinden bir açıdır. Günlük hayatta, açıları genelde derece ile ölçeriz. Radyan ise matematikte ve bilgisayar oyunlarında sıkça kullanılan başka bir ölçü birimidir. Radyan değerleri derece değerine çevirmek için 180 ile çarpıp PI sayısı ile böleriz. [code]derece = radyan* 180 / PI[/code] Bir başka deyişle, bir [code]PI[/code] radyanlık açı [code]180[/code] derecelik açıya (yarım dönme) karşılık gelir. [code]2 * PI[/code] radyan ise bir tam dönüş demektir: [code]360[/code] derece. [b]Radyan tam olarak nasıl işliyor?[/b] Radyan, bir dairenin yarıçapı üzerinden açı ölçmek için bir yoldur. Açıyı radyan cinsinden bulmak için, dairenin yarıçap uzunluğunu alın ve bunu dairenin etrafına sarın. Bunun açısı [code]1[/code] radyan olacaktır çünkü yarıçapı daire etrafına sadece [code]1[/code] kez sardınız. Bir dairenin çevre uzunluğu [code]2 * PI * yarıçap[/code] olduğu için, bir tam dönüş miktarı [code]2 * PI[/code] radyana karşılık gelir: dairenin tamamını kaplamak için, dairenin yarıçap uzunluğunu dairenin üzerine [code]2 * PI[/code] kere sarmanız gerekir.
zh_hans: [code]0.3[/code] 的值是以 [i]radians[/i] 为单位的角度。在日常生活中，我们习惯于以度数来测量角度。弧度是视频游戏和数学中常用的另一种尺度。 你可以通过将弧度乘以 180 再除以 PI 来将弧度转换为度数： [code]度数 = 弧度 * 180 / PI[/code] [code]PI[/code] 弧度的角度对应于 [code]180[/code] 度。而 [code]2 * PI[/code] 是一个完整的转角：[code]360[/code] 度。 [b]弧度究竟是如何工作的？[/b] 弧度是一种根据圆的半径测量角度的方法。 要获得以弧度表示的角度，请取圆的半径并将其环绕在圆周围。该角度是 [code]1[/code] 弧度，因为你将半径 [code]1[/code] 时间绕圆。 因为圆的周长是[code]2 * PI * radius[/code]，所以一整圈（360°）对应的是[code]2 * PI[/code]弧度：你需要把圆的半径包起来[code]2 * PI[/code] 绕圈转一圈。

source: It calls the function named "show."
pl: Wywołuje funkcję o nazwie „show”
pt: Ele chama a função chamada "show"

source: Another example: With the [code]move_local_x()[/code] function, you can move the character to its left and right. The function takes one argument: a number of pixels to offset the entity. The complementary function [code]move_local_y()[/code] makes the [i]sprite[/i] move up and down. This is one way to move a character in a game, although we'll see more powerful ways to do this later.
pl: Inny przykład: za pomocą funkcji [code]move_local_x()[/code] możesz przesuwać postać w lewo i w prawo. Funkcja ta przyjmuje jeden argument: liczbę pikseli do przesunięcia jednostki. Funkcja komplementarna [code]move_local_y()[/code] sprawia, że [i]sprite[/i] porusza się w górę i w dół. Jest to jeden ze sposobów poruszania postacią w grze, chociaż później odkryjemy bardziej skuteczne sposoby na zrobienie tego.
pt: Outro exemplo: com a função [code]move_local_x()[/code], pode mover a personagem para a esquerda e direita dele. Essa função requer um argumento: um número de pixel para deslocar a entidade. A função complementar [code]move_local_y()[/code] faz com que a [i]sprite[/i] se mova para cima e para baixo. Esse é apenas um jeito de mover uma personagem num jogo. Veremos mais tarde maneiras mais poderosas de fazer isso.

source: With positive values ([code]20[/code]), the code above moves the robot to the right and down. This is probably different than what you studied at school: in math classes, the horizontal axis points to the right, like here, but the vertical axis points up. In video games, and generally in 2D computer graphics, the vertical axis points down instead. So whenever you move something on the Y-axis with a positive value, it'll move [i]down[/i].
pl: W przypadku wartości dodatnich ([code]20[/code]), powyższy kod przesuwa robota w prawo i w dół. Prawdopodobnie różni się to od tego, czego uczyłeś się w szkole: na lekcjach matematyki oś pozioma skierowana była w prawo (czyli tak jak tutaj), jednak oś pionowa skierowana była w górę. W grach wideo i ogólnie w grafice komputerowej 2D oś pionowa jest jednak skierowana w dół. Przez to za każdym razem, gdy przesuniesz coś na osi Y o wartość dodatnią, przesunie się ona [i]w dół[/i].
pt: Com o valor positivo ([code]20[/code]), o código acima move o robô para a direita e para baixo. Isso provavelmente é diferente do que deve ter estudado na escola: nas aulas de matemática, o eixo horizontal aponta para a direita, igual aqui, mas o eixo vertical aponta para cima. Em jogos, e geralmente em computação gráfica em 2D, o eixo vertical aponta para baixo ao invés de para cima. Então toda vez que move alguma coisa no eixo Y com um valor positivo, ela vai se mover [i]para baixo[/i].
sv: Med positiva värden ([code]20[/code]) flyttar koden ovan roboten åt höger och nedåt. Det här är förmodligen annorlunda än hur du lärde dig i skolan: i matematikklasser pekar den horisontella axeln åt höger, som här, men den vertikala axeln pekar uppåt. I videospel, och i tvådimensionell datorgrafik i allmänhet , pekar den vertikala axeln istället nedåt. Så när du flyttar något på Y-axeln med ett positivt värde, kommer det att flyttas [i]nedåt[/i].
tr: Pozitif değerler ([code]20[/code]) ile, yukarıdaki kod robotu aşağı ve sağa hareket ettiriyor. Bu muhtemelen okulda gördüğünüzden farklı gelmiştir: matematik derslerinde, yatay eksen sağa ve dikey eksen yukarıya bakar. Bilgisayar oyunlarında, ve genellikle 2D bilgisayar grafiklerinde, dikey eksen ters yöndedir ve aşağıya bakar. Yani, ne zaman bir şeyi Y-ekseninde pozitif bir değer ile hareket ettirirseniz, bu onu [i]aşağı[/i] götürecektir.
zh_hans: 对于正值（[code]20[/code]），上面的代码将机器人向右和向下移动。 这可能与你在学校学习的不同：在数学课上，水平轴指向右侧，就像这里一样，但垂直轴指向上方。 在视频游戏中，通常在 2D 计算机图形中，垂直轴指向下方。 所以每当你在 Y 轴上移动一个正值的东西时，它就会移动 [i]down[/i]。

source: To call a function, you need to write its exact name followed by an opening and a closing parenthesis. If the function requires one or more [i]arguments[/i], you add them inside the parentheses. Whether you need to do that or not depends on the function.
pl: Aby wywołać funkcję, musisz wpisać jej dokładną nazwę, po której następuje otwierający i zamykający nawias. Jeśli funkcja wymaga co najmniej jednego [i]argumentu[/i], dodajesz go/je w nawiasach. To, czy musisz to zrobić, czy nie, zależy od funkcji.
pt: Para chamar uma função, precisa escrever o nome dela exato seguido por uma abertura e fechamento de parêntesis. Se a função requer um ou mais [i]argumentos[/i], adiciona-os dentro do parêntese. Se precisa ou não pôr argumentos vai depender da função.
sv: För att anropa en funktion måste du skriva dess exakta namn följt av en inledande och en avslutande parentes. Om funktionen kräver ett eller flera [i]argument[/i], lägger du till dem inom parentesen. Om argument behövs eller inte beror på funktionen.
tr: Bir fonksiyonu çağırmak için, önce tam ismi sonra açık ve kapalı parantezler yazılır. Eğer fonksiyona girdi [i]değişkenleri[/i] gerekiyorsa, bunlar parantez içine eklenir. Bunun gerekip gerekmediği tamamen fonksiyona bağlıdır.
zh_hans: 要调用函数，你需要写下它的确切名称，后跟一个左括号和一个右括号。 如果函数需要一个或多个 [i] 参数[/i]，则将它们添加到括号内。 是否需要这样做取决于功能。

source: Our robot character's invisible! Call the [code]show()[/code] function to make it appear. Please call [code]show()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
pl: Nasza postać robota stała się niewidzialna! Wywołaj funkcję [code]show()[/code], aby się pojawiła. Wywołaj [code]show()[/code] wewnątrz funkcji [code]run()[/code] w wierszu [code]2[/code] i zachowaj znak [code]TAB[/code] na początku linii. Komputer potrzebuje go, aby zrozumieć twój kod.
pt: A nossa personagem robô está invisível! Chame a função [code]show()[/code] para fazê-la aparecer. Por favor, chame a função [code]show()[/code] na função [code]run()[/code] na linha número [code]2[/code] e mantenha o [code] caractere de tabulação[/code] no início da linha. O computador precisa disso para entender o seu código.
sv: Vår robotkaraktär är osynlig! Anropa funktionen [code]show()[/code] för att få den att visas. Anropa [code]show()[/code] i funktionen [code]run()[/code] på rad [code]2[/code] och se till att behålla [code]Tab[/code]-tecknet i början av raden. Datorn behöver det för att förstå din kod.
tr: Robot karakterimiz şu an görünmez durumda. [code]show()[/code] (göster) fonksiyonunu çağırıp görünmesini sağlayın. Lütfen [code]show()[/code] çağırmasını [code]run()[/code] fonksiyonunun içinde, [code]2[/code]. satırda yapın, satır başındaki [code]Sekme[/code] karakterini silmeyin. Bilgisayar kodunuzu anlamak için buna ihtiyaç duyuyor.
zh_hans: 我们的机器人角色是隐形的！ 调用 [code]show()[/code] 函数使其出现。 请在 [code]run()[/code] 函数内调用 [code]show()[/code]，在 [code]2[/code] 行，并保持 [code]Tab[/code] 字符为 行的开始。 计算机需要它来理解你的代码。

source: The robot was turned by [code]-0.5[/code] radians. You need to make it upright by calling the [code]rotate()[/code] function. Please call [code]rotate()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
pl: Robot został obrócony o [code]-0.5[/code] radiana. Musisz to naprawić, wywołując funkcję [code]rotate()[/code]. Wywołaj [code]rotate()[/code] wewnątrz funkcji [code]run()[/code], w wierszu [code]2[/code] i zachowaj znak [code]TAB[/code] na początku linii. Komputer potrzebuje tego, aby zrozumieć twój kod.
pt: O robô foi rotacionado por [code]-0.5[/code] radiano. Precisa deixar ele reto chamando a função [code]rotate()[/code]. Por favor, chame a função [code]rotate()[/code] dentro da função [code]run()[/code] na linha número [code]2[/code] e mantenha o [code]caractere de tabulação[/code] no começo da linha. O computar precisa disso para entender o seu código.
sv: Roboten vändes med [code]-0,5[/code] radianer. Du måste göra den upprätt genom att anropa funktionen [code]rotate()[/code]. Anropa [code]rotate()[/code] i funktionen [code]run()[/code] på rad [code]2[/code] och behåll [code]Tab[/code]-tecknet på början av raden. Datorn behöver det för att förstå din kod.
tr: Robotumuz [code]-0.5[/code] radyan dönmüş durumda. [code]rotate()[/code] (döndür) fonksiyonunu çağırarak onun tekrar yukarı yönde durmasını sağlayın. [code]rotate()[/code] çağrısını, [code]run()[/code] fonksiyonu içinde, [code]2[/code]. satırda yapın, ve [code]Sekme[/code] karakterini silmediğinizden emin olun. Bilgisayar kodunuzu anlamak için buna ihtiyaç duyuyor.
zh_hans: 机器人转动了 [code]-0.5[/code] 弧度。 你需要通过调用 [code]rotate()[/code] 函数使其直立。 请在 [code]run()[/code] 函数内调用 [code]rotate()[/code]，在 [code]2[/code] 行，并将 [code]Tab[/code] 字符保持在 行的开始。 计算机需要它来理解你的代码。

source: We use parentheses to call functions because you can give the function [i]arguments[/i] inside the parentheses when calling it. Here's a [i]sprite[/i] standing straight. If we call the [code]rotate(0.3)[/code] function, the character [i]sprite[/i] turns by 0.3 radians.
tr: Fonksiyonları çağırırken parantezler kullanıyoruz, çünkü bu şekilde onları çağırırken parantez içinde [i]girdi değişkenleri[/i] verebiliriz. Bu örnekte bir [i]grafik öğe[/i] dik şekilde duruyor. Eğer [code]rotate(0.3)[/code] fonksiyon çağrısı yaparsak, karakterimizin [i]grafik öğesi[/i] 0.3 radyan kadar dönecektir. ("run()" tuşuna birçok kez basabilirsiniz).
zh_hans: 我们使用括号来调用函数，因为你可以在调用函数时在括号内给出函数的[i]参数[/i]。 这是一个[i]精灵[/i]（Sprite）笔直站立的画面。 如果我们调用 [code]rotate(0.3)[/code] 函数，角色[i]精灵[/i]会转动 0.3 个弧度单位。

source: Another example: With the [code]move_local_x()[/code] function, you can move the character to its left and right. The function takes one argument: a number of pixels to offset the entity. The complementary function [code]move_local_y()[/code] makes the character move up and down. This is one way to move a character in a game, although we'll see more powerful ways to do this later.
tr: Başka bir örnek: [code]move_local_x()[/code] fonksiyonu (hareket_yerel_x) ile, bir karakteri sola ve sağa hareket ettirebilirsiniz. Fonksiyonun bir tane girdi değişkeni var: varlığı kaydırmak için gereken piksel (benek ya da nokta da denir) sayısı. Bunu tamlayan [code]move_local_y()[/code] (hareket_yerel_y) fonksiyonu ise karakteri aşağı ve yukarı hareket ettirir. Bu bir karakteri oyun içinde hareket ettirmenizin sadece bir yoludur. İlerledikçe bunu yapmanın daha etkili yollarını göreceksiniz.
zh_hans: 另一个例子：使用 [code]move_local_x()[/code] 函数，你可以将字符左右移动。 该函数采用一个参数：偏移实体的像素数。 补充函数 [code]move_local_y()[/code] 使角色上下移动。 这是在游戏中移动角色的一种方法，尽管稍后我们会看到更强大的方法来做到这一点。
