Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-5-your-first-function.po
Languages: hu, it, ja, nl, pl, ru, sv, tr, zh_hans

source: Now you created a function to draw squares, you can reuse it by calling it multiple times.
hu: Most, hogy elkészült a négyzet rajzoló függvényed, újra felhasználhatod azt, többszöri hívással.
it: Ora hai creato una funzione che disegna quadrati, la puoi riutilizzare chiamandola varie volte.
ja: これで正方形を描画する関数が作成されました。これを複数回呼び出すことで再利用できます。
nl: Nu je een functie hebt gemaakt om vierkanten te tekenen, kun je deze hergebruiken door hem meerdere keren aan te roepen.
pl: Jako że stworzyłeś funkcję do rysowania kwadratów, możesz jej użyć ile razy chcesz, wywołując ją ponownie.
ru: Теперь, когда вы создали функцию рисующую квадраты, её можно переиспользовать — вызвать несколько раз.
sv: Nu har du skapat en funktion för att rita rutor, du kan återanvända den genom att anropa den flera gånger.
tr: Şimdi, kare çizen bir fonksiyon oluşturduğuna göre, artık bunu bir çok kere çağırarak defalarca kullanabilirsin.
zh_hans: 现在你创建了一个绘制正方形的函数，你可以通过多次调用它来重用它。

source: Coding Your First Function
hu: Az első függvényed megírása
it: Programmando La Tua Prima Funzione
ja: 最初の関数をコーディングする
nl: Je eerste functie coderen
pl: Piszemy naszą pierwszą funkcję
ru: Создание вашей первой функции
sv: Koda din första funktion
tr: İlk Fonksiyonunu Kodlamak
zh_hans: 编写你的第一个函数

source: So far, we have called existing functions that other developers wrote. In this lesson, we'll talk more about what functions are and see some examples. Then, you will learn how to define your own functions.
it: Fino ad ora, ci siamo limitati a chiamare funzioni già esistenti scritte da altri programmatori. In questa lezione, parleremo meglio di cosa sono le funzioni e vedremo alcuni esempi. In seguito, imparerai a definire delle funzioni tutte tue.
ja: これまで、他の開発者が作成した既存の関数を呼び出してきました。 このレッスンでは、関数とは何かについて詳しく説明し、いくつかの例を見ていきます。 次に、独自の関数を定義する方法を学びます。
nl: Tot nu toe hebben we bestaande functies aangeroepen die andere ontwikkelaars hebben geschreven. In deze les zullen we meer bespreken wat functies zijn en enkele voorbeelden bekijken. Daarna leer je hoe je je eigen functies kunt definiëren.
ru: До сих пор, мы лишь вызывали существующие функции, написанные другими разработчиками. В этом уроке мы подробнее разберём что такое функции и посмотрим на некоторые примеры. В результате, вы научитесь объявлять собственные функции.
sv: Hittills har vi anropat befintliga funktioner som andra utvecklare skrivit. I den här lektionen ska vi prata mer om vad funktioner är och titta på några exempel. Därefter kommer du att lära dig hur du definierar dina egna funktioner.
tr: Şimdiye kadar, diğer geliştiricilerin yazdığı fonksiyonları çağırıyorduk. Bu derste, fonksiyonların ne oldukları hakkında konuşup birkaç örnek göreceğiz. Daha sonra, kendi fonksiyonlarınızı nasıl tanımlayacağını öğreneceksin.
zh_hans: 到目前为止，我们已经调用了其他开发人员编写的现有函数。 在本课中，我们将更多地讨论什么是函数并查看一些示例。 然后，你将学习如何定义自己的函数。

source: Functions are [i]sequences of instructions[/i] we give a name. We call that name an [i]identifier[/i]. Using the identifier, we can get the computer to execute all the instructions inside the function as many times as we need. This is what a [i]function call[/i] does.
it: Le funzioni sono [i]sequenze di istruzioni[/i] a cui diamo un nome. Questo nome è un [i]identificatore[/i]. Usando un identificatore, possiamo far eseguire al computer tutte le istruzioni all'interno di una funzione, tutte le volte che vogliamo. Questo è ciò che fa una [i]chiamata di funzione[/i].
ja: 関数は、名前を付けた[i]命令のシーケンス[/i]です。 この名前を [i]識別子[/i] と呼びます。 識別子を使用すると、コンピューターに関数内のすべての命令を必要なだけ実行させることができます。 これが [i]関数呼び出し[/i] の動作です。
nl: Functies zijn [i]reeksen instructies[/i] die we een naam geven. We noemen die naam een [i]identifier[/i]. Door de identifier te gebruiken, kunnen we de computer alle instructies in de functie zo vaak laten uitvoeren als we nodig hebben. Dit is wat een [i]functieaanroep[/i] doet.
ru: Функция — это [i]последовательность инструкций[/i], которой мы дали имя. Мы называем это имя [i]идентификатором[/i]. Используя этот идентификатор, мы можем приказать компьютеру выполнить инструкции внутри функции столько раз, сколько нам нужно. Вот что делает [i]вызов функции[/i].
sv: Funktioner är [i]sekvenser av instruktioner[/i] som vi ger ett namn. Vi kallar det namnet för en [i]identifierare[/i]. Med hjälp av identifieraren kan vi få datorn att utföra alla instruktioner i funktionen så många gånger som vi behöver. Detta är vad ett [i]funktionsanrop[/i] gör.
tr: Fonksiyonlar, onlara bir isim verdiğimiz [i]talimatlar dizisi[/i]dir. Bu isme bir [i]tanımlayıcı[/i] diyoruz. Bir tanımlayıcı kullanarak, bize gerektiği zaman ve sayıda, bilgisayarın, bir fonksiyonun içindeki talimatları çalıştırmasını sağlayabiliriz. Buna bir [i]fonksiyonu çağırmak[/i] denir.
zh_hans: 对一些[i]指令序列[/i]起个名字就是一个函数。 我们称这个名字为[i]标识符[/i]。 使用标识符，我们可以让计算机根据需要多次执行函数内的所有指令。 这就是 [i] 函数调用 [/i] 的作用。

source: In computer programming, we talk about [i]identifiers[/i] rather than "names". It is because a function name is a label the computer uses to precisely [i]identify[/i] and refer to a function or other code elements. Identifiers are unique: you cannot reuse the same name in a given [i]space[/i] in your code. If you try to name two functions the same, the computer will raise an error.
it: Nella programmazione, non parliamo di "nomi", ma di [i]identificatori[/i]. Questo perché il nome di una funzione è l'etichetta usata dal computer per [i]identificare[/i] e avere un riferimento relativo a una funzione o ad altre parti di codice. Gli identificatori sono unici: non puoi riutilizzare lo stesso nome in una determinata [i]area[/i] del tuo codice. Se provi a dare a due funzioni lo stesso nome, il computer ti restituirà un errore.
ja: コンピューター プログラミングでは、「名前」ではなく [i]識別子[/i] について話します。 関数名は、コンピュータが関数または他のコード要素を正確に[i]識別[/i]し、参照するために使用するラベルであるためです。 識別子は一意です。コード内の特定の [i]スペース[/i] で同じ名前を再利用することはできません。 2 つの関数に同じ名前を付けようとすると、コンピュータはエラーを発生させます。
nl: Bij computerprogrammeren hebben we het over [i]identifiers[/i] in plaats van "namen". Dat is omdat een functienaam een label is dat de computer gebruikt om een functie of andere code-elementen precies te [i]identificeren[/i] en ernaar te verwijzen. Identifiers zijn uniek: je kunt dezelfde naam niet hergebruiken in een bepaalde [i]ruimte[/i] in je code. Als je twee functies dezelfde naam probeert te geven, zal de computer een foutmelding geven.
ru: В программировании, мы называем «имена» [i]идентификаторами[/i]. Так принято, потому что имена используются компьютером, чтобы однозначно [i]идентифицировать[/i] функции или другие элементы кода. Идентификаторы уникальны: вы не можете использовать одно и то же имя для определения разных элементов в одной [i]области[/i] вашего кода. Если вы попытаетесь назвать две функции одинаково, компьютер покажет ошибку.
sv: Inom datorprogrammering talar vi om [i]identifierare[/i] snarare än "namn". Det beror på att ett funktionsnamn är en etikett som datorn använder för att exakt [i]identifiera[/i] och referera till en funktion eller andra kodelement. Identifierare är unika: du kan inte återanvända samma namn inom ett givet [i]rymd[/i] eller område i din kod. Om du försöker namnge två funktioner med samma namn kommer datorn att visa ett felmeddelande.
tr: Bilgisayar programcılığında, "isim"lerden çok [i]tanımlayıcılar[/i]dan bahsederiz. Bunun nedeni, bir fonksiyonun isminin, bilgisayar tarafından, bir fonksiyonu veya onun içindeki kod elemanlarını kesin bir şekilde [i]tanımlamak[/i] için kullanılan bir etiket olmasıdır. Tanımlayıcılar eşsizdir: aynı kod [i]alanında[/i] aynı ismi başka amaçla kullanamazsın. Eğer iki fonksiyona aynı ismi vermeyi denersen, bilgisayar sana hata verecektir.
zh_hans: 在计算机编程中，我们谈论 [i] 标识符 [/i] 而不是“名称”。 这是因为函数名称是计算机用来精确[i]识别[/i]并引用函数或其他代码元素的标签。 标识符是唯一的：你不能在代码的给定 [i]space[/i] 中重复使用相同的名称。 如果你尝试将给两个不同的函数起一样的名字，计算机将会报错。

source: If there is any code that you need to run multiple times, you can put it inside a function and give it a name. The instructions inside a function can be any code you want, and they will all run every time you call the function. Here's the example of a [code]move_and_rotate()[/code] function that moves the turtle forward and then turns it 90°.
it: Se c'è del codice che hai bisogno di eseguire più volte, puoi metterlo in una funzione e dargli un nome. Le istruzioni in una funzione possono essere qualsiasi cosa tu voglia, e verranno eseguite ogni volta che chiami la funzione. Ecco l'esempio di una funzione [code]move_and_rotate()[/code] che sposta la tartaruga in avanti e la ruota di 90°.
ja: 複数回実行する必要があるコードがある場合は、それを関数内に入れて名前を付けることができます。 関数内の命令は任意のコードにすることができ、関数を呼び出すたびにすべて実行されます。 これは、カメを前方に移動してから 90 度回転する [code]move_and_rotate()[/code] 関数の例です。
nl: Als er code is die meerdere keren moet worden uitgevoerd, kun je deze in een functie plaatsen en een naam geven. De instructies in een functie kunnen elke code zijn die je wilt, en ze zullen allemaal worden uitgevoerd elke keer dat je de functie aanroept. Hier is een voorbeeld van een [code]move_and_rotate()[/code] functie die de schildpad naar voren beweegt en dan 90° draait.
ru: Если вы хотите исполнить какой-то код несколько раз, вы можете поместить его в функцию и дать ей имя. Функция может содержать любые инструкции в виде кода, все эти инструкции будут выполнены при каждом вызове функции вами. Например, функция [code]move_and_rotate()[/code] при вызове переместит черепашку вперёд и повернёт её на 90°.
sv: Om det finns någon kod som du behöver köra flera gånger kan du lägga in den i en funktion och ge den ett namn. Instruktionerna i en funktion kan vara vilken kod du vill, och de kommer alla att köras varje gång du anropar funktionen. Här är exemplet på en funktion [code]move_and_rotate()[/code] som flyttar sköldpaddan framåt och sedan vrider den 90°.
tr: Eğer birden fazla sefer çalıştırman gereken bir kodun varsa, bunu bir fonksiyonun içine koyup ona bir isim verirsin. Fonksiyonun içindeki talimatlar, istediğin herhangi bir kod olabilir, ve fonksiyonu her çağırdığında hepsi çalışacaktır. Bir örnek olarak, kaplumbağayı önce ileri hareket ettirip sonra 90° döndüren [code]move_and_rotate()[/code] (hareket_ettir_ve_döndür) fonksiyonunu verebiliriz.
zh_hans: 如果有任何代码需要多次运行，可以将其放在函数中并给函数命名。 函数内的指令可以是你想要的任何代码，每次调用函数时它们都会运行。 下面是一个 [code]move_and_rotate()[/code] 函数的示例，该函数将海龟向前移动，然后将其旋转 90°。

source: The [code]move_and_rotate()[/code] function consists of two instructions, each on a separate line. Both of those instructions call another familiar function. You could write another function that calls [code]move_and_rotate()[/code] four times to draw a square of length 200 pixels.
it: La funzione [code]move_and_rotate()[/code] consiste in due istruzioni, ognuna su una riga diversa. Entrambe le istruzioni chiamano altre funzioni piuttosto familiari. Potresti scrivere un'altra funzione che chiama [code]move_and_rotate()[/code] quattro volte per disegnare un quadrato dai lati di 200 pixel.
ja: [code]move_and_rotate()[/code] 関数は、それぞれ別の行にある 2 つの命令で構成されます。 これらの命令は両方とも、別のよく知られた関数を呼び出します。 [code]move_and_rotate()[/code] を 4 回呼び出す別の関数を作成して、長さ 200 ピクセルの正方形を描画することもできます。
nl: De [code]move_and_rotate()[/code] functie bestaat uit twee instructies, elk op een aparte regel. Beide instructies roepen een andere bekende functie aan. Je zou een andere functie kunnen schrijven die [code]move_and_rotate()[/code] vier keer aanroept om een vierkant met een lengte van 200 pixels te tekenen.
ru: Функция [code]move_and_rotate()[/code] состоит из двух инструкций, каждая из которых расположена на отдельной строке. Обе инструкции вызывают другие, знакомые вам функции. Вы можете написать другую функцию вызывающую [code]move_and_rotate()[/code] четыре раза, чтобы нарисовать квадрат длиной в 200 пикселей.
sv: Funktionen [code]move_and_rotate()[/code] består av två instruktioner, var och en på en separat rad. Båda instruktionerna anropar en annan bekant funktion. Du skulle kunna skriva en annan funktion som anropar [code]move_and_rotate()[/code] fyra gånger för att rita en kvadrat med längden 200 pixlar.
tr: [code]move_and_rotate()[/code] fonksiyonu, ayrı satırlarda iki tane talimat içeriyor. Bu talimatların her ikisi de, oldukça tanıdık başka bir fonksiyonu çağırıyor. [code]move_and_rotate()[/code] fonksiyonunu dört kere kullanarak 200 piksel uzunluğunda bir kare çizdiren tamamen başka bir fonksiyonda yazabilirdin.
zh_hans: [code]move_and_rotate()[/code] 函数由两条指令组成，每条指令位于单独的一行。 这两条指令都调用了另一个熟悉的函数。 你可以编写另一个函数，调用 [code]move_and_rotate()[/code] 四次来绘制一个长度为 200 像素的正方形。

source: Every time we call [code]move_and_rotate()[/code], the two functions [code]move_forward(200)[/code] and [code]turn_right(90)[/code] are called in sequence. In this simple example, it may not feel super useful. Here's a more useful and realistic one: a function to draw any square. The following function uses [i]parameters[/i], which we will explore in the next lesson. [i]Drag the slider to change the square's size.[/i]
ja: [code]move_and_rotate()[/code] を呼び出すたびに、2 つの関数 [code]move_forward(200)[/code] と [code]turn_right(90)[/code] が順番に呼び出されます。 この単純な例では、それほど便利だとは思えないかもしれません。 これは、より便利で現実的な関数です。任意の正方形を描画する関数です。 次の関数は [i]パラメータ[/i] を使用します。これについては次のレッスンで説明します。 [i]スライダーをドラッグして正方形のサイズを変更します。[/i]
nl: Telkens wanneer we [code]move_and_rotate()[/code] aanroepen, worden achtereenvolgens de twee functies [code]move_forward(200)[/code] en [code]turn_right(90)[/code] aangeroepen. In dit eenvoudige voorbeeld voelt het misschien niet super nuttig aan. Hier is een nuttiger en realistischer voorbeeld: een functie om een willekeurig vierkant te tekenen. De volgende functie gebruikt [i]parameters[/i], die we in de volgende les zullen verkennen. [i]Versleep de schuifregelaar om de grootte van het vierkant te wijzigen.[/i]
ru: Каждый раз, когда мы вызываем [code]move_and_rotate()[/code], две функции [code]move_forward(200)[/code] и [code]turn_right(90)[/code] вызываются последовательно. В этом простом примере может показаться, что это не слишком полезно. Вот более полезный и реалистичный пример: функция, рисующая любой прямоугольник. Эта функция использует [i]параметры[/i], которые мы изучим в следующем уроке. [i]Используйте ползунок чтобы изменить размер квадрата.[/i]
sv: Varje gång vi anropar [code]move_and_rotate()[/code] anropas de två funktionerna [code]move_forward(200)[/code] och [code]turn_right(90)[/code], i den ordningen. Detta enkla exempel kanske inte känns superanvändbart. Här är ett mer användbart och realistiskt exempel: en funktion för att rita vilken rektangel som helst. Följande funktion använder [i]parametrar[/i], som vi kommer att utforska i nästa lektion. [i]Dra skjutreglaget för att ändra kvadratens storlek.[/i]
tr: [code]move_and_rotate()[/code] fonksiyonunu her çağırdığımızda, [code]move_forward(200)[/code] ve [code]turn_right(90)[/code] fonksiyonları sırasıyla çağırılır. Bu basit örnekte, bu sana süper kullanışlı gelmeyebilir. O halde işte sana daha kullanışlı ve gerçekçi olan: bir kare çizdiren fonksiyon. Aşağıdaki fonksiyon, [i]alınan değişkenler[/i] (parametre) kullanıyor, ki bunu sonraki derste işleyeceğiz. [i]Ayar çubuğunu kaydırarak karenin boyutunu değiştir.[/i]
zh_hans: 每次调用[code]move_and_rotate()[/code]时，[code]move_forward(200)[/code]和[code]turn_right(90)[/code]这两个函数会被依次调用。 在这个简单的例子中，可能感觉这样做不是很有用。 这有一个更有用更现实的例子：一个可以绘制任何正方形的函数。 以下函数使用 [i]parameters[/i]，我们将在下一课中探讨。 [i]拖动滑块改变正方形的大小。[/i]

source: Let's break down how you define a function. A function definition starts with the [code]func[/code] keyword followed by a space, the function's name, parentheses, and a colon.
it: Vediamo, passo passo, come definire una funzione. La definizione di una funzione comincia con la parola chiave [code]func[/code] seguita da uno spazio, il nome della funzione, un paio di parentesi, e i due punti.
ja: 関数を定義する方法を詳しく見てみましょう。 関数定義は、[code]func[/code] キーワードで始まり、その後にスペース、関数名、括弧、コロンが続きます。
nl: Laten we eens kijken hoe je een functie definieert. Een functiedefinitie begint met het sleutelwoord [code]func[/code], gevolgd door een spatie, de naam van de functie, haakjes en een dubbele punt.
ru: Давайте разберём, как же всё-таки объявить функцию. Объявление функции начинается с ключевого слова [code]func[/code], с последующим пробелом, именем функции, круглыми скобками и двоеточием.
sv: Låt oss undersöka hur du definierar en funktion. En funktionsdefinition börjar med nyckelordet [code]func[/code] följt av ett mellanslag, funktionens namn, parenteser och ett kolon.
tr: Hadi kendi fonksiyonunu nasıl tanımlayacağına bir göz atalım. Bir fonksiyon tanımı, [code]func[/code] anahtar kelimesi ile başlayıp, bir boşluk, fonksiyonun ismi, aç-kapa parantezleri, ve iki nokta üstüste ile biter.
zh_hans: 让我们分解一下如何定义函数。 函数定义以 [code]func[/code] 关键字开头，后跟空格、函数名称、括号和冒号。

source: The instructions inside the function [b]must[/b] all start with a leading tab character. You can insert that tab character by pressing the [b]Tab[/b] key. We call those leading tabs [i]indents[/i]. They're important: the computer uses them to know which instructions are part of the same code block.
it: Le istruzioni di una funzione [b]devono[/b] cominciare tutte con un carattere di tabulazione. Puoi inserire questo carattere premendo il tasto [b]Tab[/b]. Chiamiamo queste tabulazioni [i]indentazione[/i]. È molto importante: il computer la sfrutta per capire quali istruzioni fanno parte dello stesso blocco di codice.
ja: 関数内の命令はすべて先頭のタブ文字で始まる[b]必要[/b]があります。 [b]Tab[/b] キーを押すと、そのタブ文字を挿入できます。 これらの先頭のタブを [i]インデント[/i] と呼びます。 これらは重要です。コンピューターは、どの命令が同じコード ブロックの一部であるかを知るためにこれらを使用します。
nl: De instructies in de functie [b]moeten[/b] allemaal beginnen met een voorafgaand tab-teken. Je kunt dat tab-teken invoegen door op de [b]Tab[/b]-toets te drukken. We noemen deze voorlopende tabs [i]inspringingen[/i]. Ze zijn belangrijk: de computer gebruikt ze om te weten welke instructies deel uitmaken van hetzelfde codeblok.
ru: Все инструкции внутри функции [b]должны[/b] начинаться с ведущего символа табуляции. Вы можете вставить его с помощью кнопки [b]Tab[/b] на клавиатуре. Ведущие символы табуляции так же называют [i]отступами[/i]. Отступы важны: компьютер использует их чтобы узнать, какие инструкции являются частью одного и того же блока кода.
sv: Instruktionerna i funktionen [b]måste[/b] alla börja med ett inledande tabbtecken. Du kan infoga tabbtecknet genom att trycka på tangenten [b]Tab[/b]. Vi kallar de ledande tabbarna för [i]indrag[/i]. De är viktiga: datorn använder dem för att veta vilka instruktioner som ingår i samma kodblock.
tr: Fonksiyonun içindeki talimatların hepsi, satır başında en az bir sekme karakteri ile başlamak [b]zorundadır[/b]. Bir sekme karakterini klavyede [b]Sekme[/b] tuşuna (en solda iki yönlü iki ok) basarak ekleyebilirsiniz. Bu başa eklediğimiz sekme karakterlerine [i]girinti[/i] diyoruz. Bunlar çok önemli: bilgisayar bunları kullanarak, hangi talimatların aynı kod bölümüne ait olduklarını bilmek için kullanıyor.
zh_hans: 函数中的指令 [b] 必须[/b] 都以“前导制表符”开头。 你可以通过按 [b]Tab[/b] 键插入该制表符。 我们将这些“前导制表符”称为 [i] 缩进 [/i]。 它们很重要：计算机使用它们来分清楚哪些指令是属于同一个代码块。

source: Functions are groups of instructions we reuse every time we call the function. Because we give functions a name, they also allow us to name a set of instructions, which is handy!
it: Le funzioni sono gruppi di istruzioni che riutilizziamo ogni volta che chiamiamo una funzione. Dare un nome alle funzioni ci permette di dare un nome a una serie di istruzioni, il che è davvero comodo!
ja: 関数は、関数を呼び出すたびに再利用する命令のグループです。 関数に名前を付けると、一連の命令にも名前を付けることができるので便利です！
nl: Functies zijn groepen instructies die hergebruiken iedere keer dat we de functie aanroepen. Omdat we functies een naam geven, stellen ze ons ook in staat om een reeks instructies een naam te geven, wat handig is!
ru: Функции это группы инструкций, которые мы переиспользуем каждый раз, когда вызываем функцию. Поскольку мы даём функциям имена, они позволяют нам объединить множество инструкций, что очень удобно!
sv: Funktioner är grupper av instruktioner som vi återanvänder varje gång vi anropar funktionen. Eftersom vi ger funktioner ett namn, tillåter de oss också att namnge en uppsättning instruktioner, vilket är praktiskt!
tr: Fonksiyonlar, bunları her çağırdımızda tekrar kullandığımız talimatlar gurubudur. Fonksiyonlara bir isim verdiğimiz için, bu bize bir talimatlar dizisini isimlendirme olanağı da veriyor, ki bu çok kullanışlı!
zh_hans: 函数是我们每次调用函数时重用的指令组。 因为当我们给函数命名时，相当于我们命名了一组指令，这很方便！
