Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-25-creating-dictionaries.po
Languages: de, hu, nl, zh_hans

source: We want to change the item counts in the player's inventory whenever the player picks up or uses an item. We've started the [code]add_item()[/code] function for you. The [code]inventory[/code] dictionary should use the [code]item_name[/code] parameter as the key to access its values, and we should increase the value by [code]amount[/code]. To test this practice, we'll use your [code]add_item()[/code] function to increase the item count of Healing Heart, Gems, and Sword.
de: Wir wollen die Anzahl der Gegenstände in dem Inventar des Spielers verändern wenn ein Gegenstand aufgesammelt oder genutzt wird. Wir haben die [code]add_item()[/code] Funktion bereits angefangen. Das [code]inventory[/code] Dictionary sollte den [code]item_name[/code] Parameter als Schlüssel für den Wert nutzen und wir erhöhen den Wert um [code]amount[/code]. Um diesen Ablauf zu testen nutzen wir [code]add_item()[/code] Funktion um die Anzahl von Heilenden Herzen, Edelsteinen und Schwerter zu erhöhen.
nl: We willen het aantal items in de inventaris van de speler wijzigen telkens wanneer de speler een voorwerp oppakt of gebruikt. We hebben de functie [code]add_item()[/code] voor je opgezet. De dictionary [code]inventory[/code] moet de parameter [code]item_name[/code] gebruiken als sleutel om toegang te krijgen tot de waarden en we moeten de waarde verhogen met [code]amount[/code]. Om dit te testen, gebruiken we jouw [code]add_item()[/code] functie om het aantal items van Healing Heart, Gems en Sword te verhogen.
zh_hans: 我们希望在玩家拾取或使用物品时更改玩家背包中对应物品的数量。 我们已经给你开了个头，补全函数[code]add_item()[/code] （增加物品）。 [code]inventory[/code] 字典应该使用参数 [code]item_name[/code] （物品名称）作为访问其值的key，然后我们要将物品数量的值增加 [code]amount[/code]。 为了测试这次的练习，我们将使用你写好的 [code]add_item()[/code] 函数来增加healing heart、gem和sword的物品数量。
