Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-2-your-first-error.po
Languages: hu, it, ko, nl, pl, sk, sv, th, zh_hant

source: Errors are messages designed on purpose by fellow programmers who came before you. They anticipated you might have specific issues. You shouldn't think of errors as failures. They are like mentors helping you from the past. Importantly, errors won't break your computer. At least not with GDScript because it's a pretty safe language.
th: ข้อผิดพลาดคือข้อความที่ออกแบบมาโดยเจตนาจากเหล่าโปรแกรมเมอร์คนอื่นๆ ที่มาก่อนคุณ พวกเขาคาดเอาไว้ว่าคุณอาจมีปัญหาได้ คุณไม่ควรคิดว่าข้อผิดพลาดพวกนี้เป็นความล้มเหลว พวกเขาเหมือนกับพี่เลี้ยงที่ช่วยเหลือคุณจากอดีตและที่สำคัญข้อผิดพลาดจะไม่ทำให้คอมพิวเตอร์ของคุณเสียหายแน่นอนอย่างน้อยก็ไม่ใช่กับ GDScript แหละนะ เพราะมันเป็นภาษาที่ค่อนข้างปลอดภัย
zh_hant: 錯誤是由在你之前的程式設計師刻意設計的訊息。他們預期你會遇到特定的問題。 你不該把錯誤當成失敗。他們就像是來幫助你的過來人。更重要的，錯誤不會損壞你的電腦。至少GDScript不會，這是個相當安全的語言。

source: Are errors a good or a bad thing in code?
th: ข้อผิดพลาดเป็นสิ่งที่ดีหรือไม่ดีในโลกของโค้ด?
zh_hant: 程式碼的錯誤是好事還壞事？

source: Yes, errors are here to help you! Pay attention to them, and do your best to read and understand them. With experience, you'll learn to make your code work more reliably thanks to error messages.
th: ดี ข้อผิดพลาดอยู่เพื่อช่วยเหลือคุณ! ให้ความสนใจกับพวกมันและพยายามอย่างเต็มที่ในการอ่านและทำความเข้าใจมันด้วยประสบการณ์ คุณจะได้เรียนรู้วิธีที่จะทำให้โค้ดของคุณทำงานได้อย่างน่าเชื่อถือมากขึ้นจากข้อความที่แสดงข้อผิดพลาด
zh_hant: 沒錯，錯誤是來幫助你的！ 仔細注意，並且盡力閱讀理解它們。有了經驗，你會學到用錯誤來讓程式碼運作地更穩固。

source: They're bad: errors are always bad.
th: มันไม่ดีเลย: ข้อผิดพลาดนั้นแย่เสมอนั่นแหละ
zh_hant: 壞事：錯誤總是壞事。
