Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-10-the-game-loop.po
Languages: hu, it, nl, pl, pt_br, sv, zh_hans

source: As we've seen, Godot has functions that do certain actions. For example, the [code]show()[/code] and [code]hide()[/code] functions change the visibility of things. We can also create our own functions to make custom effects like adding or removing health to a character. Godot also has special functions we can customize or add to. Take the [code]_process()[/code] function.
hu: Ahogy már láthattuk, a Godotnak vannak különböző célú függvényei. Például a [code]show()[/code] és [code]hide()[/code] függvények a láthatóságot változtatják. Készíthetünk saját függvényeket is, hogy egyedi dolgokat hajtsanak végre, például a karakter életerejének növelése vagy csökkentése. A Godotnak vannak speciális függvényeoi is, melyeket testreszabhatunk vagy kiegészíthetünk. Nézzük meg a [code]_process()[/code] függvényt.
it: Come hai potuto vedere, Godot possiede funzioni che fanno determinate azioni. Per esempio, le funzioni [code]show()[/code] e [code]hide()[/code] modificano la visibilità delle cose. Pure noi possiamo creare funzioni che hanno effetti personalizzabili come aumentare o diminuire la vita di un personaggio. Godot possiede pure delle funzioni speciali che possono essere personalizzate. Un esempio è la funzione [code]_process()[/code].
nl: Zoals we gezien hebben, heeft Godot functies die bepaalde acties uitvoeren. Bijvoorbeeld, de functies [code]show()[/code] en [code]hide()[/code] veranderen de zichtbaarheid van dingen. We kunnen ook onze eigen functies maken om eigen effecten te maken, zoals het verhogen of verlagen van de gezondheid van een personage. Godot heeft ook speciale functies die we kunnen aanpassen of aanvullen. Neem bijvoorbeeld de [code]_process()[/code] functie.
pl: Jak dane nam było zobaczyć: Godot ma funkcje, które wykonują określone czynności. Na przykład funkcje [code]show()[/code] i [code]hide()[/code] , które zmieniają widoczność rzeczy. Możemy również tworzyć własne funkcje, aby tworzyć niestandardowe efekty, takie jak dodawanie lub usuwanie zdrowia postaci. Godot ma również specjalne funkcje, które możemy dostosować lub dodać. Weźmy na warsztat funkcję [code]_process()[/code].
pt_br: Como vimos, A Godot possui funções que realizam determinadas ações. Por exemplo, as funções [code]show()[/code] e [code]hide()[/code] mudam a visibilidade das coisas. Nós podemos também criar nossas próprias funções para criar efeitos personalizados, como adicionar ou remover a vida de um personagem. A Godot também tem funções especiais que podemos personalizar ou acrescentar algo a mais nelas. Olhe a função [code]_process()[/code] por exemplo.
sv: Som vi har sett har Godot funktioner som gör vissa handlingar. Till exempel, funktionerna [code]show()[/code] och [code]hide()[/code] ändrar synligheten för saker. Vi kan också skapa våra egna funktioner för att skapa anpassade effekter som att lägga till eller ta bort hälsa till en karaktär. Godot har även speciella funktioner som vi kan anpassa eller lägga till. Ta funktionen [code]_process()[/code].
zh_hans: 正如我们之前见到过的，Godot 具有执行某些操作功能的函数。例如，[code]show()[/code]（显示） 和 [code]hide()[/code]（隐藏） 函数会改变物体的可见性。 我们还可以创建自己的函数来实现自定义效果，例如为角色增加或减少生命值。 Godot 还有一些特殊函数具有一定的自定义功能。 以 [code]_process()[/code] 函数为例。

source: The [code]_process()[/code] function gets its name because it does calculations or continuous actions. It's like a juice factory that [b]processes[/b] juice bottles: the bottles are always moving along a conveyor belt, while different machines operate on them.
hu: A [code]_process()[/code] (folyamat) függvény neve onnan ered, hogy számításokat véget vagy folyamatosan végrehajt dolgokat. Olyan, mint egy [b]munkafolyamat[/b], ami üdítős üvegeket gyárt: az üvegek folymatosan mozognak a szalagon, miközben különböző gépek dolgoznak rajtuk.
it: La funzione [code]_process()[/code] prende il nome dal fatto il suo compito è quello di svolgere calcolazioni o azioni continue. La possiamo pensare come una fabbrica di cioccolato che [b]processa[/b] forme di cioccolatini: le forme si muovono lungo i nastri trasportatori, mentre diverse macchine operano su queste.
nl: De functie [code]_process()[/code] dankt haar naam aan het feit dat ze berekeningen of doorlopende acties uitvoert. Het is als een sapfabriek die [b]sapflessen verwerkt[/b]: de flessen bewegen altijd over een lopende band terwijl verschillende machines ze verwerken.
pl: Funkcja [code]_process()[/code] otrzymała taką a nie inną nazwę, ponieważ wykonuje obliczenia lub akcje ciągłe. To jak fabryka soków, która [b]przetwarza[/b] butelki z sokiem: butelki zawsze poruszają się po taśmie przenośnika, a w tym czasie działają sobie na nich różne maszyny.
pt_br: A função [code]_process()[/code] recebe esse nome porque faz cálculos ou ações contínuas. É como uma fábrica de suco que [b]processa[/b] garrafas de suco: as garrafas estão sempre se movendo ao longo de uma esteira transportadora, enquanto diferentes máquinas operam sobre elas.
sv: Funktionen [code]_process()[/code] får sitt namn eftersom den gör beräkningar eller kontinuerliga åtgärder. Det är som en juicefabrik som [b]bearbetar(processes)[/b] juiceflaskor: flaskorna rör sig alltid längs ett transportband, medan olika maskiner arbetar på dem.
zh_hans: [code]_process()[/code]（运行处理） 函数之所以得名，是因为它进行计算或持续的操作。 这就像一个果汁厂[b]process[/b]（处理，这里指罐装）果汁瓶：瓶子总是沿着传送带移动，与此同时不同的机器在它们上面运转。

source: It's similar in Godot, but this function can run [b]hundreds of times a second[/b].
hu: Ez a Godotban is hasonlóan működik, de ezek a folyamatok [b]másodpercenként többszázszor[/b] is lefuthatnak.
it: In Godot il concetto è simile, ma questa funzione può eseguire [b]centinaia di volte al secondo[/b].
nl: Het is net zo in Godot, maar deze functie kan [b]honderden keren per seconde[/b] worden uitgevoerd.
pl: Podobnie jest w Godocie, z taką różnicą, że funkcja ta może działać [b]setki razy na sekundę[/b].
pt_br: Esse processo funciona de forma parecida dentro da Godot, mas essa função pode ser executada [b]centenas de vezes por segundo[/b].
sv: Det är liknande i Godot, men den här funktionen kan köras [b]hundratals gånger i sekunden[/b].
zh_hans: 在 Godot 中也是类似的，只不过这个函数每秒可以运行 [b] 数百次 [/b]。

source: How many parameters does this function take?
hu: Hány paramétert fogad az alábbi függvény?
it: Quanti parametri richiede questa funzione?
nl: Hoeveel parameters heeft deze functie?
pl: Jak wiele parametrów przyjmuje pokazana funkcja?
pt_br: Quantos parâmetros essa função pode ter?
sv: Hur många parametrar tar denna funktion?
zh_hans: 这个函数有多少个参数？

source: The [code]_process()[/code] function takes one parameter: [code]delta[/code]. We'll look at what [code]delta[/code] is in the next lesson, as well as show how to use it.
hu: A [code]_process()[/code] függvény csak egy paramétert fogad: [code]delta[/code]. A következő leckében megnézzük mi is ez a [code]delta[/code], és megmutatjuk azt is, hogyan használd..
it: La funzione [code]_process()[/code] ha bisogno di un parametro: [code]delta[/code]. Capiremo cos'è [code]delta[/code] e come funziona nella prossima lezione.
nl: De functie [code]_process()[/code] heeft één parameter: [code]delta[/code]. We zullen in de volgende les bekijken wat [code]delta[/code] is en laten zien hoe je het gebruikt.
pl: Funkcja [code]_process()[/code] przyjmuje jeden parametr: [code]delta[/code]. W następnej lekcji przyjrzymy się, czym dokładnie jest ów [code]delta[/code], a także nauczymy się, jak z niej korzystać.
pt_br: A função [code]_process()[/code] recebe um parâmetro: [code]delta[/code]. Vamos ver o que é [code]delta[/code] na próxima lição, além de mostrar pra você como usá-lo.
sv: Funktionen [code]_process()[/code] tar en parameter: [code]delta[/code]. Vi ska titta på vad [code]delta[/code] är i nästa lektion, samt visa hur man använder det.
zh_hans: [code]_process()[/code] 函数有一个参数：[code]delta[/code]。 我们将在下一课中了解什么是 [code]delta[/code] ，并向你展示如何使用它。

source: The [code]_process()[/code] function won't do anything until we add something to it. You might notice the underscore [code]_[/code] in front of the function name. This is a convention programmers use to coordinate work, and it'll only make sense once you have experience coding in Godot. For now, all you need to know is that if the function exists in your code, and it is called precisely [code]_process[/code], then Godot will automatically run it every [i]frame[/i]. When Godot draws on the screen, we call that a frame.
it: La funzione [code]_process()[/code] non farà nulla finché non le aggiungeremo qualcosa. Si può notare il trattino basso [code]_[/code] davanti al nome della funzione. Si tratta di una convenzione che i programmatori usano per coordinare il lavoro e che avrà senso solo quando si avrà esperienza di codifica in Godot. Per ora è sufficiente sapere che se la funzione esiste nel codice ed è chiamata proprio [code]_process[/code], Godot la eseguirà automaticamente ogni [i]frame[/i]. Quando Godot disegna sullo schermo, lo chiamiamo frame.
nl: De functie [code]_process()[/code] doet niets totdat we er iets aan toevoegen. Je ziet misschien het lage streepje [code]_[/code] voor de functienaam. Dit is een conventie die programmeurs gebruiken om werk te coördineren, en het zal pas zinvol zijn als je ervaring hebt met coderen in Godot. Voor nu is alles wat je moet weten dat als de functie bestaat in je code en ze precies [code]_process[/code] heet, Godot ze automatisch zal uitvoeren elk [i]frame[/i]. Wanneer Godot op het scherm tekent, noemen we dat een frame.
pt_br: A função [code]_process()[/code] não vai fazer nada até que adicionemos algo a ela. Você pode notar o sinal de underscore [code]_[/code] na frente do nome da função. Isso é uma convenção que programadores criaram pra coordenar o trabalho. Isso fará mais sentido quando você tiver mais experiência programando na Godot engine. Por agora, tudo que você precisa saber é: se a função existir no seu código e o nome é exatamente [code]_process[/code], a Godot vai executá-la automaticamente a cada [i]frame[/i]. Um frame é quando uma nova imagem é desenhada na tela.
zh_hans: [code]_process()[/code] 函数在我们往里面加东西之前不会做任何实质性的事情。 你可能会注意到函数名称前面的下划线 [code]_[/code]。这是一个约定俗成的事情，来协调程序员的工作，等你真的开始用Godot写代码的时候你就会知道这有什么意义了。 现在呢，你只需要知道如果这个函数在你的代码中，并且清清楚楚地叫作[code]_process[/code]，那Godot就会自动识别，每一[i]frame（帧）[/i]都运行这个函数一次。 每当Godot在屏幕上画一次图像，我们就把这叫做进行了一帧。

source: Is this the same for other engines?
it: È lo stesso per altri motori di gioco?
nl: Is dit hetzelfde voor andere game engines?
pt_br: É a mesma coisa em outras engines?
zh_hans: 其他引擎也是这样吗？

source: Other game engines might use different names like [code]_update()[/code].
hu: Más enginek lehet, hogy máshogy hívják, például [code]_update[/code].
it: Altri motori di videogiochi potrebbero usare nomi diversi come [code]_update()[/code].
nl: Andere game engines gebruiken misschien andere namen zoals [code]_update()[/code].
pl: Inne silniki gier dla tej samej funkcji mogą używać innych nazw, takich jak [code]_update()[/code].
pt_br: Outras engines de jogos podem usar nomes diferentes, como [code]_update()[/code].
sv: Andra spelmotorer kan använda andra namn som [code]_update()[/code].
zh_hans: 其他游戏引擎可能使用不同的名称，例如 [code]_update()[/code]。

source: Why is the _process() function useful?
hu: Mire jó a _process() függvény?
it: Perché la funzione _process() è utile?
nl: Wat is het nut van de functie _process()?
pt_br: Por que a função _process() é útil?
zh_hans: _process() 函数很有用吗？

source: It's perhaps better to see the [code]_process()[/code] function in action. Take the following example.
hu: talán jobb, ha működés közben nézzük meg a [code]_process()[/code] függvényt. Vegyük az alábbi példát.
it: Forse è meglio vedere la funzione [code]_process()[/code] in azione. Osserva il seguente esempio.
nl: Het is misschien beter om de functie [code]_process()[/code] in actie te zien. Bekijk het volgende voorbeeld.
pt_br: Talvez seja melhor ver a função [code]_process()[/code] em ação. Tome o seguinte exemplo.
zh_hans: 最好实际看看 [code]_process()[/code] 函数的作用。 举个例子。

source: When you click the button [code]set_process(true)[/code], you activate processing on the robot. From there, every frame, Godot runs the [code]_process()[/code] function. Since we wrote a [code]rotate()[/code] instruction, Godot is rotating the character by [code]0.05[/code] radians [b]many[/b] times a second.
hu: Amikor rákattintasz a [code]set_process(true)[/code] nevű gombra, aktiválod a feldolgozást a roboton. Ezután, a Godot minden framen lefuttatja a [code]_process()[/code] függvényt. Mivel készítettünk egy [code]rotate()[/code] utasítást, a Godot elfordítja a karaktert [code]0.05[/code] radiánnal, másodpercenként [b]rengeteg[/b] alkalommal.
it: Premendo il tasto [code]set_process(true)[/code] attivi la funzione continua per il robot. Da lì, ad ogni frame, Godot esegue la funzione [code]_process()[/code]. Dato che abbiamo scritto l'istruzione [code]rotate()[/code], Godot ruota il personaggio di [code]0.05[/code] radianti [b]tante[/b] volte al secondo.
nl: Wanneer je op de knop [code]set_process(true)[/code] klikt, activeer je de verwerking in de robot. Vanaf dat moment voert Godot elk frame de functie [code]_process()[/code] uit. Omdat we een [code]rotate()[/code] instructie hebben geschreven, draait Godot het personage met [code]0.05[/code] radialen [b]vele[/b] malen per seconde.
pl: Po kliknięciu przycisku [code]set_process(true)[/code] aktywujesz przetwarzanie pokazane na naszym robocie. Od tego momentu w każdej klatce Godot uruchamiać będzie funkcję [code]_process()[/code]. Ponieważ napisaliśmy instrukcję [code]rotate()[/code], Godot będzie obracał naszą postać o [code]0.05[/code] radiana [b]wiele[/b] razy na sekundę.
pt_br: Ao clicar no botão [code]set_process(true)[/code], você ativa o processamento no robô. A partir daí, a cada frame, a Godot executa a função [code]_process()[/code]. Como escrevemos uma instrução [code]rotate()[/code], a Godot está girando o personagem em [code]0.05[/code] radianos [b]muitas[/b] vezes por segundo.
sv: När du klickar på knappen [code]set_process(true)[/code], aktiverar du bearbetning på roboten. Därifrån, varje bildruta, kör Godot funktionen [code]_process()[/code]. Eftersom vi skrev en [code]rotate()[/code]-instruktion, roterar Godot tecknet med [code]0,05[/code] radianer [b]många[/b] gånger per sekund.
zh_hans: 当你单击按钮 [code]set_process(true)[/code] 时，你就激活了在这个机器人上的处理流程（processing）。 从那里开始，每一帧，Godot 都会运行 [code]_process()[/code] 函数。 由于我们编写了 [code]rotate()[/code] 指令，相当于 Godot 每秒将角色以 [code]0.05[/code] 弧度旋转了 [b]很多[/b] 次。

source: How often does the _process() function run?
hu: Milyen gyakran fut le a _process() függvény?
it: Quanto spesso la funzione _process() viene eseguita?
nl: Hoe vaak wordt de functie _process() uitgevoerd?
pl: Jak często uruchamiana jest funkcja _process()?
pt_br: Com que frequência a função _process() é executada?
sv: Hur ofta körs funktionen _process()?
zh_hans: _process() 函数的运行频率是？

source: The faster your computer, the more times [code]_process()[/code] will run. Godot will try and run [code]_process()[/code] as quickly as it can. This makes sure any movement or animations look smooth and fluid.
hu: Minél gyorsabb a számítógéped, annál többször fog lefutni a [code]_process()[/code] függvény. A Godot megpróbálja olyan gyorsan lefuttatni a [code]_process()[/code] függvényt, ahogy csak tudja. Ez biztosítja, hogy minden mozgás és animáció simán fut.
it: Più veloce è il tuo computer, più [code]_process()[/code] viene eseguito. Godot proverà ad eseguire[code]_process()[/code] quanto più veloce possibile. Questo fa si che ogni movimento o animazione sembri fluida.
nl: Hoe sneller je computer, hoe vaker [code]_process()[/code] uitgevoerd zal worden. Godot zal proberen om [code]_process()[/code] zo snel mogelijk uit te voeren. Dit zorgt ervoor dat bewegingen en animaties er soepel en vloeiend uitzien.
pl: Im szybszy jest twój komputer, tym więcej razy funkcja [code]_process()[/code] zostanie wykonana. Godot będzie próbował uruchomić funkcję [code]_process()[/code] tak szybko, jak tylko będzie w stanie. Dzięki temu każdy ruch i animacja wyglądać będzie płynnie i gładko.
pt_br: Quanto mais rápido for seu computador, mais vezes a função [code]_process()[/code] será executada. A Godot tentará executar a função [code]_process()[/code] o mais rápido possível. Isso garante que qualquer movimento ou animação pareça suave e fluido.
sv: Ju snabbare din dator är, desto fler gånger körs [code]_process()[/code]. Godot kommer att försöka köra [code]_process()[/code] så snabbt som möjligt. Detta ser till att alla rörelser eller animationer ser smidiga och flytande ut.
zh_hans: 你的计算机越快，每秒[code]_process()[/code] 运行的次数就越多。 Godot 会尽可能地尝试运行 [code]_process()[/code]，越快越好。这可以确保任何运动或动画能看起来很丝滑。

source: Once a second.
hu: Másodpercenként egyszer.
it: Una volta al secondo.
nl: Een keer per seconde.
pl: Raz na sekundę.
pt_br: Uma vez por segundo.
sv: En gång i sekunden.
zh_hans: 一秒钟一次。

source: Multiple times a second.
hu: Másodpercenként többször.
it: Molte volte al secondo.
nl: Meerdere keren per seconde.
pl: Wiele razy na sekundę.
pt_br: Várias vezes por segundo.
sv: Flera gånger i sekunden.
zh_hans: 每秒运行很多次。

source: In the practice, you'll learn how to use the process function to rotate and move a character yourself.
hu: A gyakorlatban megtanulod, hogyan használd a _process() függvényt, hogy elforgasd és mozgasd a karaktert.
it: Nella pratica, imparerai come usare la funzione _process() per ruotare e muovere un personaggio te stesso.
nl: In de oefening leer je hoe je de verwerkingsfunctie kunt gebruiken om zelf een personage te draaien en te verplaatsen.
pl: W ćwiczeniu nauczysz się, jak używać funkcji [code]_process()[/code] do samodzielnego obracania i przesuwania postaci.
pt_br: Na lição de prática, você vai aprender a usar a função process para rotacionar e mover um personagem você mesmo.
sv: I övningen kommer du att lära dig hur du använder processfunktionen för att rotera och flytta en karaktär själv.
zh_hans: 在本次练习中，你将学习如何使用process函数旋转和移动角色。

source: Rotating a Character Continuously
hu: A karakter folyamatos forgatása
it: Ruotando un Personaggio in Continuazione
nl: Een personage voortdurend laten draaien
pl: Ciągłe obracanie postaci
pt_br: Rotacionando um Personagem de Maneira Contínua
sv: Rotera en karaktär kontinuerligt
zh_hans: 持续旋转角色

source: Make the robot rotate slowly by adding to the [code]_process()[/code] function. A rotation speed of about [code]0.05[/code] each frame should do.
hu: Forgasd lassan a karktert a [code]_process()[/code] függvény módosításával. Frame-enként [code]0.05[/code]-os forgatási sebességnek jónak kell lennie.
it: Fa sì che il robot si ruoti lentamente aggiungendo codice alla funzione [code]_process()[/code]. Una velocità di rotazione di circa [code]0.05[/code] ad ogni frame dovrebbe andare.
nl: Laat de robot langzaam draaien door de functie [code]_process()[/code] toe te voegen. Een draaisnelheid van ongeveer [code]0.05[/code] per frame zou voldoende moeten zijn.
pl: Spraw, aby robot powali się obracał, dodając odpowiedni kod do funkcji [code]_process()[/code]. Prędkość obrotu powinna wynieść około [code]0.05[/code] radianu na każdą ramkę.
pt_br: Faça o robô rotacionar lentamente adicionando algo na função [code]_process()[/code]. Uma velocidade de rotação com cerca de [code]0.05[/code] por frame deve ser suficiente.
sv: Få roboten att rotera långsamt genom att lägga till funktionen [code]_process()[/code]. En rotationshastighet på ungefär [code]0,05[/code] varje bildruta borde göra tricket.
zh_hans: 添加[code]_process()[/code]函数，使机器人缓慢旋转。 每帧大概旋转 [code]0.05[/code] 弧度应该就够了。

source: Creating Circular Movement
hu: Körkörös mozgás létrehozása
it: Creando Moto Circolare
nl: Cirkelvormige beweging maken
pl: Tworzenie ruchu kołowego
pt_br: Criando Movimento Circular
sv: Skapa cirkulär rörelse
zh_hans: 实现圆周运动

source: Make the robot move in a large circle slowly by rotating it and simultaneously moving it along its x direction. To do this, add the [code]rotate()[/code] and [code]move_local_x()[/code] functions to [code]_process()[/code]. Use a rotation speed of [code]0.05[/code] radians per frame, and move the robot [code]5[/code] pixels per frame.
hu: Mozgasd körbe egy nagy körben a robotot, lassan forgatva és folymatosan mozgatva előre az X tengelyén. Ehhez add hozzá a [code]rotate()[/code] és a [code]move_local_x()[/code] függvényeket a [code]_process()[/code] függvényhez. A forgatási sebesség legyen frame-enként [code]0.05[/code] radián, és mozgasd a robotot előre frame-enként [code]5[/code] pixellel.
it: Fa sì che il robot si muova lentamente lungo un grande cerchio facendolo ruotare e muovere lungo la sua direzione x simultaneamente. Per far ciò, aggiungi le funzioni [code]rotate()[/code] e [code]move_local_x()[/code] alla funzione [code]_process()[/code]. Usa una velocità di rotazione di [code]0.05[/code] radianti per frame e muovi il robot di [code]5[/code] pixel per frame.
nl: Laat de robot langzaam in een grote cirkel bewegen door hem te draaien en tegelijkertijd in zijn x-richting te bewegen. Voeg hiertoe de functies [code]rotate()[/code] en [code]move_local_x()[/code] toe aan [code]_process()[/code]. Gebruik een draaisnelheid van [code]0.05[/code] radialen per frame en verplaats de robot [code]5[/code] pixels per frame.
pl: Spraw, aby robot poruszał się powoli po dużym okręgu: zrób to obracając go i jednocześnie przesuwając w kierunku x. Aby to zrobić, dodaj do kodu funkcji [code]_process()[/code] dwie funkcje: [code]rotate()[/code] i [code]move_local_x()[/code]. Dla obrotu użyj prędkości [code]0.05[/code] radiana na klatkę, przesuwając przy tym robota [code]5[/code] pikseli na klatkę.
pt_br: Faça o robô se mover lentamente em um grande círculo girando e movendo ele simultaneamente ao longo de sua direção no eixo x. Para fazer isso, adicione as funções [code]rotate()[/code] e [code]move_local_x()[/code] na função [code]_process()[/code]. Use uma velocidade de rotação de [code]0,05[/code] radianos por frame e mova o robô [code]5[/code] pixels por frame.
sv: Få roboten att långsamt röra sig i en stor cirkel genom att rotera den och samtidigt flytta den längs sin x-riktning. För att göra detta, lägg till funktionerna [code]rotate()[/code] och [code]move_local_x()[/code] till [code]_process()[/code]. Använd en rotationshastighet på [code]0,05[/code] radianer per bildruta och flytta roboten [code]5[/code] pixlar per bildruta.
zh_hans: 通过旋转机器人并同时沿着它自己的 x轴 方向移动，这样机器人会作缓慢的圆周运动。 为此，请将 [code]rotate()[/code] 和 [code]move_local_x()[/code] 函数添加到 [code]_process()[/code]。 使用每帧 [code]0.05[/code] 弧度的旋转速度，每帧移动机器人 [code]5[/code] 像素。

source: The Game Loop
hu: A game loop
it: Il Ciclo Di Gioco
nl: De game-lus
pl: Pętla gry
pt_br: O Loop do Jogo
sv: Spelslingan
zh_hans: 游戏循环

source: The [code]_process()[/code] function won't do anything until we add something to it. You might notice the underscore [code]_[/code] in front of the function name. This is a convention. It means the function is already defined by Godot. If the function exists, and is called exactly [code]_process[/code], then Godot will automatically run it every frame.
hu: A [code]_process()[/code] függvény nem csinál semmit, amíg írunk bele valamit. Bizonyára észrevetted az aláhúzásjelet [code]_[/code] a függvény neve előtt. Ez egy konvenció. Azt jelenti, hogy a Godot már definiálta ezt a függvényt. ha a függvény már létezik, és pontosan [code]_process[/code] a neve, akkor a Godot automatikusan futtatni fogja minden framen.
sv: Funktionen [code]_process()[/code] kommer inte att göra något förrän vi lägger till något till den. Du kanske märker understrecket [code]_[/code] framför funktionsnamnet. Detta är en konvention. Det betyder att funktionen redan är definierad av Godot. Om funktionen finns och kallas exakt [code]_process[/code], kommer Godot automatiskt att köra den varje bildruta.
