Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-1-what-code-*-like.po
Languages: es, fa, hu, ko, pl, pt_br, sk, sv, th, zh_hans, zh_hant

source: Most programming languages build upon the same ideas of how to program. As a result, they're mostly similar. It's not to say all languages are the same, though. Some offer a really unique syntax and require a completely different mindset compared to GDScript. However, languages like GDScript, Python, JavaScript, C++, C#, and many others build upon a similar programming philosophy.
es: La mayoría de los lenguajes de programación se basan en las mismas ideas sobre cómo programar. Como resultado, son en su mayoría similares. Sin embargo, esto no quiere decir que todos los lenguajes sean iguales. Algunos ofrecen una sintaxis realmente única y requieren una mentalidad completamente diferente en comparación con GDScript. Sin embargo, lenguajes como GDScript, Python, JavaScript, C++, C# y muchos otros se basan en una filosofía de programación similar.
hu: A legtöbb programnyelv ugyanarra az elvre épül. Ennek köszönhetően sokban hasnlítanak. Azonban, nem arról van szó, hogy minden nyelv ugyanolyan. Vannak olyanok, amelyeknek teljesen egyedi szintaktikájuk van és teljesen eltérő gondolkodásmódot igényelnek, mint a GDScript. Azonban, az olyan nyelvek, mint a GDScript, Python, JavaScript, C++, C#, és még sok más, hasonló programozási szemléletre épülnek.
pl: Większość języków programowania opiera się na tych samych zamysłach sposobów wydawania instrukcji. W rezultacie są w większości podobne. Nie oznacza to jednak, że wszystkie języki są takie same. Niektóre oferują naprawdę unikalną składnię i wymagają zupełnie innego sposobu myślenia niż GDScript. Jednak języki takie jak GDScript, Python, JavaScript, C++, C# i wiele innych opierają się na podobnej filozofii programowania.
pt_br: A maioria das linguagens de programação são construídas na mesma ideia de como programar. Como resultado disso, a maioria são parecidas. Isso não quer dizer que todas as linguagens são iguais. Algumas oferecem uma sintaxe única e exigem um modo de pensar completamente diferente comparado a linguagem GDScript. No entanto, linguagens como GDScript, Python, JavaScript, C++, C# e muitas outras são construidas em cima de uma filosofia similar de programação.
th: ภาษาโปรแกรมส่วนใหญ่สร้างขึ้นจากแนวคิดเดียวกันในการเขียนโปรแกรมเดียวกัน ซึ่งเป็นผลให้พวกมันส่วนใหญ่นั้นคล้ายคลึงกัน ไม่ได้หมายความว่าทุกภาษาจะเหมือนกันหมด แต่บางภาษานั้นมีรูปแบบที่ไม่เหมือนใครและมีกรอบความคิดที่ต่างไปจากเดิมเมื่อเทียบกับ GDScript อย่างไรก็ตาม ภาษาต่างๆ เช่น GDScript, Python, JavaScript, C++, C# และอื่นๆ อีกมาก สร้างขึ้นจากแนวคิดการเขียนโปรแกรมที่คล้ายคลึงกัน
zh_hans: 大多数编程语言都建立在相同的编程理念之上。因此，它们大多是相似的。 不过，这并不是说所有语言都是一样的。有些还是会提供独特的语法，要求与 GDScript 完全不同的思维方式的。 然而，GDScript、Python、JavaScript、C++、C# 以及很多其他语言都是建立在类似的编程思想之上的。
zh_hant: 大部分程式語言都建立在同樣的程式概念上。因此，他們非常相似。 但，這並不是說所有語言都一樣。有些語言會提供非常獨特的語法，並需要與GDScript完全不同的思考模式。 然而，GDScript、Python、JavaScript、C++、C#與許多其他語言，都建立在相似的程式哲學上。

source: We designed it for [i]absolute beginners[/i], but if you already know another language, it can be a fun way to get started with Godot. We will give you the coding foundations you need to start making games and applications with Godot. Please be patient. It will take time before you can make your first complete game alone.
hu: A képzést [i]teljesen kezdőknek[/i] terveztük, de ha már ismersz más nyelveket, akkor is remek módja lehet a Godot Engine-nel való ismerkedésnek. Megadjuk a programozási alapokat, amelyek szükségesek lesznek, hogy elkészíthesd a saját játékaid. Kérjük, legyél türelmes. Időbe fog telni, míg egyedül is el fogod tudni készíteni az első játékod.
pt_br: Nós fizemos esse curso para pessoas [i]totalmente iniciantes[/i], mas se você já sabe outra linguagem, pode ser uma forma divertida de iniciar com a Godot. Nós vamos te passar os fundamentos de programação que você irá precisar para começar a fazer jogos e aplicações com a Godot. Por favor, seja paciente. Vai levar tempo até você conseguir fazer seu primeiro jogo completo sozinho.
th: เราออกแบบมาเพื่อ[i]ผู้เริ่มต้นอย่างแน่นอน[/i] แต่ถ้าคุณรู้ภาษาอื่นอยู่แล้ว ก็อาจเป็นวิธีที่สนุกในการเริ่มต้นใช้งาน Godot ก็ได้ เราจะให้พื้นฐานการเขียนโค้ดที่จำเป็นสำหรับคุณเพื่อใช้ในการเริ่มสร้างเกมและแอปพลิเคชันด้วย Godot โปรดอดทนรออีกนิด ต้องใช้เวลาก่อนที่คุณจะสร้างเกมแรกที่สมบูรณ์โดยลำพังได้
zh_hans: 我们针对的是[i]绝对的新手[/i]，但如果你已经了解其他语言了，通过这个教程来入手 Godot 也会是个有趣的方式。 我们会为你打下代码的基础，这是使用 Godot 制作游戏和应用程序所需要的。 请持之以恒，在你能够独立完成第一个完整的游戏之前需要花费很多功夫学习。
zh_hant: 我們設計課程給[i]完完全全的新手[/i]，但若你已經懂其他語言，這也能作為初次接觸Godot的有趣方法。 我們會給你開始使用Godot製作遊戲與應用程式需要的程式碼基礎。 請務必有耐心。到你能獨自完成遊戲前，需要時間。

source: Creating games is more accessible than ever, but it still takes a lot of work and practice. Do not expect any single course or book to turn you into a professional. [b]Programming is something you learn through practice.[/b] If something doesn't make immediate sense, don't stress it too much! Keep learning and come back to it later. Enjoy the process and celebrate every little success. You will never stop learning as a game developer.
hu: A játékok készítése még sosem volt ennyire hozzáférhető bárki számára, de így is rengeteg munkát és gyakorlást igényel.. Ne számíts rá, hogy egyetlen könyv vagy kurzus profit csinál belőled. [b]A programozás egy olyan dolog, amit gyakorlás utján tanulhastz meg.[/b] Ha valami nem rögtön egyértelmű, ne stresszelj miatta! Tanulj tovább, és később térj vissza hozzá. Élvezd a folyamatot, és ünepelj meg minden apró sikert. Játékfejlesztőként soha nem fejeződik be a tanulás.
pt_br: Criar jogos está mais acessível do que nunca, mas ainda requer muito trabalho e prática. Não espere nenhum curso ou livro que te transformará em um profissional. [b]Programação é algo que você aprende através de prática.[/b] Se algo não faz sentido logo de cara, não se estresse demais! Continue aprendendo e volte mais tarde. Aproveite o processo e celebre cada pequeno sucesso. Você nunca vai parar de aprender sendo um desenvolvedor de jogos.
th: การสร้างเกมนั้นเข้าถึงได้ง่ายกว่าที่เคยเป็น แต่ก็ยังไงก็ต้องอาศัยการทำมันซ้ำๆและการฝึกฝนอีกมาก อย่าคาดหวังว่าหลักสูตรหรือหนังสือใดๆจะเปลี่ยนคุณให้กลายเป็นมืออาชีพได้เพราะ [b]การเขียนโปรแกรมเป็นสิ่งที่คุณเรียนรู้จากการฝึกฝนมัน[/b] หากบางอย่างไม่ได้ดังใจในทันทีทันใด ก็อย่าเครียดมากไป! ให้เรียนรู้เพิ่มเติมและกลับมาต่อมันอีกครั้งในภายหลัง สนุกกับทุกกระบวนการและเฉลิมฉลองทุกความสำเร็จเล็กๆน้อยๆ คุณจะไม่มีวันที่จะหยุดเรียนรู้ในฐานะนักพัฒนาเกม
zh_hans: 制作游戏门槛是越来越低了，但仍然需要花费很多心血和练习。 请不要指望看完一个教程或者一本书就能够让你变成专业人士。[b]编程是通过实践来学习的。[/b] 如果有些东西无法立即理解，也请不要太紧张！请继续学习，以后再来研究。 请享受这个过程，庆祝每一个小小的成功。作为一个游戏开发者，你永远不会停止学习。
zh_hant: 創造遊戲的門檻從未如此低淺，但仍然需要大量的作業與練習。 別期望任何單獨的課程或書本把你變成職業。[b]程式得靠練習才能學習。[/b] 如果有什麼無法馬上理解的事，別太有壓力！持續學習，晚點再回頭就好。 享受過程並慶祝每個小小的成功。遊戲開發永遠不會停止學習。

source: Along the way, we'll teach you: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - How to write GDScript code. - Essential programming foundations to get you started. As you go through the course, you will have many questions. We will answer them the best we can as we go. But there is so much to cover that we have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things. We broke down the course into short lessons and practices. If we put too much into each part, you'd learn slower. If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
hu: A kurzus során megtanítjuk: - A gondolkodásmódot, amire fejlesztőként szükséged lesz. Túl sok programozó kurzus hagyja ki ezt a nélülözhetetlen lépést. - Hogyan írj GDScript kódot. - Nélkülözhetetlen programozási alapokat a kezdéshez. Ahogy haladsz a kurzusban, sok kérdésed lesz majd. Igyekszünk a lehető legjobb válaszokat adni rájuk. De olyan sok dolog van, hogy megkötéseket kell hoznunk. Nem akarunk [i]túlterhelni[/i] az információkkal. Az elménk bdóképességét is tiszteletben akarjuk tartani. Rövid leckékre és gyakorlatokra osztottuk a kurzust. Ha túl sok mindent tennénk egy leckébe, lassabban haladnál.. Ha bármi kérdés merül fel benned a tanulás során, akkor nyugodatn csatlakozz a [url=https://discord.gg/87NNb3Z]Discord közösségünkhöz[/url].
pt_br: Ao longo do caminho, vamos te ensinar: - Alguns modos de pensar que você vai precisar como um desenvolvedor. Muitos cursos de programação pulam essa parte essencial. - Como escrever códigos na linguagem GDScript . - Fundamentos essenciais de programação para você poder começar. Conforme você avança no curso, você terá muitas perguntas. Nós vamos respondê-las da melhor forma possível conforme avançamos. Mas tem tanta coisa para aprender que teremos que pegar alguns atalhos. Nós não queremos [i]sobrecarregar[/i] você com informação. Nós também queremos respeitar o ritmo que nossos cérebros memorizam as coisas. Nós dividimos o curso em pequenas lições e práticas. Se colocarmos muita coisa em cada parte, você aprenderia de forma devagar. Se em qualquer momento você ficar com muitas dúvidas, você é mais que bem vindo(a) a se juntar à [url=https://discord.gg/87NNb3Z]nossa comunidade no Discord[/url].
th: ระหว่างทางนี้ที่เราจะสอนคุณมี: - ความคิดบางอย่างที่คุณต้องการในฐานะนักพัฒนา การเขียนโปรแกรมเชิงลึกเกินไปหลักสูตรจะข้ามส่วนนั้นไป - วิธีเขียนโค้ด GDScript - พื้นฐานการเขียนโปรแกรมที่จำเป็นสำหรับการเริ่มต้น เมื่อคุณผ่านหลักสูตรแล้ว คุณอาจจะมีคำถามมากมาย เราจะตอบอย่างดีที่สุดเท่าที่จะทำได้ แต่ยังมีอีกมากที่จะกล่าวถึงเราต้องใช้ทางลัดนิดหน่อย เราไม่ต้องการที่จะ [i]ครอบงำ[/i] คุณด้วยข้อมูล เราต้องการเคารพมันสมองของคุณเพราะสมองของเราจดจำสิ่งต่างๆได้ดี เราแบ่งหลักสูตรออกเป็นบทเรียนสั้นๆ และแนวทางฝึกฝน ถ้าเราใส่มากเกินไปในแต่ละส่วน คุณอาจจะเรียนรู้ได้ช้า หากเมื่อใดก็ตามที่คุณมีคำถามติดค้างอยู่ในใจ เราจะยินดีอย่างยิ่งหากคุณจะเข้าร่วม [url=https://discord.gg/87NNb3Z]ชุมชน Discord ของเรา[/url]
zh_hans: 在此过程中，我们会教给你： - 成为开发者所需要的一些思维模式。有太多的编程教程跳过了这一极其重要的部分。 - 如何编写 GDScript 代码。 - 入门所需要的必要编程基础。 随着学习的深入，你会产生很多疑问。我们会尽量去进行解答。 不过要涉及的内容太多了，我们不得不走一些捷径。我们不想让你被大量的信息[i]淹没[/i]。我们也想遵循大脑进行记忆的节奏。 我们将教程分解成了一系列较短的课程和练习。如果我们为每一部分都加入太多内容，你就会学得有点慢。 如果你发现有亟待回答的疑问，欢迎加入[url=https://discord.gg/87NNb3Z]我们的 Discord 社区[/url]。

source: Programming is a skill, so to get good at it, you must practice. It is why we built this app. Each lesson is followed by an interactive practice to use what you learned. Speaking of which, it's time to look at the practice screen! To continue, click the [i]Practice[/i] button below. It will give you a short run through how practices work.
hu: A programozás egy készség, tehát ahhoz, hogy jó legyél benne, gyakorolnod kell. Ezért készítettük ezt az alkalmazást. Minden lecke egy interaktív gyakorlattal zárul, hogy kipróbálhasd, amit tanultál. Ha már szóba került, nézzük is meg a gyakorlatokat! A folytatáshoz kattints a [i]Gyakorlat[/i] gombra. Ez röviden bemutatja majd, hogy működnek a gyakorlatok.
pt_br: Programar é uma habilidade, então para ficar bom nisso, você precisa praticar. Pra isso nós criamos esse aplicativo. Cada lição é seguida por um exercício interativo para usar o que você aprendeu. Falando nisso, é hora de ver a tela de exercício! Para continuar, clique no botão [i]Praticar[/i]logo abaixo. Isso vai te dar um breve resumo de como os exercícios funcionam.
th: การเขียนโปรแกรมเป็นทักษะ ดังนั้นคุณต้องฝึกฝน นั่นเป็นเหตุผลที่เราสร้างแอพนี้ขึ้นมา แต่ละบทเรียนจะตามมาด้วยการฝึกฝนเชิงโต้ตอบเพื่อใช้เป็นสิ่งให้คุณได้เรียนรู้ พูดถึงเรื่องนี้แล้วก็ถึงเวลาที่จะไปดูหน้าจอฝึกฝนกัน! หากต้องการดำเนินการต่อ ให้คลิกที่ปุ่ม [i]แบบฝึกหัด[/i] ด้านล่าง มันจะช่วยให้คุณทราบเกี่ยวกับวิธีการทำแบบฝึกหัดสั้นๆ
zh_hans: 编程是一项技能，要熟练掌握，你必须进行练习。这就是我们制作这个应用的原因。 每节课程之后都会有一个交互式练习，使用你所学到的东西。 说到这个，是时候看看练习界面了！ 如果想要继续，请点击下方的[i]练习[/i]按钮。它会简要地向你介绍练习的流程。
zh_hant: 程式是種技能，所以要變得擅長，你一定要練習。因此我們做了這個程式。 每個課程都會有個互動式練習來使用你剛學到的東西。 提到這個，是時候看看練習畫面了！ 點擊[i]練習[/i]按鈕以繼續。這會讓你簡短跑過練習的流程。

source: We prepared a code sample for you. For this practice, you don't need to change anything. To test the code, click the [i]Run[/i] button below the code editor.
es: Hemos preparado un ejemplo de código para ti. Para esta práctica, no necesitas cambiar nada. Para probar el código, haz clic en el botón [i]Ejecutar[/i] situado debajo del editor de código.
hu: Előkészítettünk egy kódrészletet a számodra. Ebben a gyakorlatban nem kell vele csinálnod semmit. A teszteléshez, kattints a [i]Futtatás[/i] gombra a kódszerkesztő alatt.
pl: Przygotowaliśmy dla ciebie próbkę kodu. W tym ćwiczeniu nie musisz niczego zmieniać. Aby przetestować kod, kliknij przycisk [i]Uruchom[/i] pod edytorem kodu.
pt_br: Nós preparamos um código de exemplo para você. Para esse exercício, você não precisa mudar nada. Para testar o código, clique no botão [i]Executar[/i] logo abaixo do editor de código.
th: เราได้เตรียมตัวอย่างโค้ดไว้ให้คุณแล้ว สำหรับแบบฝึกหัดนี้ คุณไม่จำเป็นต้องเปลี่ยนแปลงอะไรเลย หากต้องการทดสอบโค้ด ให้คลิกที่ปุ่ม [i]เรียกใช้[/i] ด้านล่างตัวแก้ไขโค้ด
zh_hans: 我们为你准备了一段示例代码。此次练习中，你无需修改任何内容。 要测试代码，请点击代码编辑器下方的[i]运行[/i]按钮。
zh_hant: 我們準備了範例程式碼給你。在此練習中，你不需要改動任何東西。 點擊編輯器下的[i]執行[/i]按鈕以測試程式碼。

source: In this course, you'll learn the GDScript programming language (the name stands for "Godot script"). This is a language by game developers for game developers. You can use it within the Godot game engine to create games and applications. SEGA used the Godot engine to create the remake of Sonic Colors Ultimate. Engineers at Tesla use it for their cars' dashboards.
pl: W tym kursie nauczysz się języka programowania GDScript (co jest skrótem od angielskiego „Godot script”, czyli „skryptu Godota”). Jest to stworzony przez twórców gier dla twórców gier. Możesz go używać w silniku gier Godot do tworzenia gier i aplikacji. SEGA wykorzystała silnik Godot do stworzenia remake'u Sonic Colors Ultimate. Inżynierowie z Tesli używają go do desek rozdzielczych swoich samochodów.
pt_br: Nesse curso, você vai aprender a linguagem de programação chamada GDScript (o nome significa "Godot script"). Essa é uma linguagem feita por desenvolvedores de jogos para desenvolvedores de jogos. Você pode usa-la junto a engine de jogo Godot para criar jogos e aplicações. A SEGA usou a engine de jogo Godot para criar o remake de Sonic Colors Ultimate. Engenheiros da Tesla usam ela para os seus painéis de carros.
th: ในหลักสูตรนี้ คุณจะได้เรียนรู้ภาษาการเขียนโปรแกรม GDScript (ชื่อย่อมาจาก "Godot script") นี่คือภาษาของผู้พัฒนาเกมเพื่อนักพัฒนาเกม คุณสามารถใช้มันได้ในเอ็นจิ้นเกม Godot เพื่อใช้ในการสร้างเกมและแอพพลิเคชั่น SEGA ใช้เครื่องมือ Godot เพื่อสร้างเกม Sonic Colours Ultimate ขึ้นมาใหม่ วิศวกรของ Tesla ใช้มันเพื่อสร้างแดชบอร์ดของรถยนต์
zh_hant: 在此課程中，你會學習GDScript程式語言（此名稱意指「Godot Script」）。 這是個由遊戲開發者做給遊戲開發者的語言。你能在Godot遊戲引擎中用來製作遊戲與應用程式。 SEGA用了Godot引擎製作了Sonic Colors Ultimate重製版。特斯拉的工程師用來做了汽車的儀表板。

source: Programming languages are different from natural ones like English or Spanish. The computer does not think. Unlike us,it can't [i]interpret[/i] what you tell it. You can't tell it something vague like "draw a circle." Which circle? Where? Which color should it be? How big should it be?
th: ภาษาโปรแกรม มีแตกต่างหลากหลายมามายเหลือเกินเมื่อเทียบกับภาษามนุษย์ที่ใช้อยู่ เช่น ภาษาไทย ภาษาอังกฤษ คอมพิวเตอร์มันคิดไม่ได้นะ ไม่เหมือนกับมนุษย์เรา มัน[i]แปลสิ่งที่เราบอกไปตรง ๆ ไม่ได้[/i] จู่ ๆ จะไปบอกมันทื่อ ๆ ว่า "วาดวงกลมซิ" วงไหน? วาดที่ไหน? มีสีไหมอ่ะ? แล้วจะให้ใหญ่เล็กเท่าไหร่ดี?
zh_hant: 程式語言與英文或法文等自然語言不一樣。電腦不會思考。不像我們，它無法[i]詮釋[/i]你說的話。 你不能告訴它「畫個圓圈」這種含糊的話。 什麼圓圈？畫在哪？什麼顏色？要有多大？

source: In this free course, you will learn the foundations you need to start coding things like those.
th: ในหลักสูตรฟรีนี้ คุณจะได้เรียนรู้พื้นฐานที่จำเป็นในการเริ่มต้นเขียนโค้ดพวกนั้น
zh_hant: 在這個免費課程中，你會學到撰寫這種程式碼需要的基礎。

source: Along the way, we'll teach you: - Some of the mindset you need as a developer. Too many programming courses skip that essential part. - How to write GDScript code. - Essentials programming foundations to get you started. As you go through the course, you will have many questions. We will answer them the best we can as we go. But there is so much to cover that we have to take a few shortcuts. We don't want to [i]overwhelm[/i] you with information. We also want to respect the pace at which our brains memorize things. We broke down the course into short lessons and practices. If we put too much into each part, you'd learn slower. If at any time you're left with burning questions, you're more than welcome to join [url=https://discord.gg/87NNb3Z]our Discord community[/url].
zh_hant: 一路上，我們會教你： —一些你作為開發者需要的思考方式。太多程式課程跳過這個必要部份了。 —如果撰寫GDScript程式碼。 —讓你開始的必要程式基礎。 在課程途中，你會有許多問題。我們會盡力在過程中回答。 但要涵蓋的範圍實在太廣，我們必須抄些捷徑。我們不想用資訊[i]壓垮[/i]你。我們也想配合我們的大腦記憶事物的節奏。 我們將課程拆解成了短課程與練習。如果我們在單一部份放入太多內容，你會學得更慢。 如果你在任何時間點被沒有解答的問題逼急了，我們誠摯歡迎您加入[url=https://discord.gg/87NNb3Z]我們的Discord社群[/url]。

source: Learning to program can be daunting. Yet, you want to make video games, so there is no way around learning to program. Every video game is a computer program. Programming is the process of writing precise instructions that tell a computer how to perform a task. A game's instructions are, for example: moving a character, drawing a life bar, or playing a sound.
es: Aprender a programar puede ser desalentador. Sin embargo, si quieres hacer videojuegos, no hay forma de evitar aprender a programar. Todo videojuego es un programa de computadora. La programación es el proceso de escribir instrucciones precisas que le dicen a una computadora cómo realizar una tarea. Las instrucciones de un juego son, por ejemplo: mover un personaje, dibujar una barra de vida o reproducir un sonido.

source: To do any of that, you need to learn a programming language: a specialized language to tell the computer what to do. Programming languages are different from natural ones like English or Spanish. The computer does not think. It can't [i]interpret[/i] what you tell it. So you can't tell it something vague like "draw a circle." Which circle? Where? Which color should it be? How big should it be?
es: Para hacer cualquier cosa de estas, tienes que aprender un lenguaje de programación: un lenguaje especializado para decirle a la computadora lo que tiene que hacer. Los lenguajes de programación son diferentes de los naturales, como el inglés o el español. La computadora no piensa. No puede [i]interpretar[/i] lo que le dices. Así que no puedes decirle algo impreciso como "dibuja un círculo" ¿Qué círculo? ¿Dónde? ¿De qué color debería ser? ¿Qué tamaño debería tener?

source: To draw a filled circle, the computer needs to know exact drawing coordinates, the radius, the thickness, and color you want for the outline. The code to do so [i]may[/i] look like this. [i]Click the Run button to run the code example and see the result.[/i]
es: Para dibujar un círculo relleno, la computadora necesita conocer las coordenadas exactas del dibujo, el radio, el grosor y el color que quieres para el contorno. El código para hacerlo [i]puede[/i] verse así. [i]Haz clic en el botón Ejecutar para ejecutar el ejemplo de código y ver el resultado[/i]

source: [i]The dark gray parts following the "#" sign are comments, they're not part of the code. The computer skips comments.[/i]
es: [i]Las partes de color gris oscuro que siguen al signo "#" son comentarios, no forman parte del código. La computadora se salta los comentarios.[/i]

source: In the following lessons, you'll learn how this code works and what each part means. For now, we want to give you a sense of what computer code looks like: in this example, each parenthesis, capital letter, period, and comma matter. The computer will always do exactly what you tell it to. No more, no less. It [i]blindly[/i] follows every instruction. [b]When you program, you're the one in charge, and you're free to do [i]anything[/i] you want.[/b] At the same time, there is a [i]lot[/i] to learn to tame the dumb beast that is your computer.
es: En las siguientes lecciones, aprenderás cómo funciona este código y qué significa cada parte. Por ahora, queremos darte una idea de cómo se ve el código de computadora: en este ejemplo, cada paréntesis, mayúscula, coma y punto importan. La computadora siempre hará exactamente lo que le digas. Ni más ni menos. Sigue [i]ciegamente[/i] cada instrucción. [b]Cuando programas, tú eres el que manda, y eres libre de hacer [i]cualquier cosa[/i] que quieras[/b] Al mismo tiempo, hay [i]mucho[/i] que aprender para domar a la bestia tonta que es tu computadora.

source: It's an excellent language to get started with programming because it's specialized. Unlike some other languages, it doesn't have an overwhelming amount of features for you to learn. Don't be afraid of being locked in. The concepts you learn in your first programming language will apply to all the others. Most languages have more similarities than differences. Once you learn one, it takes much less time to become productive with the next one. Like most game developers, we learned and used more than ten programming languages. Here's an example of the same code in three languages: GDScript, JavaScript, and Python. Try to spot the similarities and differences.
es: Es un lenguaje excelente para iniciarse en la programación porque es especializado. A diferencia de otros lenguajes, no tiene una cantidad abrumadora de funcionalidades que tengas que aprender. No tengas miedo de que luego no vayas a poder salir de este primer lenguaje. Los conceptos que aprendas en tu primer lenguaje de programación se aplicarán a todos los demás. La mayoría de los lenguajes tienen más similitudes que diferencias. Una vez que aprendas uno, te llevará mucho menos tiempo volverte eficiente con el siguiente. Como la mayoría de los desarrolladores de juegos, hemos aprendido y utilizado más de diez lenguajes de programación. Aquí tienes un ejemplo del mismo código en tres lenguajes: GDScript, JavaScript y Python. Intenta detectar las similitudes y diferencias.

source: If you want to learn to make games or code but don't know where to start, this course should be perfect. We designed it for absolute beginners, but if you already know another language, it can also be a fun way to get started with Godot. We will give you the coding foundations you need to start making games and applications with Godot. Please be patient. Mind that it will take time before you can make your first complete game or app alone.
es: Si quieres aprender a hacer juegos o a programar pero no sabes por dónde empezar, este curso es perfecto para ti. Lo hemos diseñado para principiantes absolutos, pero si ya conoces otro lenguaje, también puede ser una forma divertida de iniciarse en Godot. Te daremos las bases de codificación que necesitas para empezar a hacer juegos y aplicaciones con Godot. Por favor, ten paciencia. Ten en cuenta que te llevará tiempo antes de que puedas hacer tu primer juego o aplicación completa tú solo o sola.
