Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-6-multiple-function-parameters.po
Languages: da, hu, pl, sk, sv, tr, uk, zh_hans

source: In this practice, we'll improve our [code]draw_corner()[/code] function so the angle can also vary. Add the [code]angle[/code] parameter after the [code]length[/code] parameter in the [code]draw_corner()[/code] function and use it to draw corners of varying angles.
sv: I den här övningen kommer vi att förbättra vår [code]draw_corner()[/code]-funktion så att vinkeln också kan variera. Lägg till parametern [code]angle[/code] efter parametern [code]length[/code] i funktionen [code]draw_corner()[/code] och använd parametern för att rita hörn med olika stora vinklar.
zh_hans: 在这个实践中，我们将改进我们的 [code]draw_corner()[/code] 函数，以便角度也可以变化。 将 [code]angle[/code] 参数添加到 [code]draw_corner()[/code] 函数中，放在[code]length[/code]参数之后，并使用它来绘制不同角度的角。

source: We want a function to draw squares of any size. We could use these squares as outlines when selecting units in a tactical game, as a frame for items in an inventory, and more. Create a function named [code]draw_square()[/code] that takes one parameter: the [code]length[/code] of the square's sides. [b]The turtle should face towards the right when starting or completing a square.[/b] Be sure to call [b]turn_right(90)[/b] enough times in your function to do so.
zh_hans: 我们想要一个函数来绘制任意大小的正方形。 我们可以将这些正方形用作战术游戏中选择单位的轮廓，用作库存中物品的框架等等。 创建一个名为 [code]draw_square()[/code] 的函数，它采用一个参数：正方形边的 [code]length[/code]。 [b]开始或完成一个矩形时，乌龟应该面向右侧。[/b] 为到达上述效果，请确保在你的函数中调用足够次的 [b]turn_right(90)[/b] 函数。

source: Let's make our square drawing function more flexible to include rectangles of varying sizes. Your job is to code a function named [code]draw_rectangle()[/code] that takes two parameters: the [code]length[/code] and the [code]height[/code] of the rectangle. [b]The turtle should face towards the right when starting or completing a rectangle.[/b] Note that we could still draw a square with [code]draw_rectangle()[/code] by having the [code]length[/code] and [code]height[/code] equal the same value.
zh_hans: 让我们使矩形绘图功能更加灵活，以包含不同大小的矩形。 你的工作是编写一个名为 [code]draw_rectangle()[/code] 的函数，它接受两个参数：矩形的 [code]length[/code] 和 [code]height[/code]。 [b]开始或完成一个矩形时，乌龟应该面向右侧。[/b] 请注意，我们仍然可以使用 [code]draw_rectangle()[/code] 通过使 [code]length[/code] 和 [code]height[/code] 等于相同的值来绘制矩形。
