Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-22-functions-return-values.po
Languages: da, de, es, fr, it, ja, nl, pl, pt_br, ru, tr, uk, zh_hans

source: To do so, we use a function. The function does two things: 1. First, it multiplies the cell coordinates by the cell size, which gives us the position of the cell's top-left corner on the screen, in pixels. 2. Then, we add half of the cell size to get the center of the cell. The function returns the result, allowing us to store it in a variable.
de: Dazu verwenden wir eine Funktion. Die Funktion macht zwei Dinge: 1. Zuerst multipliziert sie die Zellkoordinaten mit der Zellgröße, was uns die Position der oberen linken Ecke der Zelle auf dem Bildschirm in Pixeln gibt. 2. Anschließend addieren wir die Hälfte der Zellgröße, um die Mitte der Zelle zu erhalten. Die Funktion gibt das Ergebnis zurück, sodass wir es in einer Variablen speichern können.
fr: Pour ce faire, nous utilisons une fonction. La fonction fait deux choses : 1. Premièrement, elle multiplie les coordonnées de la case par sa taille, ce qui nous donne la position du coin supérieur gauche de la case sur l'écran, en pixels. 2. Ensuite, nous ajoutons la moitié de la taille de la case pour obtenir le centre de la case. La fonction renvoie le résultat, ce qui nous permet de le stocker dans une variable.
it: Per farlo, utilizziamo una funzione. La funzione fa due cose: 1. Innanzitutto, moltiplica le coordinate della cella per la dimensione della cella, ottenendo così la posizione dell'angolo superiore sinistro della cella sullo schermo, in pixel. 2. Poi aggiunge la metà della dimensione della cella per ottenere il centro della cella. La funzione restituisce il risultato, che può essere memorizzato in una variabile.
ja: そのために、関数を使用します。この関数は 2 つのことを行います。 1.まず、セル座標にセルサイズを掛けて、画面上のセルの左上隅の位置をピクセル単位で求めます。 2.次に、セルサイズの半分を追加して、セルの中心を取得します。 関数は結果を返し、変数に格納できるようにします。
nl: Hiervoor gebruiken we een functie. De functie doet twee dingen: 1. Eerst vermenigvuldigt het de celcoördinaten met de celgrootte, wat ons de positie van de linkerbovenhoek van de cel op het scherm geeft, in pixels. 2. Vervolgens tellen we de helft van de celgrootte op om het middelpunt van de cel te krijgen. De functie geeft het resultaat terug, zodat we het in een variabele kunnen opslaan.
pt_br: Para fazer isso, usamos uma função. A função faz suas coisas: 1. Primeiro, ela multiplica a coordenada da célula pelo tamanho de célula. Isso nos dá a posição do canto superior esquerdo da célula na tela, em pixels. 2. Então, nós adicionamos metade do tamanho da célula para calcular o centro da célula. A função retorna um resultado, o que nos permite armazená-lo em uma variável.
ru: Для этого мы используем функцию. Функция делает две вещи: 1. Сначала координаты ячейки умножаются на размер ячейки, что даёт нам положение верхнего левого угла ячейки на экране в пикселях. 2. Затем мы добавляем половину размера ячейки, чтобы получить центр ячейки. Функция возвращает результат, что позволяет нам сохранить его в переменной.
tr: Bunu yapmak için bir fonksiyon kullanırız. Fonksiyon iki şey yapar: 1. İlk olarak, hücre koordinatlarını hücre boyu ile çarpar, bu da bize hücrenin ekrandaki sol üst köşesinin konumunu piksel cinsinden verir. 2. Ardından, hücrenin merkezini elde etmek için hücre boyunun yarısını ekleriz. Fonksiyon geriye bir sonuç döndürerek bunu bir değişkende saklamamızı sağlar.
zh_hans: 为此，我们要用到一个函数。该函数应有两个功能： 第一步，它将单元格坐标乘以单元格大小，得出单元格的左上角在屏幕上的位置（以像素为单位）。 第二步，加上一个单元格的大小的二分之一，得到单元格的中心点的位置。 函数会返回这个结果，然后我们就可以将其存储在变量中。

source: The [code]return[/code] keyword returns the value to the code calling the function. You'll receive the result where you call the function.
de: Das Schlüsselwort [code]return[/code] gibt den Wert an die Codezeile zurück, die, die Funktion aufruft. Du erhälst das Ergebnis, in dem du die Funktion aufrufst.
es: La palabra clave [code]return[/code] devuelve el valor al código que llama a la función. Recibirás el resultado donde llames a la función.
fr: Le mot-clé [code]return[/code] renvoie la valeur au code qui appelle la fonction. Vous recevrez le résultat à l'endroit où vous appelez la fonction.
it: La parola chiave [code]return[/code] riporta il valore nella stringa di code in cui viene chiamata la funzione. Riceverai dunque il risultato della funzione nel punto in cui la chiami.
ja: [code]return[/code] キーワードは、関数を呼び出すコードに値を返します。 関数を呼び出した場所で結果を受け取ります。
nl: Het sleutelwoord [code]return[/code] geeft de waarde terug aan de code die de functie aanroept. Je ontvangt het resultaat waar je de functie aanroept.
pt_br: A palavra-chave [code]return[/code] retorna o valor para o código que está chamando a função. Você vai receber o resultado onde chamar a função.
ru: Ключевое слово [code]return[/code] возвращает значение в то место в коде, где была вызвана функция. Вы получите результат после того, как вызовете функцию.
tr: [code]return[/code] anahtar kelimesi, ilgili değeri, fonksiyonu çağıran koda döndürür. Sonucu, fonksiyonu çağırdığınız yerde alırsınız.
zh_hans: [code]return[/code] 关键字将值返回给调用函数的代码。你会在调用该函数的位置收到结果。

source: Some functions return values, and some do not. During practices, you can learn which functions return a value using the documentation panel. It will display if the practice requires using specific functions or variables. There, functions that start with the term [code]void[/code] do not return a value. Any other term means the function does return a value. You'll learn more about what other terms mean in a couple of lessons when we explore value [i]types[/i]. For now, let's practice returning values from functions!
de: Einige Funktionen geben Werte zurück, andere nicht. Welche Funktionen ein Ergebnis zurückgeben, erfährst du in der Dokumentation im Übungsbild. Dort geben Funktionen, die mit dem Begriff [code]void[/code] beginnen, keinen Wert zurück. Jeder andere Begriff bedeutet, dass die Funktion einen Wert zurückgibt. Du wirst in ein paar Lektionen mehr darüber erfahren, was andere Begriffe bedeuten, wenn wir Wert[i]typen[/i] erforschen. Lass uns zunächst üben, Werte aus Funktionen zurückzugeben!
fr: Certaines fonctions renvoient des valeurs, et d'autres non. Vous pouvez apprendre quelles fonctions renvoient un résultat à l'aide du panneau de documentation dans l'écran des pratiques. Il s'affichera si l'exercice requiert l'utilisation de fonctions ou de variables spécifiques. Là, les fonctions qui commencent par le terme [code]void[/code] ne renvoient pas de valeur. Tout autre terme signifie que la fonction renvoie une valeur. Vous en apprendrez plus sur la signification des autres termes dans quelques leçons lorsque nous explorerons les [i]types[/i] de valeur. Pour l'instant, entraînons-nous à renvoyer des valeurs à partir de fonctions !
it: Alcune funzioni restituiscono valori, altre no. Durante le esercitazioni, è possibile sapere quali funzioni restituiscono un valore utilizzando il pannello della documentazione. Il pannello mostrerà se l'esercizio richiede l'uso di funzioni o variabili specifiche. Le funzioni che iniziano con il termine [code]void[/code] non restituiscono un valore. Qualsiasi altro termine significa che la funzione restituisce un valore. Il significato degli altri termini verrà spiegato meglio tra un paio di lezioni, quando esploreremo i [i]tipi di valore[/i]. Per ora, esercitiamoci a restituire valori dalle funzioni!
ja: 戻り値を返す関数と戻さない関数があります。演習中に、どの関数が値を返すかをドキュメントパネルを使用して学習できます。演習で特定の関数または変数を使用する必要がある場合に表示されます。 そこでは、用語 [code]void[/code] で始まる関数は値を返しません。その他の用語は、関数が値を返すことを意味します。他の用語の意味については、値[i]型[/i]について調べるいくつかのレッスンで詳しく説明します。 とりあえず、関数から値を返す演習をしましょう!
nl: Sommige functies geven een waarde terug, andere niet. Tijdens de oefeningen kun je leren welke functies een waarde teruggeven door middel van het documentatiepaneel. Het wordt aangegeven als de oefening het gebruik van specifieke functies of variabelen vereist. Functies die [code]void[/code] na de pijl hebben geven geen waarde terug. Elke andere term betekent dat de functie wel een waarde teruggeeft. Je zult meer leren over wat andere termen betekenen over een paar lessen wanneer we [i]waardentypes[/i] gaan verkennen. Laten we nu oefenen met het teruggeven van waarden uit functies!
pt_br: Algumas funções retornam valores e outras não. Você pode aprender quais funções retornam um resultado através do painel de documentação na tela de prática. Ele vai mostrar se a prática requer o uso de função ou variáveis específicas. Lá, as funções que começam com o termo [code]void[/code] não retornam um valor. Qualquer outro termo significa que a função retorna um valor. Você vai aprender mais sobre o significado de outros termos mais pra frente quando explorarmos [i]tipos[/i] de valor. Por enquanto, vamos praticar o retorno de valores de funções!
ru: Некоторые функции возвращают значения, а некоторые — нет. Вы можете узнать, какие функции возвращают значение при помощи панели документации на экране упражнения. Здесь, функции, начинающиеся с термина [code]void[/code] не возвращают значение. В остальных случаях функция возвращает значение. Вы узнаете больше о том что значат другие термины через несколько уроков, когда мы рассмотрим [i]типы[/i] значений. А пока что давайте поупражняемся в возвращении значений из функций!
tr: Bazı fonksiyonlar değer döndürür, ve bazıları döndürmez. Alıştırmalar sırasında, dokümantasyon panelini kullanarak hangi fonksiyonların değer döndürdüğünü öğrenebilirsiniz. Eğer alıştırma, belirli fonksiyonların veya değişkenlerin kullanılmasını gerektiriyorsa görüntülenecektir. Burada, [code]void[/code] terimiyle başlayan fonksiyonlar bir değer döndürmez. Başka herhangi bir terim, fonksiyonun bir değer döndürdüğü anlamına gelir. Diğer terimlerin ne anlama geldiği hakkında daha fazla bilgiyi birkaç ders sonra değer [i]tipleri[/i] incelerken öğreneceksiniz. Şimdilik, fonksiyonlardan değer döndürme alıştırması yapalım!
zh_hans: 有些函数会返回值，有些不会。你可以使用练习界面中的文档面板了解哪些函数会返回结果。 在那里，以关键字 [code]void[/code] （空）开头的函数不返回值。任何其他关键字都意味着该函数确实返回一个值。当我们探索值 [i]各种类型[/i] 时，你会在几节课的时间中了解更多其他关键字的含义。 现在，让我们练习从函数返回值！

source: Define a function that converts a position on a grid to the screen. The function takes a [code]Vector2[/code] cell coordinate as an argument. It should return the corresponding [code]Vector2[/code] screen coordinates at the center of the cell.
de: Definiere eine Funktion, die eine Position auf einem Raster in einen Punkt auf dem Bildschirm umwandelt. Die Funktion verwendet die Zellenkoordinaten [code]Vector2[/code] als Argument. Es sollte die entsprechenden [code]Vector2[/code] Bildschirmkoordinaten in der Mitte der Zelle zurückgeben.
es: Define una función que convierta una posición de una cuadrícula a la pantalla. La función toma las coordenadas de una celda [code]Vector2[/code] como argumento. Esta debe devolver las coordenadas de pantalla [code]Vector2[/code] correspondientes en el centro de la celda.
fr: Définissez une fonction qui convertit une position sur une grille à l'écran. La fonction prend une coordonnée de case [code]Vector2[/code] comme argument. Elle doit renvoyer les coordonnées d'écran [code]Vector2[/code] correspondantes au centre de la case.
it: Definisci una funzione che converte una posizione sulla griglia ad una posizione sullo schermo. La funzione accetta coordinate di cella del tipo [code]Vector2[/code] come argomento. Dovrebbe riportare le corrispondenti coordinate sullo schermo, del tipo [code]Vector2[/code], al centro della cella.
ja: グリッド上の位置を画面に変換する関数を定義します。 この関数は、引数として [code]Vector2[/code] セル座標を取ります。セルの中央にある対応する [code]Vector2[/code] 画面座標を返す必要があります。
nl: Definieer een functie die een positie op een raster converteert naar het scherm. De functie neemt een [code]Vector2[/code] aan celcoördinaten als argument. De functie moet de overeenkomstige [code]Vector2[/code] schermcoördinaten in het midden van de cel teruggeven.
pt_br: Defina uma função que converta uma posição de um grid para a tela. A função recebe as coordenadas de uma célula do tipo [code]Vector2[/code] como argumento. Ela deve retornar as coordenadas de tela do tipo [code]Vector2[/code] no centro da célula.
ru: Определите функцию для конвертации позиции на сетке в позицию на экране. Эта функция принимает [code]Vector2[/code] — координату ячейки, в качестве аргумента. Она должна возвращать [code]Vector2[/code] — позицию центра ячейки на экране.
tr: Izgara üzerindeki bir konumu, ekrana uygun dönüştüren bir fonksiyon tanımlayın. Fonksiyon, girdi değişkeni olarak bir [code]Vector2[/code] hücre konumu alacak. Bu hücrenin ekrandaki merkezine karşılık gelen [code]Vector2[/code] konumları döndürmelidir.
zh_hans: 定义一个将网格上的位置转换为屏幕位置的函数。 该函数将 [code]Vector2[/code] 单元格坐标作为参数。它应该返回单元格中心对应的 [code]Vector2[/code] 屏幕坐标。

source: We lost the function to convert grid coordinates, but we desperately need it for our game! Make the turtle move again by coding it.
de: Wir haben die Funktion zum Konvertieren von Gitterkoordinaten verloren, aber wir brauchen sie dringend für unser Spiel! Lass die Schildkröte sich wieder bewegen, indem du sie programmierst.
es: Hemos perdido la función para convertir las coordenadas de la cuadrícula, ¡pero la necesitamos desesperadamente para nuestro juego! Haz que la tortuga se mueva de nuevo codificándola.
fr: Nous avons perdu la fonction permettant de convertir les coordonnées de la grille, mais nous en avons désespérément besoin pour notre jeu ! Faites bouger la tortue à nouveau en la codant.
it: Abbiamo perso la funzione che converte le coordinate nella griglia, ma ci serve assolutamente per il nostro gioco! Fai in modo che la tartaruga riprenda a muoversi scrivendo il codice necessario.
ja: グリッド座標を変換する機能を失いましたが、ゲームにはどうしても必要です!カメをコーディングして再び動かします。
nl: We zijn de functie om rastercoördinaten om te zetten kwijt, maar we hebben hem hard nodig voor ons spel! Laat de schildpad weer bewegen door hem te programmeren.
pt_br: Perdemos a função de converter as coordenadas de grid, mas precisamos desesperadamente dela para o nosso jogo! Faça a tartaruga se mover novamente programando ela.
ru: Мы потеряли функцию для конвертации координат сетки, но она черезвычайно важна для нашей игры! Заставьте черепаху двигаться при помощи программирования снова.
tr: Izgara konumlarını dönüştüren fonksiyonu kazara kaybettik, ancak oyunumuz için buna çok ihtiyacımız var! Kaplumbağayı kodlayarak tekrar hareket etmesini sağlayın.
zh_hans: 我们弄丢了转换网格坐标的函数，但我们的游戏没了它不行！写好它，使小海龟能再次移动。

source: Imagine you have a game where you track the player's health as a percentage, a decimal number going from [code]0.0[/code] to [code]100.0[/code]. When displaying the health on the interface, you don't want to show the decimal part. In that case, you may use the [code]round()[/code] function, like so.
es: Imagina que tienes un juego en el que llevas la cuenta de la salud del jugador como un porcentaje, un número decimal que va de [code]0.0[/code] a [code]100.0[/code]. Al mostrar la salud en la interfaz, no quieres mostrar la parte decimal. En ese caso, puedes utilizar la función [code]round()[/code], así.

source: You can make [i]your[/i] functions return values. To make a function return a value, you use the [code]return[/code] keyword followed by the value in question. In previous lessons, we had characters walking on grids. And for those practices, you were working directly with cell coordinates. Well, cell coordinates don't correspond to positions on the screen, so we need to convert cell positions to screen positions.
es: Puedes hacer que [i]tus[/i] funciones devuelvan valores. Para hacer que una función devuelva un valor, debes utilizar la palabra clave [code]return[/code] seguida del valor en cuestión. En las lecciones anteriores, teníamos personajes que caminaban sobre cuadrículas. Y para esas prácticas, estuviste trabajando directamente con coordenadas de celdas. Pues bien, las coordenadas de las celdas no se corresponden con las posiciones en la pantalla, así que tenemos que convertir las posiciones de las celdas en posiciones de la pantalla.

source: To do so, we use a function. It multiplies the cell coordinate by the cell size, adds half the cell size to the product, and returns the result.
es: Para ello, utilizamos una función. Esta multiplica la coordenada de la celda por el tamaño de la misma, le suma la mitad del tamaño de la celda al producto y devuelve el resultado.

source: Some functions return values, and some do not. You can learn which functions return a result using the documentation panel in the practice screen. There, functions that start with the term [code]void[/code] do not return a value. Any other term means the function does return a value. You'll learn more about what other terms mean in a couple of lessons when we explore value [i]types[/i]. For now, let's practice returning values from functions!
es: Algunas funciones devuelven valores y otras no. Puedes saber qué funciones devuelven un resultado utilizando el panel de documentación de la pantalla de prácticas. Allí, las funciones que empiezan con el término [code]void[/code] no devuelven ningún valor. Cualquier otro término significa que la función sí devuelve un valor. Aprenderás más sobre el significado de otros términos en un par de lecciones, cuando exploremos los [i]tipos[/i] de valores. Por ahora, ¡vamos a practicar la devolución de valores desde las funciones!
