Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-3-standing-on-shoulders-of-giants.po
Languages: hu, pl, pt, sk, sv, tr, zh_hans

source: As programmers, we rely on a lot of code created by others before us.
hu: Programozóként, sok olyan kódot használunk, amit mások írtak.
sk: Ako programátori sa spoliehame na veľa kódu vytvoreného inými pred nami.

source: Every programming language comes with a wealth of features created by other programmers to save you time.
hu: Minden programnyelv olyan funkciókkal gazdagon érkezik, melyeket más programozók készítettek.
sk: Každý programovací jazyk je dodávaný s množstvom funkcií vytvorených inými programátormi, aby nám ušetrili čas.

source: We call a bundle of code created by fellow developers a [i]library[/i].
hu: Ezeket a kódcsomagokat [i]könyvtárnak[/i] hívjuk.
sk: Balík kódu vytvorený kolegami programátormi nazývame [i]knižnica[/i].

source: It's a bunch of code sitting there, waiting for you to use it.
hu: Ez egy rakás kód, ami csak arra vár, hogy használd.
sk: Je to celá kopa kódu, ktorá len čaká, kedy ho použijeme.

source: Game engines like Godot bundle many libraries together. They provide a massive toolset to save you time when making games.
hu: A játék engine-ek sok ilyen könyvtárból állnak. Rengeteg ezsközt kínálnak számodra, amivel időt spórolhatsz a játékaid készítésekor.
sk: Herné enginy ako Godot spájajú dokopy mnohé knižnice. Poskytujú masívnu sadu nástrojov, ktoré vám ušetria čas pri tvorbe hier.

source: You'll always use a lot of existing code
hu: Mindig egy csomó, már létező kódot fogsz használni
pl: Zawsze będziesz używał całej masy istniejącego kodu
pt: Sempre vai usar muitos códigos que já estão prontos
sk: Vždy budete využívať množstvo existujúceho kódu
sv: Du använder alltid mycket befintlig kod
tr: Her zaman, sürüyle hazırda bekleyen kod kullanacaksınız
zh_hans: 你总会用上很多现成的代码

source: When coding, you always use a lot of code from developers who came before you.
hu: Amikor programozol, egy csomó olyan kódot gogsz használni, amit olyan programozók készítettek, akik előtted jártak.
sk: Pri programovaní budete vždy používať veľa kódu od predošlých vývojárov.

source: In a moment, you'll write your first code. You'll use [i]functions[/i] created by the Godot developers.
hu: Nemsokára megírod az első saját kódod. A Godot fejlesztői által létrehozott [i]függvényeket[/i] fogsz használni.
sk: Za chvíľu napíšete svoj prvý kód. Budete používať [i]funkcie[/i] vytvorené vývojármi Godotu.

source: A function is a list of instructions with an exact name. We can tell the computer to execute all the instructions in sequence with that name.
hu: A függvény egy névvel pontosan ellátott utasításkészlet. Ezzel a névvel megmondhatjuk a számítógépnek, hogy sorban hajtsa végre az összes benne lévő utasítást.
sk: Funkcia je zoznam inštrukcií s jednoznačným názvom. Počítaču môžeme povedať, aby vykonal všetky inštrukcie v poradí s týmto názvom.

source: Calling functions
hu: Függvények hívása
pl: Wywoływanie funkcji
pt: Chamando funções
sk: Volanie funkcií
sv: Att anropa funktioner
tr: Fonksiyonları çağırma
zh_hans: 调用函数

source: When you tell the computer to execute a function, we say you [i]call[/i] the function.
hu: Amikor arra kéred a számítógépet, hogy hajtson végre egy függvényt, azt mondjuk, hogy [i]hívod[/i] a függvényt.
sk: Keď počítaču prikážete aby vykonal funkciu, hovoríme, že [i]voláte[/i] funkciu.

source: To call a function, you write its [i]exact[/i] name followed by an open and closed parenthesis. To call the function named "show", you would write [code]show()[/code].
hu: Függvényhíváskor le kell írni a [i]pontos[/i] nevét, majd egy nyitó és csukó zárójelet kell tenni a végére. A "show" nevű függvény hívása így történik: [code]show()[/code].
sk: Aby ste funkciu zavolali, napíšete jej [i]presný[/i] názov nasledovaný ľavou a pravou zátvorkou. Aby ste zavolali funkciu s názvom "show", napíšete [code]show()[/code].

source: In Godot, calling [code]show()[/code] makes something visible, like a character or item. The complementary [code]hide()[/code] function hides the entity.
hu: Ha a Godot Engine-ben hívjuk a [code]show()[/code] függvényt, akkor az valamit láthatóvá tesz, például egy karaktert vagy tárgyat. A kiegészítő [code]hide()[/code] függvény pedig elrejti azt.
sk: Zavolaním [code]show()[/code] v Godote sa niečo zviditeľní, napr. postava alebo predmet. Doplnková funkcia [code]hide()[/code] zas niečo skryje.

source: Once an entity is visible, calling [code]show()[/code] again doesn't have any effect.
hu: Ha valami már látható, akkor a [code]show()[/code] ismételt hívása nem fog csinálni semmit.
sk: Keď už je raz niečo viditeľné, volanie [code]show()[/code] nemá žiaden účinok.

source: Similarly, once you hide something, calling [code]hide()[/code] again doesn't change anything.
hu: Ugyanígy, ha elrejtettél valamit, a [code]hide()[/code] ismételt hívása nem fog változtatni semmit.
sk: Podobne ak je niečo skryté, volanie [code]hide()[/code] na tom nič nezmení.

source: [i]Click the Run button on any example below to execute the code listing.[/i]
hu: [i]Kattints a "Futtatás" gombra valamelyik példa alatt, hogy futtasd a kódot.[/i]
sk: [i]Kliknutím na Run v niektorej z ukážok dole spustíte napísaný kód.[/i]

source: In the code listing above, we write the function call [code]hide()[/code] in a new function named [code]run()[/code] to execute the code. Creating a new function is necessary to execute instructions in GDScript.
hu: A fenti példában, a [code]hide()[/code] függvényt egy új, [code]run()[/code] nevű függvénye írjuk, hogy fusson a kód. A Godotban muszáj új függvényt létrehozni, hogy utasításokat lehessen megadni.
pt: No código listado acima, escrevemos a chamada de função [code]hide()[/code] numa nova função chamada [code]run()[/code] para executar o código. A criação de uma nova função é necessária para executar instruções no GDScript.
sk: Vo výpise kódu hore sme napísali volanie funkcie [code]hide()[/code] do novej funkcie s názvom [code]run()[/code], aby sa kód vykonal. Pre vykonanie inštrukcií je v Godote potrebné vytvoriť novú funkciu.
sv: I koden ovan skriver vi funktionsanropet [code]hide()[/code] i en ny funktion som heter [code]run()[/code] för att köra koden. Att skapa en ny funktion är nödvändigt för att köra instruktioner i GDScript.
tr: Yukarıdaki kod listesinde, [code]hide()[/code] fonksiyon çağırmasını, kodu çağırmak için [code]run()[/code] isimli yeni bir fonksiyonun içinde yazdık. GDScript'te talimatları işlemek için yeni bir fonksiyon oluşturmak gereklidir.
zh_hans: 在上面的代码清单中，我们在一个名为 [code]run()[/code] 的新函数中编写了函数调用 [code]hide()[/code] 来执行代码。 在 GDScript 中执行指令需要创建一个新函数。

source: Can you tell me more about that "run()" function?
hu: Tudná még mesélni erről a "run()" függvényről?
pl: Zdradzicie coś więcej o funkcji „run()”?
pt: Pode me falar algo mais sobre aquela função "run()"?
sk: Môžete mi povedať viac o funkcii "run()"?
sv: Kan du berätta mer om den "run()"-funktionen?
tr: Bana "run()" fonksiyonu hakkında daha başka ne söyleyebilirsin?
zh_hans: 你能告诉我更多关于“run()”函数的信息吗？

source: In GDScript, unlike in some other languages, we must write our code inside of custom functions.
hu: A GDScriptben, néhány más nyelvtől eltérően, muszája kódotegyedi függvényekben írni.
sk: V GDScripte, na rozdiel od niektorých iných jazykov, musíme náš kód písať dovnútra vlastných funkcií.

source: You'll learn what functions are and how they work in great detail in the course, but here's a quick look at them if you're curious.
hu: A kurzusban részletesen megtanulod majd, hogy mik a függvények és hogy működnek, de itt egy kis ízelítő, ha kíváncsi vagy.
sk: Čo sú funkcie a ako pracujú sa detailne naučíte v priebehu kurzu, ale ak ste zvedaví, tu je stručný náhľad na ne.

source: A function is a bundle of code you can execute anytime. It's a named list of instructions.
hu: A függvény egy kódgyűjtemény, amit akármikor végrehajthatsz. Ez egy névvel ellátot utasításlista.
sk: Funkcia je balík kódu, ktorý môžete kedykoľvek spustiť. Ide o pomenovaný zoznam inštrukcií.

source: To define a function, you need to write the [code]func[/code] keyword, the function's name, parentheses, and a colon: [code]func run():[/code] defines a function named [code]run()[/code].
hu: Függvény létrehozásához, a [code]func[/code] kulcsszó után megkell adni a nevet, majd egy zárójelpárt végül egy kettőspontot: a [code]func run():[/code] létrehoz egy run [code]run()[/code] nevű függvényt.
sk: Aby ste zadefinovali funkciu, musíte napísať kľúčové slovo [code]func[/code], názov funkcie, zátvorky a dvojbodku: [code]func run():[/code] definuje funkciu s názvom [code]run()[/code].

source: You then go to the next line to write the function's body. That's the instructions of the function.
hu: Ezután a következő sorban írod a függvény törzsét. Ezek a függvényben lévő utasítások.
sk: Potom pokračujete na ďalšom riadku telom funkcie. Telo tvoria inštrukcie funkcie.

source: Notice how each instruction starts with a leading [code]Tab[/code] character. The computer uses that to know which lines are part of the function.
hu: Vedd észre, hogy minden utasítás egy [code]Tab[/code] karakterrel kezdődik. A számítógép ez alapján tudja, hogy mely sorok tartoznak a függvényhez.
sk: Všimnite si, že každá inštrukcia začína úvodným znakom [code]Tab[/code]. Podľa toho počítač pozná, ktoré riadky patria do funkcie.

source: Throughout the course, you'll see many functions called [code]run()[/code].
hu: A kurzus során sok [code]run()[/code] nevű függvénnyel fogsz találkozni.
sk: V priebehu kurzu uvidíte ešte veľa funkcií s názvom [code]run()[/code].

source: Those are functions we created to give you interactive examples.
hu: Azokat a függvényeket mi készítettük, hogy interaktív példákat mutassunk.
sk: Sú to funkcie, ktoré sme vytvorili ako interaktívne ukážky pre vás.

source: Function arguments
hu: Függvény argumentumok
pl: Argumenty funkcji
pt: Argumentos de função
sk: Argumenty funkcie
sv: Funktionsargument
tr: Fonksiyon girdi değişkenleri (argümanları)
zh_hans: 函数参数

source: Here's a [i]sprite[/i] standing straight. If we call the [code]rotate(0.3)[/code] function, the character [i]sprite[/i] turns by 0.3 radians.
hu: Itt egy egyenesen álló [i]sprite[/i]. Ha hívjuk a [code]rotate(0.3)[/code] függvényt, a [i]sprite[/i] elfordul 0.3 egységnyivel.
sk: Dole je [i]sprite[/i] stojaci rovno. Keď zavoláme funkciu [code]rotate(0.3)[/code], otočí sa [i]sprite[/i] postavičky o 0,3 radiánu.

source: The [code]0.3[/code] part between the parentheses is the function's [i]argument[/i].
hu: A [code]0.3[/code] a zárójelben a függvény [i]argumentuma[/i].
sk: Číslo [code]0.3[/code] v zátvorkách je [i]argument[/i] funkcie.

source: Arguments are values (numbers, bits of text, and more) that change how the function behaves.
hu: Az argumentumok értékek (számok, szavak, stb) amelyek megváltoztatják a függvény működését.
sk: Argumenty sú hodnoty (čísla, kúsky textu, a ďalšie), ktoré ovplyvňujú chovanie funkcie.

source: Arguments let you fine-tune the effect of the function call. They can be optional at times, but functions often require arguments in order to work.
hu: Az argumentumok segítenek finomhangolni a függvényhívást. Nem mindig kötelező megadni őket, de a függvények gyakran igényelnek argumentumokat a működéshez.
sk: Argumenty vám umožňujú určiť výsledok volania funkcie. Občas môžu byť voliteľné, ale funkcie často vyžadujú argumenty, aby fungovali.

source: For example, calling [code]rotate()[/code] without any argument would result in an error. Without an argument, Godot doesn't know by [i]how much[/i] you intend to rotate the [i]sprite[/i].
hu: Például, a [code]rotate()[/code] függvény hívása argumentumok nélkül, hibaüzentet eredményez. Argumentumok nélkül a Godot nem tudja [i]mennyivel[/i] akarod elforgatni a [i]sprite[/i]-ot.
sk: Napríklad volanie [code]rotate()[/code] bez argumentu by spôsobilo chybu. Bez argumentu Godot netuší [i]o koľko[/i] chcete [i]sprite[/i] natočiť.

source: Don't worry about memorizing what arguments each function requires or accepts! As a programmer, the documentation will always be close by for you to refer to.
hu: Ne aggódj, nem kell megjegyezni melyik függvény milyen argumentumokat fogad! Programozóként a dokumentáció mindig ott lesz, ha puskáznod kell.
sk: Nestrachujte sa, že by ste si museli pamätať aké argumenty každá funkcia vyžaduje alebo akceptuje! Ako programátor budete mať vždy po ruke k nahliadnutiu dokumentáciu.

source: Finally, notice how we use a dot in the number [code]0.3[/code] above: you need to use a dot like this to represent decimal numbers. You can't use commas as they have a different purpose in code.
hu: Végezetül, vedd észre, hogy a pontot használtunk [code]0.3[/code] leírásánál: a törtszámokat tizedesponttal jelöljük. Nem használhatsz erre a célra vesszőt, mert annak más szerepe van.
sk: Nakoniec si všimnite ako hore v čísle [code]0.3[/code] používame bodku: takúto bodku používajte na vyjadrenie desatinných čísiel. Nesmiete použiť čiarky, pretože tie majú v kóde iný účel.

source: What are radians?
hu: Mi az a radián?
pl: Czym są radiany?
pt: O que é radiano?
sk: Čo sú radiány?
sv: Vad är radianer?
tr: Radyan nedir?
zh_hans: 什么是弧度？

source: The value of [code]0.3[/code] is an angle in [i]radians[/i]. In daily life, we're used to measuring angles in degrees. The radian is another scale commonly used in video games and math.
hu: A [code]0.3[/code] egy [i]radiánban[/i] megadott szög. A hétköznapi életben erre fokot használunk. A radián egy másik, videójátékokban és matematikában gyakran használt mértékegység.
sk: Hodnota [code]0.3[/code] je uhol v [i]radiánoch[/i]. V bežnom živote sme zvyknutí merať uhly v stupňoch. Radián je len iná uhlová jednotka, ktorá sa bežne používa vo videohrách a v matematike.

source: You can convert radians into degrees by multiplying them by 180 and dividing them by PI:
hu: A radiánt át lehet váltani fokba, csak be kell szorozni 180-nal, majd elosztani PI-vel:
sk: Radiány sa dajú na stupne previezť tak, že ich vynásobíte 180 a vydelíte PI:

source: [code]degrees = radians * 180 / PI[/code]
hu: [code]fok = radian * 180 / PI[/code]

source: An angle of [code]PI[/code] radians corresponds to [code]180[/code] degrees. And [code]2 * PI[/code] is a full turn: [code]360[/code] degrees.
hu: Radiánban a [code]PI[/code] egy [code]180[/code] fokos szögnek felel meg. [code]2 * PI[/code] pedig egy teljes fordulat: [code]360[/code] fok.
sk: Uhol [code]PI[/code] radiánov zodpovedá [code]180[/code] stupňom. A [code]2 * PI[/code] je celá otáčka: [code]360[/code] stupňov.

source: [b]How do radians work exactly?[/b]
hu: [b]Pontosan hogy működik a radián?[/b]
sk: [b]Ako presne radiány fungujú?[/b]

source: Radians are a way to measure angles based on the radius of a circle.
hu: A radián a kör sugarán alapuló módja a szögek mérésének.
sk: Radiány predstavujú spôsob ako merať uhly na základe polomeru kružnice.

source: To get the angle in radians, you take the circle's radius and wrap it around the circle. That angle is [code]1[/code] radian because you are wrapping the radius [code]1[/code] time around the circle.
hu: Ahhoz, hogy megkapjuk a szöget radiánban, vennünk kell a kör sugarát, majd ezt körbetekerni a kerületén. Ez a szög [code]1[/code] radián lesz, mert a sugarat [code]1[/code] alkalommal tekerted a kör köré.
sk: Aby ste zmerali uhol v radiánoch, vezmete polomer kružnice a nanesiete ho na kružnicu. Tento uhol je [code]1[/code] radián pretože ste naniesli polomer [code]1[/code] krát na kružnicu.

source: Because the perimeter of a circle is [code]2 * PI * radius[/code], a full turn (360°) corresponds to [code]2 * PI[/code] radians: you need to wrap the radius of a circle [code]2 * PI[/code] times around the circle to make a full circle.
hu: Mivel a kör kerülete [code]2 * PI * radius[/code], ezért egy teljes fordulat (360°) megegyezik [code]2 * PI[/code] radiánnal: a kör sugarát [code]2 * PI[/code] alkalommal kell a kör köré tekerni.
sk: Pretože obvod kruhu je [code]2 * PI * radius[/code], celá otáčka (360°) zodpovedá [code]2 * PI[/code] radiánom: aby ste obišli celý kruh musíte naň naniesť jeho polomer [code]2 * PI[/code] krát.

source: What does the code below do?
hu: Mit csinál az alábbi kód?
pl: Co robi poniższy kod?
pt: O que o código abaixo faz?
sk: Čo robí naledujúci kód?
sv: Vad gör koden nedan?
tr: Aşağıdaki kod ne yapıyor?
zh_hans: 下面的代码有什么作用？

source: Both answers were right! Technically, the code calls the [code]show()[/code] function. And doing so makes the game entity visible.
hu: Mindkét válasz helyes volt! [code]show()[/code] függvényt. Ennek eredményeképpen pedig láthatóvá válik az a dolog.
pl: Obie odpowiedzi były prawidłowe! Z technicznego punktu widzenia kod wywołuje funkcję [code]show()[/code]. A dzięki jej wywołaniu dana rzecz staje się widoczna.
pt: Ambas as respostas estavam corretas! Tecnicamente, o código chama a função [code]show()[/code]. E fazendo isso, ela deixa a entidade do jogo visível.
sk: Obe odpovede boli správne! Technicky, kód volá funkciu [code]show()[/code]. A tým sa herná entita zviditeľní.
sv: Båda svaren var rätt! Tekniskt sett anropar koden funktionen [code]show()[/code]. Och att göra det gör spelet synligt.
tr: Her iki cevapta doğrudur. Teknik olarak kod, [code]show()[/code] fonksiyonunu çağırır. Ve bunu yapmak oyun varlığını görünür yapar.
zh_hans: 两个答案都是对的！ 从技术上讲，代码调用 [code]show()[/code] 函数。 这样做会使游戏实体可见。

source: It makes the entity (like a game character or a sprite) visible.
hu: Láthatóvá teszi az adott dolgot (játékos karakter, sprite, stb).
pl: Sprawia, że dana rzecz (jak postać w grze lub sprite) staje się widoczna.
pt: Ele faz a entidade ficar visível (como uma personagem ou uma sprite).
sk: Zviditeľní entitu (napr. hernú postavu alebo sprite).
sv: Det gör entiteten (till exempel en spelkaraktär eller en sprite) synlig.
tr: Bir varlığı (oyun karakteri veya grafik öğe) görünür yapar.
zh_hans: 它使实体（如游戏角色或精灵）可见。

source: The complementary function [code]move_local_y()[/code] makes the character move up and down.
hu: A párja, a [code]move_local_y()[/code] pedig fel és le mozgatja a [i]sprite[/i]-ot.

source: This is one way to move a character in a game, although we'll see more powerful ways to do this later.
hu: Ez egy módja a karakter mozgatásának, azonban, később találkozunk majd sokkal jobb módszerekkel is.

source: Why move_local_y(20) moves the character down
hu: Ezért mozgatja a "move_local_y(20)" lefelé a karaktert
pl: Dlaczego move_local_y(20) przesuwa postać w dół
pt: Porque a função move_local_y(20) move a personagem para baixo
sv: Därför flyttar move_local_y(20) karaktären neråt
tr: Neden move_local_y(20) karakteri "aşağı" hareket ettiriyor
zh_hans: 为什么 move_local_y(20) 将角色向下移动

source: With positive values ([code]20[/code]), the code above moves the robot to the right and down.
hu: Pozitív értékekkel ([code]20[/code]), a kód a robotot jobbra és lefelé mozdítja el.

source: This is probably different than what you studied at school: in math classes, the horizontal axis points to the right, like here, but the vertical axis points up.
hu: Ez valószínűleg különbözik az általad tanultaktól: matek órán, a vízszintes tengely jobbra mutat, mint itt, a függőleges tengely azonban felfelé.

source: In video games, and generally in 2D computer graphics, the vertical axis points down instead. So whenever you move something on the Y-axis with a positive value, it'll move [i]down[/i].
hu: A videójátékokban, meg úgy általában a 2D számítógépes grafikában, a függőleges tengely lefelé mutat. Így mindig, ha pozitív értékkel ozdítasz el valamit az Y tengelyen, az [i]lefelé[/i] fog mozogni.

source: How do you call a function?
hu: Hogyan kell függvényt hívni?
pl: W jaki sposób wywołujesz funkcję?
pt: Como chamar uma função?
sv: Hur anropar man en funktion?
tr: Bir fonksiyonu nasıl çağırırsın?
zh_hans: 你如何调用一个函数？

source: What is the syntax you use to call a function in general?
hu: Mi az általános módja egy függvény hívásának?
pl: Jakiej ogólnej składni używasz do wywoływania funkcji?
pt: Qual é a sintaxe que geralmente usa para chamar uma função?
sv: Vilken syntax använder du i vanliga fall för att anropa en funktion?
tr: Bir fonksiyonu çağırmak için kullanılan genel söz dizimi nedir?
zh_hans: 通常来说，用来调用函数的语法是什么？

source: To call a function, you need to write its exact name followed by an opening and a closing parenthesis.
hu: Függvény hívásához meg kell adni a pontos nevét, majd egy nyitó és csukó zárójelet tenni a végére.

source: If the function requires one or more [i]arguments[/i], you add them inside the parentheses. Whether you need to do that or not depends on the function.
hu: Ha a függvénynek szüksége van egy vagy több [i]argumentumra[/i], akkor azokat a zárójelen belül kell megadni. Hogy erre szükség van-e, az mindig a függvénytől függ.

source: You write its name followed by an opening and a closing parenthesis.
hu: A nevével, nyitó és csukó zárójellel a végén.
pl: Podajesz jej nazwę, po której wstawiasz otwierający i zamykający nawias.
pt: Escreve o nome da função seguido por uma abertura e fechamento de parêntesis.
sv: Du skriver funktionens namn följt av en inledande och en avslutande parentes.
tr: Fonksiyon ismini yazıp ardından açık parantez ve sonra kapalı parantez eklersiniz.
zh_hans: 你写它的名字，后跟一个左括号和一个右括号。

source: You write its name followed by a colon.
hu: A nevével, majd egy kettősponttal.
pl: Podajesz jej nazwę, po której wstawiasz dwukropek.
pt: Escreve o seu nome seguido por um sinal de dois pontos.
sv: Du skriver funktionens namn följt av ett kolon.
tr: Fonksiyon ismini yazar ve sonra iki nokta üstüste koyarsınız.
zh_hans: 你写它的名字，后跟一个冒号。

source: You write a value, like a number, followed by an opening and a closing parenthesis.
hu: Írni kell egy értéket (pl. egy számot), majd egy nyitó és csukó zárójelet kell tenni a végére.
pl: Podajesz wartość, taką jak liczba, po której wstawiasz otwierający i zamykający nawias.
pt: Escreve um valor, como um número, seguido por uma abertura e fechamento de parêntesis.
sv: Du skriver ett värde, till exempel ett tal, följt av en inledande och en avslutande parentes.
tr: Önce bir değer, mesela bir sayı, yazar sonra açık parantez ve kapalı parantez eklersiniz.
zh_hans: 你写一个值，比如一个数字，后跟一个左括号和一个右括号。

source: Make The Character Visible
hu: Tedd láthatóvá a karaktert
pl: Spraw, aby postać stała się widoczna
pt: Fazer a personagem visível
sv: Gör karaktären synlig
tr: Karakteri Görünür Yap
zh_hans: 使角色可见

source: Our robot character's invisible! Call the [code]show()[/code] function to make it appear.
hu: A robotunk láthatatlan! Hívd a [code]show()[/code] függvényt, hogy előtünjön.

source: Please call [code]show()[/code] inside the [code]run()[/code] function, on line [code]2[/code], and keep the [code]Tab[/code] character at the start of the line. The computer needs that to understand your code.
hu: Kérlek, hívd a [code]show()[/code] függvényt a [code]run()[/code] függvényen belül, a [code]2.[/code] sorban, és hagyd meg a [code]Tab[/code] karktert a sor elején. A számítógépnek szüksége van rá, hogy megértse a kódod.

source: The robot's invisible! Call a function to bring it back.
hu: A robot láthatatlan! Hívj egy függvényt, hogy előtünjön.
pl: Robot jest niewidzialny! Wywołaj funkcję, która go przywróci.
pt: O robô está invisível! Chame uma função para trazer ele de volta.
sv: Roboten är osynlig! Anropa en funktion för att få tillbaka den.
tr: Robot görünmez oldu! Onu geri getirmek için bir fonksiyon çağırın.
zh_hans: 机器人不见了！ 调用函数将其恢复。

source: Make the Robot Upright
hu: Állítsd fel a egyenesen a robotot
pl: Ustaw robota w pozycji pionowej
pt: Fazendo o robô ficar reto
sv: Räta upp roboten
tr: Robotu Yukarı Döndür
zh_hans: 使机器人直立
