Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-1-what-code-*-like.po
Languages: es, fa, hu, ko, pl, pt_br, sk, sv, th, zh_hans, zh_hant

source: Learning to program can be daunting.
fa: آموختن برنامه‌نویسی می‌تواند دلهره‌آور باشد.
ko: 프로그래밍을 배우는 건 힘듭니다.
sk: Naučiť sa programovať nie je ľahké.
sv: Att lära sig programmera kan vara utmanande.

source: Yet, you want to make video games, so [b]there is no way around learning to program[/b]. [i]Every[/i] video game is a computer program.
fa: با این همه، می‌خواهید بازی رایانه‌ای بسازید، پس [b]راهی جز آموختن برنامه‌نویسی نیست[/b]. [i]همهٔ[/i] بازی‌های رایانه‌ای برنامهٔ رایانه‌ای نیز هستند.
ko: 하지만 게임을 만들고 싶다면, [b]프로그래밍을 배워야만 합니다[/b]. [i]모든[/i] 게임은 컴퓨터 프로그램이니까요.
sk: Lenže, keď chcete robiť videohry [b]programovaniu sa nevyhnete[/b]. [i]Každá[/i] videohra je počítačový program.
sv: Men vill du lära dig göra spel finns det [b]inga andra alternativ än att lära sig programmera[/b]. [i]Varje[/i] datorspel är ett datorprogram.

source: Telling the computer what to do
fa: گفتن کارهایی که رایانه باید بکند به آن
hu: Elmondani a számítógépnek, mit csináljon
ko: 컴퓨터에게 할 일을 지시하기
pl: Mówienie komputerowi co ma robić
pt_br: Dizendo ao computador o que fazer
sk: Ako povedať počítaču, čo má robiť
sv: Berätta för datorn vad den ska göra
th: กำลังบอกคอมพิวเตอร์ว่านายต้องทำอะไร
zh_hans: 告诉计算机要做什么
zh_hant: 告訴電腦要做什麼

source: Programming is the process of writing precise instructions that tell a computer how to perform a task.
fa: برنامه‌نویسی فرایند دقیق نوشتن دستورالعمل‌هایی است که به رایانه می‌گویند چگونه کاری را بینجامد.
ko: 프로그래밍이란 컴퓨터가 읽고 작업할 수 있도록 정확한 명령을 작성하는 과정입니다.
sk: Programovanie je proces napísania presných inštrukcií, ktoré počítaču povedia, ako má splniť určitú úlohu.
sv: Att programmera är att skriva exakta instruktioner som berättar för datorn hur den ska göra en uppgift.

source: A game's instructions are, for example: moving a character, drawing a life bar, or playing a sound.
fa: برای نمونه: جنباندن شخصیت، کشیدن نوار جان یا پخش صدا از دستورالعمل‌های بازی هستند.
ko: 게임에 필요한 명령을 예로 들자면, 캐릭터를 움직이고, 체력 바를 그리며, 소리를 재생하는 것을 들 수 있겠습니다.
sk: Inštrukcie v hre sú napríklad: pohyb postavy, vykreslenie lišty života, alebo prehranie zvuku.
sv: Instruktioner i ett spel kan till exempel vara: flytta en karaktär, rita en life bar på skärmen eller spela ett ljud.

source: To do any of that, you need to learn a [b]programming language[/b]: a specialized language to tell the computer what to do.
fa: برای انجام هرکدام از آنها، باید [b]زبان برنامه‌نویسی[/b] بیاموزید: زبانی ویژسته و مخصوص که به رایانه می‌گوید چه کاری بکند.
hu: Hogy ezek közül bármit megcsinálj, meg kell tanulnod egy [b]programozási nyelvet[/b]: egy speciális nyelvet, ami megmondja a számítógépnek, hogy mit csináljon.
ko: 이 모든 것을 해내기 위해서는 반드시 [b]프로그래밍 언어[/b], 즉 컴퓨터에게 할 일을 지시하기 위한 전용 언어를 배워야만 합니다.
pt_br: Para fazer qualquer uma dessas coisas, você precisa aprender uma [b]linguagem de programação[/b]: uma linguagem especializada em dizer ao computador o que fazer.
sk: Aby ste niečo z toho mohli urobiť, musíte sa naučiť [b]programovací jazyk[/b]: špeciálny jazyk, ktorý počítaču povie, čo má robiť.
sv: För att kunna göra något av det, behöver du lära dig ett [b]programmeringsspråk[/b]: ett specialiserat språk för att berätta för datorn vad den ska göra.
th: การทำอะไรที่ว่ามาเมื่อครู่ เธอต้องศึกษา [b]ภาษาโปรแกรม[/b]: แน่นอนว่า มันก็คือภาษาที่ออกแบบมาเฉพาะเจาะจงเพื่อให้เราสั่งคอมพิวเตอร์ให้ทำงานตามที่เราต้องการไง
zh_hans: 执行其中的任何操作，你都需要学习一门[b]编程语言[/b]：用来告诉计算机要做什么的专门语言。
zh_hant: 要做任何一項，你都必須學習一種[b]程式語言[/b]：一種專門告訴電腦要做什麼的語言。

source: Programming languages are different from natural ones like English or Spanish. The computer does not think. Unlike us, it can't [i]interpret[/i] what you tell it.
fa: زبان‌های برنامه‌نویسی با زبان‌های طبیعی همچون فارسی یا ایتالیایی تفاوت دارند. رایانه نمی‌اندیشد. به‌وارون ما نمی‌تواند چیزی که به آن می‌گویید را [i]تفسیر[/i] کند.
ko: 프로그래밍 언어는 영어나 스페인어와 같은 자연어와는 성질이 다릅니다. 컴퓨터는 그 자체로 생각하지 않습니다. 우리 인간과 달리, 컴퓨터는 당신이 하는 말을 [i]해석[/i]할 수 없습니다.
sk: Programovacie jazyky sa od bežných jazykov, ako je angličtina alebo slovenčina, líšia. Počítač nerozmýšla. Na rozdiel od nás nevie [i]interpretovať[/i] čo mu povieme.

source: You can't tell it something vague like "draw a circle."
fa: نمی‌توانید چیزی گُنگ مانند «یک دایره بکش» به آن بگویید.
ko: 애매모호하게 그저 "원을 그려라"라고 명령할 수 없다는 뜻입니다.
sk: Nestačí mu povedať niečo tak nejasné ako "nakresli kruh".
sv: Du kan inte säga åt den någonting vagt som "rita en cirkel".

source: Which circle? Where? Which color should it be? How big should it be?
fa: کدام دایره؟ کجا؟ چه‌رنگی؟ چه‌اندازه‌ای؟
ko: 어떤 원을? 어디에? 무슨 색으로? 얼마나 크게?
sk: Aký kruh? Kde? Akej farby? Aký by mal byť veľký?
sv: Vilken cirkel? Var? Vilken färg ska den ha? Hur stor ska den vara?

source: The computer needs exact instructions
fa: رایانه به دستورالعمل‌های دقیق نیاز دارد
hu: A számítógépnek pontos utasításokra van szüksége
ko: 컴퓨터에게는 정확하게 명령해야 한다
pl: Komputer potrzebuje dokładnych instrukcji
pt_br: O computador precisa de instruções exatas
sk: Počítač vyžaduje presné inštrukcie
sv: Datorn behöver exakta instruktioner
th: เนี่ย ถึงได้บอกว่า มันต้องการ ชุดคำสั่ง ที่มีความเฉพาะเจาะจงแบบเป๊ะ ๆ ยังไงล่ะ
zh_hans: 计算机需要确切的指令
zh_hant: 電腦需要絕對精準的指示

source: To draw a filled circle, the computer needs to know exact drawing coordinates, the radius, the thickness, and color you want.
fa: برای کشیدن دایره‌ای توپر، رایانه نیاز دارد مختصات دقیق کشیدن، شعاع، ضخامت و رنگی که می‌خواهید را بداند.
ko: 속이 찬 원 하나를 그리기 위해서, 컴퓨터는 당신이 원하는 좌표, 반경, 굵기, 색깔을 정확히 알아야만 합니다.
sk: Aby nakreslil vyplnený kruh, počítač musí vedieť jeho presné súradnice, polomer, hrúbku a požadovanú farbu.
sv: För att rita en fylld cirkel behöver datorn veta exakta koordinater för cirkeln, cirkelns radie, tjockleken och vilken färg cirkeln ska ha.

source: The code to do so [i]may[/i] look like this.
fa: کدی که چنین کند [i]شاید[/i] این شکلی باشد.
ko: 이를 위한 코드는 이렇게 작성되었을 [i]수도[/i] 있습니다.
sk: Kód, ktorý by to vykonal, [i]môže[/i] vypadať takto.
sv: Koden för att göra rita cirkeln [i]kan[/i] se ut så här.

source: [i]Click the button to run the code example and see the result.[/i]
fa: [i]برای اجرای کد نمونه و دیدن نتیجه روی دکمه کلیک کنید.[/i]
ko: [i]버튼을 클릭해서 예제 코드를 실행하고 결과를 관찰하세요.[/i]
sk: [i]Kliknutím na tlačidlo spustíte ukážku kódu a uvidíte výsledok.[/i]
sv: [i]Klicka på knappen för att köra kodexemplet och se resultatet.[/i]

source: In the following lessons, you'll learn how this code works.
fa: در آموزه‌های پیش‌رو، خواهید آموخت که این کد چگونه کار می‌کند.
ko: 이번 수업에선, 이 코드가 어떻게 작동하는지를 배울 것입니다.
sk: Ako tento kód funguje sa naučíte v nasledujúcich lekciách.
sv: I de följande lektionerna lär du dig hur kod fungerar.

source: For now, we want to give you a sense of what computer code looks like. In this example, everything matters: each parenthesis, capital letter, period, and comma.
fa: فعلاً می‌خواهیم نشان‌تان دهیم که کد رایانه چی شکلی‌ست. در این نمونه همه‌چی مهم است: هر کمانک، حرف بزرگ، نقطه و کاما.
ko: 일단, 컴퓨터 코드가 어떻게 생겼는지를 대략적으로 보여드리겠습니다. 이 예시에서는 괄호, 대문자, 쉼표, 마침표 등, 모든 것이 중요합니다.
sk: Nateraz vám chceme priblížiť, ako počítačový kód vypadá. V tejto ukážke záleží na všetkom: na každej zátvorke, veľkom písmene, bodke aj čiarke.
sv: Just nu vill vi ge dig en känsla för hur kod ser ut. I det här exemplet har allting betydelse: varje parentes, stor bokstav, punkt och komma.

source: The computer always does [b]exactly[/b] what you tell it to. No more, no less. It [i]blindly[/i] follows every instruction.
fa: رایانه همیشه [b]همانگونه[/b] که به آن می‌گویید عمل خواهد کرد. نه بیشتر، نه کمتر. [i]کورکورانه[/i] همهٔ دستورالعمل‌ها را دنبال می‌کند.
ko: 컴퓨터는 지시받은 명령만을 [b]정확히[/b] 수행합니다. 그 이상도 그 이하도 없이, 받은 명령을 [i]맹목적으로[/i] 따릅니다.
sk: Počítač vždy vykoná [b]presne[/b] to, čo mu poviete. Nič viac, nič menej. [i]Slepo[/i] vykoná každú inštrukciu.
sv: Datorn gör alltid [b]exakt[/b] vad du instruerar den att göra. Inte mer, inte mindre. Den följer [i]blint[/i] varje instruktion.

source: [b]When you program, you're the one in charge, and you're free to do [i]anything[/i] you want.[/b]
fa: [b]هنگامی که برنامه‌نویسی می‌کنید، شمایید که دارای اختیار هستید و آزادید [i]هر کاری[/i] که می‌خواهید بکنید.[/b]
ko: [b]프로그래밍에 있어서, 책임자는 자기 자신이고 원하는 건 [i]뭐든지[/i] 할 수 있습니다.[/b]
sk: [b]Keď programujete, vy ste šéfom, a môžete urobiť [i]čokoľvek[/i], čo chcete.[/b]
sv: [b]När du programmerar är det du som har ansvaret. Du kan göra vad som heslt du vill. [/b]

source: How do you give instructions to a computer?
es: ¿Cómo le das instrucciones a una computadora?
fa: چگونه باید به رایانه دستورالعمل داد؟
hu: Hogyan adsz utasításokat a számítógépnek?
ko: 컴퓨터에게 명령을 내리는 방법은?
pl: Jak wydajesz instrukcje komputerowi?
pt_br: Como você dá instruções para um computador?
sk: Ako sa dávajú inštrukcie počítaču?
sv: Hur ger du instruktioner åt en dator?
th: คุณจะให้มอบคำสั่งให้กับคอมพิวเตอร์ได้ยังไง?
zh_hans: 如何向计算机下达指令？
zh_hant: 如何給予電腦指示？

source: Computers don't understand natural languages like English. To make them do anything, you need to give them precise instructions they understand, using a programming language.
es: Las computadoras no entienden lenguajes naturales como el inglés. Para que hagan algo, hay que darles instrucciones precisas que entiendan, utilizando un lenguaje de programación.
fa: رایانه‌ها زبان‌های طبیعی مانند فارسی را نمی‌فهمند. برای اینکه وادار به هر کاری بکنیدشان، نیاز دارید با به‌کارگیری زبان برنامه‌نویسی دستورالعمل‌های دقیقی که می‌فهمند به آنها بدهید.
hu: A számítógépek nem értik a magyarhoz hasonló élő nyelveket. Ahhoz, hogy bármit is csináljanak, pontos utasításokat kell nekik adnod egy programnyelvet használva.
ko: 컴퓨터는 영어 같은 자연어를 이해하지 못합니다. 컴퓨터에게 일을 시키기 위해서는 프로그래밍 언어를 통해 이들이 이해할 수 있는 정확한 명령을 지시해야 합니다.
pl: Komputery nie rozumieją języków naturalnych, takich jak angielski. Aby komputer zrobił cokolwiek, musisz dać mu dokładne instrukcje w języku, który rozumie: języku programowania.
pt_br: Os computadores não entendem linguagens naturais como o inglês. Para fazê-los fazer qualquer coisa, você precisa dar a eles instruções precisas que eles entendam, usando uma linguagem de programação.
sk: Prirodzeným jazykom, ako je angličtina, počítače nerozumejú. Aby čokoľvek vykonali, musia im byť programovacím jazykom dané presné inštrukcie, ktorým rozumejú.
sv: Datorer för inte naturliga språk som svenska. För att få dem att göra något måste du ge dem exakta instruktioner de förstår genom att använda ett programmeringsspråk.
th: คอมพิวเตอร์นั่นไม่เข้าใจภาษาธรรมชาติอย่างเช่นภาษาอังกฤษ เพื่อให้พวกเขาทำสิ่งใดสิ่งหนึ่งได้นั้น คุณต้องให้คำสั่งที่แม่นยำพอที่พวกมันจะเข้าใจได้ โดยการใช้ภาษาโปรแกรม
zh_hans: 计算机不懂英语之类的自然语言。要让它们做事，你需要使用编程语言，下达它们能够理解的精确指令。
zh_hant: 電腦並不理解英文等自然語言。要讓電腦做任何事，你必須使用程式語言，給予它們能理解的精確指示。

source: Using a programming language and precise instructions
es: Utilizar un lenguaje de programación e instrucciones precisas
fa: به‌کارگیری زبان برنامه‌نویسی و دستورالعمل‌های دقیق
hu: Programnyelv használata és pontos utasítások
ko: 프로그래밍 언어와 정확한 명령어를 사용한다
pl: Korzystając z języka programowania i precyzyjnych instrukcji
pt_br: Usando uma linguagem de programação e instruções precisas
sk: Použitím programovacieho jazyka a presných inštrukcií
sv: Genom att använda programmeringsspråk och exakta instruktioner
th: การใช้ภาษาโปรแกรมและชุดคำสั่งที่แม่นยำ
zh_hans: 使用编程语言和精确的指令
zh_hant: 使用程式語言與精確指示

source: Using prose in plain English
fa: به‌کارگیری نثر انگلیسی
hu: Egyszerű, magyar szöveg használata
ko: 영어로 지시한다
pl: Używając prozy pisanej prostym angielskim
pt_br: Usando conversa em Inglês simples
sk: Použitím prostej angličtiny
sv: Genom att använda vanlig enkel svenska och skriva lättläst text
th: การใช้ข้อความในภาษาอังกฤษธรรมดา
zh_hans: 写简单的英语作文
zh_hant: 使用英文寫個散文

source: You'll learn to code with GDScript
es: Aprenderás a codificar con GDScript
fa: کدنویسی با جی.دی.اسکریپت را خواهید آموخت
hu: Metanulsz GDScriptben kódolni
ko: GDScript로 코딩을 배워보자
pl: Nauczysz się kodować za pomocą GDScript
pt_br: Você vai aprender a programar com GDScript
sk: Naučíte sa programovať v GDScripte
sv: Du lär dig koda med GDScript
th: คุณจะได้เรียนรู้การเขียนโค้ดด้วย GDScript
zh_hans: 你会学习使用 GDScript 编程
zh_hant: 你將用GDScript學習程式碼

source: In this course, you'll learn the GDScript programming language (the name stands for "Godot script").
fa: در این دوره، زبان برنامه‌نویسی جی.دی.اسکریپت (کوتاه‌شدهٔ «گودوت اسکریپت») را خواهید آموخت.
ko: 이 강좌에선 GDScript 프로그래밍 언어에 대해 배울 것입니다(이름은 "고도 스크립트"라는 뜻입니다.)
sk: V tomto kurze sa naučíte programovať v programovacom jazyku GDScript (čo znamená "Godot script").

source: This is a language by game developers for game developers. You can use it within the Godot game engine to create games and applications.
fa: زبانی‌ست از بازی‌سازان برای بازی‌سازان. می‌توانید آن را درون موتور بازی‌سازی گودوت به کار ببرید و بازی و برنامه بسازید.
ko: GDScript는 게임 개발자가 게임 개발자를 위해 제작한 언어로, 고도 게임 엔진을 통해 게임과 앱을 만드는 데 사용할 수 있습니다.
sk: Ide o jazyk od vývojárov hier pre vývojárov hier. Jeho použitím v hernom engine Godot vytvoríte hry a aplikácie.

source: It's the language used by games like [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] and [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].
fa: زبانی‌ست که بازی‌هایی همچون [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] (گنبدبان) و [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] (بُروتِیتو) از آن بهره می‌برند.
ko: [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] 와 [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url] 와 같은 게임들에서 사용되었습니다.
sk: Je to jazyk použitý v hrách ako [ignore][url=https://store.steampowered.com/app/1637320/Dome_Keeper/]Dome Keeper[/url] a [ignore][url=https://store.steampowered.com/app/1942280/Brotato/]Brotato[/url].

source: Engineers at Tesla also used it for their cars' dashboards.
fa: مهندسان شرکت تسلا نیز آن را برای داشبورد خودروهای‌شان به کار می‌گیرند.
ko: 또한, 테슬라의 엔지니어들도 차량의 계기판을 만드는 데에 이 언어를 사용했습니다.
sk: Aj inžinieri z Tesly ho použili na prístrojové dosky ich áut.

source: GDScript is an excellent language to get started with programming because it's specialized. Unlike some other languages, it doesn't have an [i]overwhelming[/i] amount of features for you to learn.
fa: جی‌دی‌اسکریپت به‌خاطر ویژسته و اختصاص‌یافته بودنش زبان بسیار خوبی برای آغاز کردن یادگیری برنامه‌نویسی‌ست. بر خلاف دیگر زبان‌ها، میزان [i]کلافه‌کننده‌ای[/i] ویژگی برای آموختن ندارد.
hu: A GDScript egy remek nyelv a kezdéshez, mert specializált. Más nyelvekkel ellentétben, nincs [i]telepakolva[/i] funkciókkal, így megkönnyítve a tanulást.
ko: GDScript는 특수한 언어이기 때문에 프로그래밍에 입문하기 좋은 언어입니다. 다른 언어와는 달리 GDScript는 배워야 할 기능들이 [i]압도적으로[/i] 많지는 않습니다.
pt_br: GDScript é uma linguagem excelente para iniciar com programação porque é uma linguagem especializada. Ao contrário de algumas outras linguagens, ela não possui uma quantidade [i]gigantesca[/i] de recursos para você aprender.
sk: GDScript je vynikjúci jazyk pre začínajúcich programátorov, pretože je špecializovaný. Na rozdiel od iných jazykov, nemá [i]ohromujúce[/i] množstvo vlastností, ktoré by bolo treba zvládnuť.
sv: GDScript är ett utmärkt första språk då man lär sig programmera eftersom det är specialiserat. Till skillnad från många andra språk har det inte [i]överväldigande[/i] många funktioner som du måste lära dig.
th: GDScript เป็นภาษาที่ยอดเยี่ยมในการเริ่มต้นเขียนโปรแกรมเพราะเป็นภาษาเฉพาะทาง ไม่เหมือนกับภาษาอื่นๆ มันไม่มี [i]คุณสมบัติ[/i] ที่เยอะแยะอย่างล้มหลามที่จะให้คุณลำบากในการเรียนรู้
zh_hans: 用 GDScript 来入门编程是很棒的，因为它专精于一个领域。与其他一些语言不同，你不需要学[i]成吨的[/i]功能和特性。
zh_hant: GDScript是非常適合程式初學者的特化語言。不像其他語言，它沒有[i]過量[/i]的功能要學習。

source: Most programming languages are similar
fa: بیشتر زبان‌های برنامه‌نویسی شبیه‌اند
hu: A legtöbb programnyelv hasonló
ko: 대부분의 프로그래밍 언어는 서로 비슷하다
pl: Większość języków programowania jest podobna
pt_br: A maioria das linguagens de programação são similares
sk: Väčšina programovacích jazykov si je podobná
sv: De flesta programmeringsspråk liknar varandra
th: ภาษาโปรแกรมส่วนใหญ่จะคล้ายกัน
zh_hans: 大多数编程语言都很相似
zh_hant: 大部分程式語言都很相似

source: Don't be afraid of being locked in. The concepts you learn in your first programming language will apply to all the others.
fa: نگران گیر افتادن نباشید. مفهوم‌هایی که در نخستین زبان برنامه‌نویسی‌تان می‌آموزید در دیگر زبان‌ها نیز به کار خواهند آمد.
ko: GDScript 에만 익숙하게 되버릴까 걱정하지 마세요. 첫 프로그래밍 언어에서 배우는 개념은 다른 언어에도 똑같이 적용됩니다.
sk: Nemusíte sa obávať zablokovania. Koncepty, ktoré si osvojíte v prvom programovacom jazyku, sa uplatnia aj vo všetkých ostatných.
sv: Var inte rädd för att låsa dig. De koncept som du lär dig i ditt första programmeringsspråk gäller också i alla andra programmeringsspråk.

source: Most languages have more similarities than differences. Once you learn one, it takes much less time to become productive with the next one.
fa: بیشتر زبان‌ها شباهت‌هایشان بیشتر از تفاوت و دگرسانی‌هایشان است. پس از آموختن یکی، برای کارآمد شدن در دیگر زبان‌ها زمان بسیار کمتری نیاز خواهد بود.
ko: 언어들 사이엔 보통 차이점보다는 공통점이 더 많습니다. 하나를 배워놓으면, 다음 언어에 숙달되는 데에 더 적은 시간이 들어갑니다.
sk: Väčšina jazykov má viac podobností ako odlišností. Keď sa naučíte jeden, o to rýchlejšie budete potom produktívni v ďalšom.
sv: De flesta språk har fler likheter än skillnader. När du lärt dig ett går det mycket snabbare att lära sig nästa.

source: Here's an example of the same code in three languages: GDScript, JavaScript, and Python.
fa: این نمونه‌ای از کدی یکسان در سه زبان است: جی‌دی‌اسکریپت، جاوا اسکریپت و پایتون.
ko: 여기에 GDScript, JavaScript, Python 세 가지 언어로 작성된 코드 예시가 있습니다.
sk: Tu je ukážka toho istého kódu v troch jazykoch: GDScripte, JavaScripte a Pythone.
sv: Här är ett exempel av samma kod i tre olika språk: GDScript, JavaScript och Python.

source: Try to spot the similarities and differences.
fa: بکوشید تا شباهت‌ها و دگرسانی‌های آن را بیابید.
ko: 직접 공통점과 차이점을 찾아보세요.
sk: Všimnite si podobností a odlišností.
sv: Försök upptäcka likheterna och skillnaderna.

source: It doesn't look [i]that[/i] different, does it?
es: No parece [i]tan[/i] diferente, ¿verdad?
fa: [i]آنچنان[/i] دگرسان نیست، هست؟
hu: Nem is néznek ki [i]annyira[/i] másnak, igaz?
ko: [i]썩[/i] 다르진 않죠?
pl: Nie wygląda to [i]aż tak[/i] różnie, prawda?
pt_br: Não parece [i]tão[/i] diferente, não é mesmo?
sk: Nelíšia sa až [i]tak[/i] moc, že?
sv: Det ser inte [i]så[/i] olika ut, eller hur?
th: มองไม่เห็นว่ามัน [i]นั้น[/i] แตกต่างกันใช่มั้ย?
zh_hans: 并没有[i]那么[/i]不一样，对吧？
zh_hant: 看起來沒差[i]那麼[/i]多，是吧？

source: Are programming languages all completely different?
es: ¿Son todos los lenguajes de programación completamente diferentes?
fa: آیا زبان‌های برنامه‌نویسی همه به‌کاملی دگرسان‌اند؟
hu: A programnyelvek teljesen különbözőek?
ko: 모든 프로그래밍 언어들은 서로 완전히 다른가?
pl: Czy języki programowania są różne od siebie?
pt_br: Todas as linguagens de programação são completamente diferentes?
sk: Sú všetky programovacie jazyky úplne iné?
sv: Är alla programmeringsspråk helt olika?
th: ภาษาโปรแกรมนั้นแตกต่างกันโดยสิ้นเชิงหรือไม่?
zh_hans: 编程语言都完全不同吗？
zh_hant: 程式語言都完全相異嗎？

source: If you learn one language and then want to learn another, will you have to start from scratch?
es: Si aprendes un lenguaje y luego quieres aprender otro, ¿tendrás que empezar de cero?
fa: اگر زبانی بیاموزید و سپس بخواهید یکی دیگر را بیاموزید، آیا نیاز دارید از صفر آغاز کنید؟
hu: Ha megtanulsz egy programnyelvet, majd meg akarsz tanulni egy másikat, muszáj a nulláról kezdened?
ko: 한 언어를 배운 후 다른 언어를 배우고 싶다면, 처음부터 다시 시작해야 하는가?
pl: Jeśli uczysz się jednego języka, a potem chcesz nauczyć się innego, czy będziesz musiał zaczynać od zera?
pt_br: Se você aprender uma linguagem e depois quiser aprender outra, você terá que começar do zero?
sk: Keď sa naučíte jeden jazyk a potom sa chcete naučiť ďalší, musíte začať od nuly?
sv: Om du har lärt dig ett språk och sedan vill lära dig ett annat, måste du starta om från noll då?
th: ถ้าคุณเรียนภาษาหนึ่งแล้วต้องการเรียนรู้อีกภาษาหนึ่ง คุณจะต้องเริ่มต้นจากศูนย์เลยหรือไม่?
zh_hans: 如果你学会了一门语言，然后想学另一门，你得从头学起吗？
zh_hant: 如果你學了程式語言後想學另一個，你會得重新開始嗎？

source: Most programming languages build upon the same ideas of how to program. As a result, they're mostly similar.
fa: بیشتر زبان‌های برنامه‌نویسی بر پایهٔ ایده‌های یکسانی دربارهٔ روش‌های برنامه‌نویسی ساخته شده‌اند. در نتیجه، بسیار شبیه‌اند.
ko: 많은 프로그래밍 언어들은 같은 프로그래밍 방법론을 바탕으로 만들어졌습니다. 그래서 이들은 서로 비슷합니다.
sk: Väčšina programovacích jazykov stavia na tých istých základoch programovania. Preto sú si väčšinou podobné.
sv: De flesta programmeringsspråk bygger på samma idéer om hur man programmerar. Därför är de relativt lika varandra.

source: It's not to say all languages are the same, though. Some offer a really unique syntax and require a completely different mindset compared to GDScript.
fa: ولی اینگونه نیست که همهٔ زبان ها یکسان باشند. برخی دارای نحوی یکتا بوده و نیازمند نگرش دگرسانی نسبت به جی‌دی‌اسکریپت هستند.
ko: 물론 모든 언어가 똑같다는 말은 아닙니다. 몇몇 언어들은 독특한 구문체계를 갖추고 있어 GDScript와 완전히 다른 접근법이 필요합니다.
sk: To však neznamená, že všetky jazyku sú rovnaké. Niektoré majú fakt unikátnu syntax a vyžadujú úplne iné myslenie ako GDScript.
sv: Det betyder inte att alla språk är precis likadana. Några har en alldeles unik syntax och kräver ett helt annat sätt att tänka jämfört med GDScript.

source: However, languages like GDScript, Python, JavaScript, C++, C#, and many others build upon a similar programming philosophy.
fa: با این همه، زبان‌هایی همچون جی‌دی‌اسکریپت، پایتون، جاوا اسکریپت، سی‌پلاس‌پلاس، سی‌شارپ و... بر پایهٔ فلسفهٔ برنامه‌نویسانهٔ یکسانی ساخته شده‌اند.
ko: 한편, GDScript, Python, JavaScript, C++, C#, 그 외 수많은 언어들은 모두 같은 프로그래밍 철학을 기반으로 만들어졌습니다.
sk: Avšak jazyky ako GDScript, Python, JavaScript, C++, C# a mnoho ďalších, stavajú na podobnej filozofii programovania.
sv: Men många vanliga programmeringsspråk som GDScript, Python, JavaScript, C++, C# och många andra bygger på liknande programmeringsfilosofier.

source: No, they have many similarities
es: No, tienen muchas similitudes
fa: نه، شباهت‌های بسیاری دارند
hu: Nem, sok mindenben hasonlítanak
ko: 아니오, 많은 공통점이 있다
pl: Nie, mają wiele podobieństw
pt_br: Não, elas possuem muitas similaridades
sk: Nie, majú veľa podobností
sv: Nej, de har många likheter
th: ไม่ มันมีความคล้ายคลึงกันมาก
zh_hans: 不用，它们有很多相似点
zh_hant: 不，他們有許多相似處

source: Yes, they are completely different
es: Sí, son completamente diferentes
fa: آره، به‌کاملی دگرسان هستند
hu: Igen, teljesen különbözőek
ko: 예, 서로 완전히 다르다
pl: Tak, są zupełnie inne
pt_br: Sim, elas são completamente diferentes
sk: Áno, sú úplne odlišné
sv: Ja, de är helt olika
th: ใช่ มันต่างกันโดยสิ้นเชิง
zh_hans: 是的，它们完全不同
zh_hant: 是，他們完全不一樣

source: This is a course for beginners
es: Este es un curso para principiantes
fa: این دوره‌ای برای نوآموزان است
hu: Ez egy kezdőknek szóló kurzus
ko: 초보자를 위한 강좌
pl: To kurs dla początkujących
pt_br: Esse é um curso para iniciantes
sk: Toto je kurz pre začiatočníkov
sv: Det här är en kurs för nybörjare
th: นี่เป็นคอร์สสำหรับผู้เริ่มต้น
zh_hans: 这是针对初学者的教程
zh_hant: 這是個初學者課程

source: If you want to learn to make games or code but don't know where to start, this course should be perfect.
fa: اگر می‌خواهید بازی‌سازی یا کدنویسی بیاموزید ولی نمی‌دانید از کجا بیاغازید، این دوره بی‌کم‌وکاست خواهد بود.
hu: Ha meg akarsz tanulni programozni vagy játékot fejleszteni, de enm tudod, hogy kezdj neki, akkor ez a kurzus pont neked szól.
ko: 게임을 만들거나 코드를 짜고 싶지만 어디서부터 시작해야 할 지 모르겠다면, 이 강좌가 완벽한 해답이 될 것입니다.
pt_br: Se você quer aprender a fazer jogos ou a programar mas não sabe por onde começar, esse curso será perfeito para você.
sk: Ak sa chcete naučiť vyrábať hry alebo programovať, ale neviete kde začať, tento kurz by vám mal vyhohovať.
sv: Om du vill lära dig göra spel eller koda men inte vet var du ska börja, borde den här kursen vara perfekt för dig.
th: หากคุณต้องการเรียนรู้การทำเกมหรือโค้ดแต่ไม่รู้ว่าจะเริ่มต้นอย่างไร หลักสูตรนี้น่าจะตอบโจทย์คุณที่สุดแล้ว
zh_hans: 如果你想要学习制作游戏或者编程，而又不知道从哪里入手，那么这个教程是绝佳的选择。
zh_hant: 如果你想學習遊戲製作或程式碼但不知從何開始，這個課程應該相當適合。
