Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-18-for-loops.po
Languages: cs, fr

source: Let's explain what's going on here.
cs: Pojďme si vysvětlit, co se tu děje.
fr: On va expliquer ce qui se passe ici.

source: The range() function
cs: Funkce range()
fr: La fonction range()

source: Godot has the helper function [code]range()[/code]. Calling [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code].
cs: Godot má pomocnou funkci [code]range()[/code]. Voláním [code]range(n)[/code] se vytvoří seznam čísel od [code]0[/code] do [code]n - 1[/code].

source: So calling [code]range(3)[/code] outputs the list of numbers [code][0, 1, 2][/code], and [code]range(5)[/code] outputs [code][0, 1, 2, 3, 4][/code].
cs: Takže voláním [code]range(3)[/code] vznikne seznam čísel [code][0, 1, 2][/code], a voláním [code]range(5)[/code] vznikne [code][0, 1, 2, 3, 4][/code].

source: What list of numbers would range(6) create?
cs: Jaký seznam čísel by vytvořila funkce range(6)?
fr: Quelle liste de nombres créerait range(6) ?

source: What would [code]print(range(6))[/code] print to the console?
cs: Co by [code]print(range(6))[/code] vypsal do konzoly?
fr: Qu'est-ce que [code]print(range(6))[/code] imprimerait sur la console ?

source: The function [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. The output list will start with [code]0[/code] and end with [code]5[/code].
cs: Funkce [code]range(n)[/code] vytvoří seznam čísel od [code]0[/code] do [code]n - 1[/code]. Výstupní seznam bude začínat [code]0[/code] a končit [code]5[/code].

source: So calling [code]range(6)[/code] will output a list of six numbers which are [code][0, 1, 2, 3, 4, 5][/code].
cs: Voláním [code]range(6)[/code] se tedy vypíše seznam šesti čísel, která jsou [code][0, 1, 2, 3, 4, 5][/code].

source: How for loops work
cs: Jak funguje smyčka for
fr: Comment fonctionnent les boucles for

source: In a [code]for[/code] loop, the computer takes each value inside a list, stores it in a temporary variable, and executes the code in the loop once per value.
cs: Ve smyčce [code]for[/code] počítač vezme každou hodnotu uvnitř seznamu, uloží ji do pomocné proměnné a pro každou jednu hodnotu provede kód ve smyčce.
fr: Dans une boucle [code]for[/code], l'ordinateur prend chaque valeur dans une liste, la stocke dans une variable temporaire et exécute le code de la boucle une fois par valeur.

source: In the above example, for each item in the list [code][0, 1, 2][/code], Godot sets [code]number[/code] to the item, then executes the code in the [code]for[/code] loop.
cs: Ve výše uvedeném příkladu Godot pro každou položku v seznamu [code][0, 1, 2][/code], nastaví proměnnou [code]number[/code] na danou položku a poté provede kód ve [code]for[/code] bloku.

source: We'll explain arrays more thoroughly in the next lesson, but notice that [code]number[/code] is just a temporary variable. You create it when defining the loop, and the loop takes care of changing its value. Also, you can name this variable anything you want.
cs: Co je to Pole si podrobněji vysvětlíme v příští lekci, ale všimněte si, že [code]číslo[/code] je pouze dočasná proměnná. Vytvoříte ji při definování cyklu a cyklus se postará o změnu její hodnoty. Také tuto proměnnou můžete pojmenovat, jak chcete.

source: This code behaves the same as the previous example:
cs: Následující kód se chová stejně jako předchozí příklad:

source: In both examples, we print the value of the temporary variable we created: [code]number[/code] in the first example and [code]element[/code] in the second.
cs: V obou příkladech vypíšeme hodnotu vytvořené dočasné proměnné: [code]number[/code] v prvním příkladu a [code]element[/code] ve druhém.

source: As Godot moves through the loop, it assigns each value of the array to that variable. First, it sets the variable to [code]0[/code], then to [code]1[/code], and finally, to [code]2[/code].
cs: Když Godot prochází smyčkou, přiřazuje každou hodnotu pole dané proměnné. Nejprve nastaví proměnné hodnotu [code]0[/code], poté hodnotu [code]1[/code] a nakonec hodnotu [code]2[/code].

source: We can break down the instructions the loop runs. You can see how a loop is a shortcut to code that otherwise gets very long.
cs: Můžeme rozdělit instrukce, které smyčka provádí. Vidíte, jak smyčka zkracuje kód, který by jinak byl velmi dlouhý.

source: We can put whatever code we like in the loop's code block, including other function calls like [code]draw_rectangle()[/code].
cs: Do bloku kódu se smyčkou můžeme vložit libovolný kód, včetně volání dalších funkcí, například [code]draw_rectangle()[/code].
fr: Nous pouvons placer le code que nous voulons dans le bloc de code de la boucle, y compris d'autres appels de fonction comme [code]draw_rectangle()[/code].

source: Using a for loop instead of a while loop
cs: Použití cyklu for místo cyklu while
fr: Utiliser une boucle for au lieu d'une boucle while

source: Here's our old [code]move_to_end()[/code] function which used a [code]while[/code] loop.
cs: Zde je naše stará funkce [code]move_to_end()[/code], která předtím používala cyklus [code]while[/code].
fr: Voici notre ancienne fonction [code]move_to_end()[/code] qui utilisait une boucle [code]while[/code].

source: If we use a [code]for[/code] loop instead, the code becomes a little simpler.
cs: Pokud místo toho použijeme smyčku [code]for[/code], kód se trochu zjednoduší.
fr: Si nous utilisons une boucle [code]for[/code] à la place, le code devient un peu plus simple.

source: In the practices, we'll use [code]for[/code] loops in different ways to get you used to using them.
cs: V cvičeních budeme používat [code]for[/code] cykly různými způsoby, abyste si na jejich používání zvykli.
fr: Dans les exercices pratiques, nous utiliserons les boucles [code]for[/code] de différentes manières pour vous habituer à les utiliser.

source: Using a for loop to move to the end of the board
cs: Použití smyčky for k přesunu na konec desky
fr: Utiliser une boucle for pour se déplacer à la fin du plateau

source: Once again, the robot has decided to stand at the top of the board.
cs: Robot se opět rozhodl postavit na vrchol šachovnice.

source: This time, use a [code]for[/code] loop in the [code]move_to_bottom()[/code] function to have it move to the bottom of the board.
cs: Tentokrát použijte smyčku [code]for[/code] ve funkci [code]move_to_bottom()[/code], aby se přesunul na spodní část desky.

source: The robot's starting cell is [code]Vector2(2, 0)[/code].
cs: Počáteční buňka robota je [code]Vector2(2, 0)[/code].

source: Use a for loop to have our robot move from the top of the board to the bottom.
cs: Použijte smyčku for, aby se náš robot pohyboval z horní části desky do dolní.
fr: Utilisez une boucle for pour que notre robot se déplace de la partie supérieure du plateau vers la partie inférieure.

source: Improving code with a for loop
cs: Vylepšení kódu pomocí smyčky for
fr: Améliorer le code avec une boucle for

source: Use a [code]for[/code] loop to remove the duplicate code in the [code]run()[/code] function.
cs: Pomocí smyčky [code]for[/code] odstraňte duplicitní kód ve funkci [code]run()[/code].

source: In this practice, we revisit the turtle and drawing rectangles.
cs: V tomto cvičení se vrátíme k želvě a kreslení obdélníků.

source: With our new knowledge of [code]for[/code] loops, we can condense this code to take up less space and make it easier to modify.
cs: Díky novým znalostem o cyklech [code]for[/code] můžeme tento kód zestručnit, aby zabíral méně místa a dal se snadněji upravovat.

source: The turtle should draw three squares in a horizontal line. The squares should be 100 pixels apart.
cs: Želva by měla nakreslit tři čtverce ve vodorovné linii. Čtverce by měly být od sebe vzdáleny 100 pixelů.

source: In the past we had to copy and paste code to draw multiple rectangles. Let's revisit previous code and improve it with a for loop.
cs: Dříve jsme museli kopírovat a vkládat kód, abychom nakreslili více obdélníků. Vraťme se k předchozímu kódu a vylepšeme ho pomocí smyčky for.
fr: Dans le passé, nous devions copier et coller du code pour dessiner plusieurs rectangles. Reprenons le code précédent et améliorons-le avec une boucle for.

source: Introduction to For Loops
cs: Úvod do smyček For
fr: Introduction aux boucles for

source: In the last lesson, we looked at [code]while[/code] loops. We found they were useful if we don't know how many times we should repeat code. However, they could result in infinite loops if we're not careful. The loop below never ends because we never increment [code]number[/code].
fr: Dans la dernière leçon, nous avons examiné les boucles [code]while[/code]. Nous avons découvert qu'elles étaient utiles si nous ne savons pas combien de fois nous devons répéter le code. Cependant, elles peuvent entraîner des boucles infinies si nous ne faisons pas attention. La boucle ci-dessous ne se termine jamais car nous n'incrémentons jamais [code]number[/code].

source: There's a safer and often easier kind of loop: the [code]for[/code] loop. We'll look at it in this lesson. Unlike [code]while[/code] loops, [code]for[/code] loops don't run infinitely, so it's much less likely that you'll get bugs in your game. [b]We recommend favoring for loops over while loops because of this[/b]. Let's change the code above to use a [code]for[/code] loop instead. The loop below will change the [code]cell[/code] three times.
fr: Il existe un type de boucle qui est plus sûr et souvent plus facile à utiliser : la boucle [code]for[/code]. Nous allons l'examiner dans cette leçon. Contrairement aux boucles [code]while[/code], les boucles [code]for[/code] ne s'exécutent pas à l'infini, il est donc beaucoup moins probable que vous rencontriez des bugs dans votre jeu. [b]Pour cette raison, nous recommandons de privilégier les boucles for aux boucles while[/b]. Modifions le code ci-dessus pour utiliser une boucle [code]for[/code] à la place. La boucle ci-dessous changera la [code]cell[/code] trois fois.

source: Godot has the helper function [code]range()[/code]. Calling [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. So calling [code]range(3)[/code] outputs the list of numbers [code][0, 1, 2][/code], and [code]range(5)[/code] outputs [code][0, 1, 2, 3, 4][/code].
fr: Godot possède la fonction auxiliaire [code]range()[/code]. L'appel de [code]range(n)[/code] crée une liste de nombres de [code]0[/code] à [code]n - 1[/code]. Ainsi, l'appel de [code]range(3)[/code] produit la liste de nombres [code][0, 1, 2][/code], et [code]range(5)[/code] produit [code][0, 1, 2, 3, 4][/code].

source: The function [code]range(n)[/code] creates a list of numbers from [code]0[/code] to [code]n - 1[/code]. The output list will start with [code]0[/code] and end with [code]5[/code]. So calling [code]range(6)[/code] will output a list of six numbers which are [code][0, 1, 2, 3, 4, 5][/code].
fr: La fonction [code]range(n)[/code] crée une liste de nombres de [code]0[/code] à [code]n - 1[/code]. La liste de sortie commencera par [code]0[/code] et se terminera par [code]5[/code]. Donc appeler [code]range(6)[/code] produira une liste de six nombres qui sont [code][0, 1, 2, 3, 4, 5][/code].

source: In the above example, for each item in the list [code][0, 1, 2][/code], Godot sets [code]number[/code] to the item, then executes the code in the [code]for[/code] loop. We'll explain arrays more thoroughly in the next lesson, but notice that [code]number[/code] is just a temporary variable. You create it when defining the loop, and the loop takes care of changing its value. Also, you can name this variable anything you want. This code behaves the same as the previous example:
fr: Dans l'exemple ci-dessus, pour chaque élément de la liste [code][0, 1, 2][/code], Godot attribue le [code]nombre[/code] à l'élément, puis exécute le code dans la boucle [code]for[/code]. Nous expliquerons plus en détail les tableaux dans la prochaine leçon, mais notez que [code]number[/code] n'est qu'une variable temporaire. Vous la créez lors de la définition de la boucle, et la boucle se charge de modifier sa valeur. De plus, vous pouvez donner à cette variable le nom que vous voulez. Ce code se comporte de la même manière que l'exemple précédent :

source: In both examples, we print the value of the temporary variable we created: [code]number[/code] in the first example and [code]element[/code] in the second. As Godot moves through the loop, it assigns each value of the array to that variable. First, it sets the variable to [code]0[/code], then to [code]1[/code], and finally, to [code]2[/code]. We can break down the instructions the loop runs. You can see how a loop is a shortcut to code that otherwise gets very long.
fr: Dans les deux exemples, nous affichons la valeur de la variable temporaire que nous avons créée : [code]number[/code] dans le premier exemple et [code]element[/code] dans le second. Au fur et à mesure que Godot se déplace dans la boucle, il affecte chaque valeur du tableau à cette variable. Tout d'abord, il attribue à la variable la valeur [code]0[/code], puis [code]1[/code], et enfin [code]2[/code]. Nous pouvons décomposer les instructions que la boucle exécute. Vous pouvez constater qu'une boucle est un raccourci pour un code qui, autrement, deviendrait très long.

source: Rather than constantly checking if the robot reached the end of the board, with the [code]for[/code] loop, we take the board's width beforehand, then move the robot a set amount of times. The function still works the same. You can execute it below.
fr: Plutôt que de vérifier constamment si le robot a atteint la fin du plateau, avec la boucle [code]for[/code], nous prenons la largeur du plateau au préalable, puis nous déplaçons le robot un nombre déterminé de fois. La fonction fonctionne toujours de la même manière. Vous pouvez l'exécuter ci-dessous.

source: Once again, the robot has decided to stand at the top of the board. This time, use a [code]for[/code] loop in the [code]move_to_bottom()[/code] function to have it move to the bottom of the board. The board size is determined by the [code]Vector2[/code] variable [code]board_size[/code]. The robot's starting cell is [code]Vector2(2, 0)[/code].
fr: Une fois de plus, le robot a décidé de se tenir sur la partie supérieure du plateau. Cette fois-ci, utilisez une boucle [code]for[/code] dans la fonction [code]move_to_bottom()[/code] pour qu'il se déplace vers la partie inférieure du tableau. La taille du plateau est déterminée par la variable [code]board_size[/code] du [code]Vector2[/code]. La case de départ du robot est [code]Vector2(2, 0)[/code].

source: Use a [code]for[/code] loop to remove the duplicate code in the [code]run()[/code] function. In this practice, we revisit the turtle and drawing rectangles. With our new knowledge of [code]for[/code] loops, we can condense this code to take up less space and make it easier to modify. The turtle should draw three squares in a horizontal line. The squares should be 100 pixels apart.
fr: Utilisez une boucle [code]for[/code] pour supprimer le code en double dans la fonction [code]run()[/code]. Dans cet exercice, nous reprenons la tortue et le dessin des rectangles. Avec nos nouvelles connaissances sur les boucles [code]for[/code], nous pouvons condenser ce code pour qu'il prenne moins de place et pour le rendre plus facile à modifier. La tortue doit dessiner trois carrés sur une ligne horizontale. Les carrés doivent être espacés de 100 pixels.
