Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-11-time-delta.po
Languages: hu, nl, pl, pt, zh_hans

source: We've seen how we can use our character's [code]_process()[/code] function to make it move continuously.
hu: Már láttuk, hogyan használhatjuk a karakter [code]_process()[/code] függvényét, hogy folyamatosan mozogjon a karakter.
nl: We hebben gezien hoe we de [code]_process()[/code] functie van ons personage kunnen gebruiken om het continu te laten bewegen.
pl: Nauczyliśmy się już w jaki sposób możemy używać funkcji [code]_process()[/code] do poruszania naszej postaci w sposób ciągły.
pt: Vimos como podemos usar a função [code]_process()[/code] da nossa personagem para fazê-la mover-se continuamente.
zh_hans: 我们已经看过了如何使用角色的 [code]_process()[/code] 函数使其持续移动。

source: But it's not just our character that has a [code]_process()[/code] function; Almost everything in the game has a [code]_process()[/code] function! Dozens of times per second, Godot runs every [code]_process()[/code] function in the game to update the game world. After that, it displays an image of the game world on the screen. We call that image a [b]frame[/b]. Godot then moves on to calculating the next frame. As this happens dozens of times per second, you get the illusion of movement. This is similar to how traditional animation works.
hu: De nem csak a karakterednek van [code]_process()[/code] függvénye; a játékban szinte mindennek van [code]_process()[/code] függvénye! Másodpercenként többször is végrehajtja a Godot az összes [code]_process()[/code] függvényt, hogy a frissítse a játék világát. Ezután a világnak a képét megjeleníti a képernyőn. Ezt a képet [b]frame[/b]-nek hívjuk. Ezután a Godot továbblép a következő frame kiszámolására. Mivel ez másodpercenként rengetegszer történik, így a mozgás illúzióját kelti. Ez hasonló ahhoz, ahogy a hagyományos animáció működik.
nl: Maar niet alleen ons personage heeft een [code]_process()[/code] functie; bijna alles in het spel heeft een [code]_process()[/code] functie! Tientallen keren per seconde voert Godot elke [code]_process()[/code] functie in het spel uit om de spelwereld bij te werken. Daarna wordt een afbeelding van de spelwereld op het scherm weergegeven. We noemen die afbeelding een [b]frame[/b]. Godot gaat vervolgens verder met het berekenen van het volgende frame. Omdat dit tientallen keren per seconde gebeurt, krijg je de illusie van beweging. Dit is vergelijkbaar met hoe traditionele animatie werkt.
pl: Jednak nie tylko nasza postać ma funkcję [code]_process()[/code]; prawie wszystko w grze ją ma! Dziesiątki razy na sekundę Godot uruchamia każdą funkcję [code]_process()[/code] istniejącą w grze, aby aktualizować świat gry. Następnie wyświetla na ekranie obraz świata gry. Obraz ten nazywamy [b]ramką[/b]. Godot następnie przechodzi do obliczania następnej klatki. Ponieważ dzieje się to dziesiątki razy na sekundę, uzyskujemy iluzję ruchu. Jest to podobne do działania tradycyjnej animacji poklatkowej.
pt: Mas não é apenas a nossa personagem com uma função [code]_process()[/code]; quase tudo no jogo tem uma função [code]_process()[/code]! Dezenas de vezes por segundo, a Godot executa cada função [code]_process()[/code] no jogo para atualizar o mundo do jogo. Depois disso, exibe uma imagem do mundo do jogo no ecrã. Chamamos essa imagem um [b]frame[/b]. A Godot então passa a calcular o próximo quadro. Como isso acontece dezenas de vezes por segundo, tem a ilusão de movimento. Isso é semelhante a como a animação tradicional funciona.
zh_hans: 但不仅仅是我们的角色有 [code]_process()[/code] 函数；游戏中几乎所有的东西都有一个 [code]_process()[/code] 函数！ 以每秒几十次的频率，Godot 通过运行游戏中的每个 [code]_process()[/code] 函数来更新游戏世界。 结束一次运行后，它会在屏幕上显示一张游戏世界的图像。我们称该张图像为一 [b] 帧 [/b]。 紧接着 Godot 会计算下一帧。 因为这是以每秒几十次的频率发生的，你会产生一切都在动的错觉。这类似于传统手绘动画的工作方式。

source: This sounds like Frames Per Second...
nl: Dit klinkt als Frames Per Seconde...
zh_hans: 听着让人想起了帧率(FPS)...

source: You may have heard of frames per second, or FPS for short. Games often run at 60 frames per second. It means that everything in the game updates 60 times each second. The number varies while playing, depending on the game and the device it runs on. On powerful computers, you may get frame rates in the hundreds or thousands of frames per second.
hu: Talán már hallottad a frame per second, vagy röviden FPS kifejezést. A játékok általában 60 FPS-sel futnak. Ez azt jelenti, hogy a játékban minden hatvanszor frissül másodpercenként. Ez a szám változhat játék közben, annak összetettségétől vagy a géptől függően, amin fut. Erősebb gépeken akár több száz vagy ezer FPS is lehet.
nl: Je hebt misschien wel eens gehoord van frames per seconde, of kortweg FPS. Games draaien vaak op 60 frames per seconde. Dit betekent dat alles in het spel 60 keer per seconde wordt bijgewerkt. Het aantal varieert tijdens het spelen, afhankelijk van het spel en het apparaat waarop het draait. Op krachtige computers kun je framesnelheden van honderden of duizenden frames per seconde krijgen.
pl: Być może słyszałeś o klatkach na sekundę lub w skrócie o FPSach. Gry często działają z szybkością 60 klatek na sekundę. Oznacza to tyle, że wszystko w grze aktualizuje się 60 razy na sekundę. Liczba ta zmienia się podczas gry, w zależności od gry i urządzenia, na którym ona działa. Na komputerach o naprawdę dobrych specyfikacjach możesz uzyskać liczbę klatek na sekundę w setkach lub tysiącach klatek na sekundę.
pt: Já deve ter ouvido falar de frames por segundo, ou FPS para abreviar. Os jogos geralmente são executados a 60 frames por segundo. Isso significa que tudo no jogo é atualizado 60 vezes a cada segundo. O número varia durante o jogo, dependendo do jogo e do aparelho em que é executado. Em computadores poderosos, pode obter taxas de frames de centenas ou até milhares de frames por segundo.
zh_hans: 你可能听说过帧率（frames per second，每一秒的帧数），简称 FPS。游戏通常以每秒 60 帧的速度运行。 这意味着游戏中的所有内容每秒更新 60 次。 该数字在玩游戏时会有所不同，取决于不同的游戏及其运行设备。 在性能强劲的计算机上，帧率可能来到每秒数百或数千帧。

source: Let's look at the [code]_process()[/code] function in more detail.
hu: Vizsgáljuk meg részletesebben a [code]_process()[/code] függvényt.
nl: Laten we de [code]_process()[/code] functie in meer detail bekijken.
pl: Przyjrzyjmy się bardziej szczegółowo funkcji [code]_process()[/code].
pt: Vamos ver a função [code]_process()[/code] com mais detalhes.
zh_hans: 让我们来更仔细地看一下 [code]_process()[/code] 函数。

source: What parameter does the _process() function take?
hu: Milyen paramétert fogad a _process() függvény?
nl: Welke parameter heeft de _process() functie?
pl: Jaki parametr przyjmuje funkcja _process()?
pt: Qual parâmetro a função _process() usa?
zh_hans: _process() 函数的参数是什么？

source: The [code]_process()[/code] function has one parameter named [code]delta[/code].
hu: A [code]_process()[/code] függvénynek egyetlen, [code]delta[/code] nevű paramétere van.
nl: De functie [code]_process()[/code] heeft één parameter met de naam [code]delta[/code].
pl: Funkcja [code]_process()[/code] przyjmuje jeden parametr o nazwie [code]delta[/code].
pt: A função [code]_process()[/code] tem um parâmetro chamado [code]delta[/code].
zh_hans: [code]_process()[/code] 函数有一个参数，叫 [code]delta[/code] 。

source: Frames take varying amounts of time to calculate
hu: A frame-ek különböző ideig számolódnak
nl: Frames hebben verschillende hoeveelheden tijd nodig om te rekenen
pl: Obliczanie ramek zajmuje różną ilość czasu
pt: Os frames levam uma quantidades variadas de tempo para serem calculados
zh_hans: 不同的帧需要的计算时间长短不同

source: Depending on the game, the computer, and what the game engine needs to calculate, frames take more or less time to display. There will always be milliseconds variations from frame to frame. That is why the [code]_process()[/code] function receives a [code]delta[/code] parameter. Delta represents a time difference. It's the time passed since the previous frame, in seconds. We can use it to ensure that the changes between frames don't make the game's behavior unreliable. This is because different computers run differently, so a fast computer will have more frames per second than a slow computer. If we ignore [code]delta[/code], the game experience will vary, depending on the computer. Delta helps to make the game experience consistent for everyone.
nl: Afhankelijk van het spel, de computer en wat de game engine moet berekenen, hebben frames meer of minder tijd nodig om weergegeven te worden. Er zijn altijd variaties in milliseconden van frame tot frame. Daarom krijgt de [code]_process()[/code] functie een [code]delta[/code] parameter. Delta vertegenwoordigt een tijdsverschil. Het is de tijd die verstreken is sinds het vorige frame, in seconden. We kunnen het gebruiken om ervoor te zorgen dat de veranderingen tussen frames het gedrag van het spel niet onbetrouwbaar maken. Dit is nodig omdat verschillende computers anders werken, dus een snelle computer zal meer frames per seconde weergeven dan een langzame computer. Als we [code]delta[/code] negeren, zal de spelervaring variëren, afhankelijk van de computer. Delta helpt om de spelervaring voor iedereen hetzelfde te maken.
zh_hans: 由于游戏、计算机不同，以及不同时刻游戏引擎需要计算的内容不同，不同的帧需要相对而言或多或少的时间才能显示出来。 不同的帧之间的间隔总是会有毫秒级的差别。 这就是 [code]_process()[/code] 函数接收 [code]delta[/code] 参数的原因。 单词“delta”代表时间差。这是自上一帧以来经过的时间，以秒为单位。 用它可以确保帧之间的变化不会使游戏的模拟变得不可靠。 这是因为不同的计算机运行起来千差万别，所以速度快的电脑比慢点的每秒会多出来很多的帧。 如果我们忽视帧间隔带来的[code]delta[/code]（时间差），那游戏玩起来就因为电脑快慢而有所不同了。delta能帮我们确保游戏的体验在任何地方都是一致的。

source: What do we know about delta?
hu: Mit tudunk a deltáról?
nl: Wat weten we over delta?
pl: Co wiemy o parametrze delta?
pt: O que sabemos sobre o delta?
zh_hans: 下列关于delta的事哪些是正确的？

source: [code]delta[/code] is the time it took Godot to complete the previous frame in seconds. It's very small because frames happen many times a second. It varies each frame because Godot needs to process more or less each frame.
nl: [code]delta[/code] is de tijd die Godot nodig had om het vorige frame te voltooien in seconden. Het is erg klein omdat frames vele keren per seconde verschijnen. Het varieert per frame omdat Godot elk frame meer of minder moet verwerken.
zh_hans: [code]delta[/code] 是 Godot 完成前一帧所需的时间，以秒为单位。 它的值非常小，因为每秒会出现很多帧。 它随着每一帧不同而改变，因为 Godot 需要或多或少的时间来处理每一帧。

source: It's a value in seconds.
hu: Ez egy másodpercben megadott érték.
nl: Het is een aantal seconden.
pl: To wartość wyrażana w sekundach.
pt: É um valor em segundos.
zh_hans: 这是一个以秒为单位的值。

source: It varies each frame.
hu: Minden frame-en változik.
nl: Het verschilt per frame.
pl: Różni się przy każdej klatce.
pt: Varia a cada frame.
zh_hans: 它的值每帧都不同。

source: It's the time it took Godot to complete the previous frame.
nl: Het is de tijd die Godot nodig had om het vorige frame te voltooien.
zh_hans: 这是 Godot 完成前一帧耗费的时间。

source: Multiplying by delta
hu: Szorzás delta-val
nl: Vermenigvuldigen met delta
pl: Mnożenie przez deltę
pt: Multiplicando por delta
zh_hans: 乘个delta

source: The [code]delta[/code] you get in [code]_process()[/code] is a time difference in seconds. It will generally be a tiny decimal number. To apply [code]delta[/code], you need to [i]multiply[/i] your speed values by it.
hu: A [code]delta[/code], amit [code]_process()[/code]-ben kapsz, egy másodpercben megadott időkülönbség. Általában egy apró törtszám. A [code]delta[/code] alkalmazásához be kell [i]szoroznod[/i] vele a sebesség értékeidet.
nl: De [code]delta[/code] die je krijgt in [code]_process()[/code] is een tijdsverschil in seconden. Het zal over het algemeen een klein kommagetal zijn. Om [code]delta[/code] toe te passen, moet je je snelheidswaarden ermee [i]vermenigvuldigen[/i].
pl: Wartość [code]delta[/code], którą otrzymujesz w funkcji [code]_process()[/code] to różnica czasu wyrażona w sekundach. Zwykle będzie to niewielka liczba dziesiętna. Aby zastosować zmienną [code]delta[/code], [i]mnożysz[/i] ją przez inne wartości.
pt: O [code]delta[/code] que obtém em [code]_process()[/code] é uma diferença de tempo em segundos. Geralmente vai ser um número decimal pequeno. Para aplicar o [code]delta[/code], precisa [i]multiplicar[/i] os seus valores de velocidade por ele.
zh_hans: 你在 [code]_process()[/code] 中获得的 [code]delta[/code] 变量是一个以秒为单位的时间差。它通常是一个很小的小数。 要应用 [code]delta[/code]，你需要用它 [i]乘以[/i] 你的速度值。

source: When multiplying by [code]delta[/code], you make motion [i]time-dependent[/i] rather than [i]frame-dependent[/i]. That's essential to make your game consistent and fair.
hu: Amikor [code]delta[/code]-val szorzol, akkor a mozgás az [i]időtől[/i] függ, nem pedig a [i]frame[/i]-től. Ez elengedhetelen, hogy a játékod következetes és igazságos legyen.
nl: Wanneer je vermenigvuldigt met [code]delta[/code], maak je beweging [i]tijdsafhankelijk[/i] in plaats van [i]frame-afhankelijk[/i]. Dat is essentieel om je spel consistent en eerlijk te maken.
pl: Podczas mnożenia ruchu przez wartość [code]delta[/code] jest on [i]zależny od czasu[/i] a nie [i]zależny od klatek[/i]. Używanie delty jest niezbędne, aby twoja gra była spójna i działała tak samo niezależnie od szybkości twojego sprzętu.
pt: Ao multiplicar por [code]delta[/code], faz com que o movimento se torne [i]dependente do tempo[/i] ao invés de [i]dependente do frame[/i]. Isso é essencial para fazer o seu jogo consistente e justo.
zh_hans: 当乘以 [code]delta[/code] 时，运动变成了 [i]基于时间（time-dependent）[/i]的，而不是 [i]基于帧（frame-dependent）[/i]的。 要让游戏保持前后一致且合理的话，这是至关重要的。

source: Why do we use the number 3.0 in this example?
hu: Miért használtunk 3.0-at a példában?
nl: Waarom gebruiken we het getal 3,0 in dit voorbeeld?
pl: Dlaczego w tym przykładzie używamy liczby 3.0?
pt: Por que usamos o número 3.0 nesse exemplo?
zh_hans: 为什么我们在这个例子中用的值是 3.0？

source: At the top of the lesson, we made the robot rotate a fixed amount every frame: [code]0.05[/code] radians. In the example above, we now [i]multiply[/i] the argument by the very small [code]delta[/code] value, a value way below [code]1.0[/code]. It makes the robot turn at a constant speed over time. However, multiplying by a number below [code]1.0[/code] like [code]delta[/code] makes the result smaller. To compensate for that and make the robot turn fast enough, we use a larger number than before, [code]3.0[/code] instead of [code]0.05[/code]. Those numbers have two different [i]units[/i]: [code]0.05[/code] is an [i]angle[/i] in radians, while [code]3.0[/code] is an [i]angular speed[/i] in radians per second. When you multiply a speed by a time delta, it gives you an angle. Don't worry if it's a little confusing for now. It'll eventually click as you deal with speed, acceleration, and motion in your game projects.
hu: A lecke elején a robotot minden frame-en egy fix értékkel forgattuk: [code]0.05[/code] radiánnal. A fenti példában most [i]beszorozzuk[/i] az argumentumot a nagyon apró [code]delta[/code] értékkel, ami jóval kisebb, mint [code]1.0[/code]. Ennek köszönhetően a robot állandó sebességgel fog forogni. Azonban, egy [code]1.0[/code]-nél kisebb számmal való szorzás, mint amilyen a [code]delta[/code] is, az eredményt még kisebbé teszi. Ennek kompenzálására, hogy elég gyorsan forogjon a robot, a korábbinál nagyobb számot használunk: [code]0.05[/code] helyett [code]3.0[/code]-at. Ezeknek a számoknak 2 különböző [i]mértékegysége[/i] van: a [code]0.05[/code] egy radiánban megadott [i]szög[/i], míg a [code]3.0[/code] a [i]szögsebesség[/i] radián per másodpercben megadva. Ha a sebességet delta idővel szorzod, akkor egy szöget fogsz kapni. Nem baj, ha most még nem látod át. Majd le fog esni, ahogy sebességgel, gyorsulással és mozgással foglalkozol a játékaidban.
nl: Aan het begin van de les hebben we de robot elk frame een vaste hoeveelheid laten draaien: [code]0.05[/code] radialen. In het bovenstaande voorbeeld [i]vermenigvuldigen[/i] we het argument nu met de zeer kleine waarde [code]delta[/code], een waarde ver onder [code]1.0[/code]. Hierdoor draait de robot met een constante snelheid in de tijd. Echter, vermenigvuldigen met een getal onder de [code]1.0[/code] zoals [code]delta[/code] maakt het resultaat kleiner. Om dat te compenseren en de robot snel genoeg te laten draaien, gebruiken we een groter getal dan voorheen, [code]3.0[/code] in plaats van [code]0.05[/code]. Deze getallen hebben twee verschillende [i]eenheden[/i]: [code]0,05[/code] is een [i]hoek[/i] in radialen, terwijl [code]3,0[/code] een [i]hoeksnelheid[/i] in radialen per seconde is. Als je een hoeksnelheid vermenigvuldigt met een tijdsdelta, krijg je een hoek. Maak je geen zorgen als het nu nog wat verwarrend is. Het zal uiteindelijk wel klikken als je in je spelprojecten te maken krijgt met snelheid, versnelling en beweging.
pl: W pierwszej części lekcji sprawiliśmy, że robot obracał o stałą wartość [code]0.05[/code] radianów w każdej klatce. W powyższym przykładzie [i]mnożymy[/i] argument przez bardzo małą wartość [code]delta[/code] wynoszącą znacznie mniej niż [code]1.0[/code]. Dzięki niej robot obraca się ze stałą prędkością w czasie. Jednak pomnożenie przez liczbę poniżej [code]1.0[/code], na przykład wartość [code]delta[/code], czyni wynik mnożenia mniejszym a obrót wolniejszym. Chcąc to zrekompensować i sprawić, by robot obracał się w miarę szybko, używamy większej liczby niż wcześniej, stąd właśnie to [code]3.0[/code] zamiast [code]0.05[/code]. Liczby w nawiasie mają dwie różne [i]jednostki[/i]: [code]0.05[/code] jest [i]kątem[/i] w radianach, podczas gdy [code]3.0[/code] jest [i]prędkością kątową[/i] w radianach na sekundę. Kiedy pomnożysz prędkość przez deltę czasu, otrzymasz kąt. Nie martw się, jeśli na razie jest to trochę zagmatwane. W końcu po prostu sam z siebie to ogarniesz, gdy będziesz miał do czynienia z szybkością, przyśpieszeniem i ruchem podczas tworzenia własnych gier.
pt: No início da lição, fizemos o robô rotacionar por uma quantidade fixa a cada frame: [code]0.05[/code] radianos. No exemplo acima, agora[i]multiplicamos[/i] o argumento com o valor muito pequeno de [code]delta[/code], um valor muito abaixo de [code]1.0[/code]. Isso faz com que o robô rotacione a uma velocidade constante ao longo do tempo. No entanto, multiplicar por um número abaixo de [code]1.0[/code] como é o caso do [code]delta[/code], torna o resultado menor. Para compensar isso e fazer o robô rotacionar rápido o suficiente, usamos um número maior do que antes, [code]3.0[/code] ao invés de [code]0.05[/code]. Esses números têm duas [i]unidades[/i] diferentes: [code]0,05[/code] é um [i]ângulo[/i] em radianos, enquanto [code]3,0[/code] é uma [i]velocidade angular[/i] em radianos por segundo. Quando multiplica uma velocidade por um delta de tempo, obtém um ângulo. Não se preocupe se estiver um pouco confuso/a no momento. Com o tempo, vai compreender o jeito de lidar com velocidade, aceleração e movimento nos seus projetos de jogos.
zh_hans: 在课程的开始时期，我们让机器人每帧旋转一个固定的量：[code]0.05[/code] 弧度。 在上面的示例中，现在我们要把参数[i] 乘上 [/i]一个非常小的 [code]delta[/code] 值，该值远小于 [code]1.0[/code]。它能让机器人随着时间的推移以恒定的速度转动。 但是，乘以一个小于 [code]1.0[/code] 的数字，如 [code]delta[/code]这种数会使结果非常小。 为了弥补这一点，让机器人转动得足够快，我们用了比以前更大的数，[code]3.0[/code] 而不是 [code]0.05[/code]。 这两个数的 [i]单位[/i]不同：[code]0.05[/code] 的是以弧度表示的 [i]角度[/i]，而 [code]3.0[/code] 是 [i]角速度[/i]，以弧度每秒为单位。 将角速度乘以时间增量delta时，你会得到一个角度。 如果现在有点搞不清楚，不用担心。当你最终在游戏项目中处理速度、加速度和运动时，这种问题一点就通。

source: Why the time between frames matters
hu: Ezért fontos a frame-ek közt eltelt idő
nl: Waarom de tijd tussen frames ertoe doet
pl: Dlaczego czas pomiędzy klatkami ma znaczenie
pt: Por quê o tempo entre os frames é importante
zh_hans: 为什么帧之间的时间间隔很重要

source: The time it takes to display a new frame varies. If you don't take that time into account in your code, your game will have gameplay issues and bugs. Godot provides that time to the [code]_process()[/code] function through the [code]delta[/code] parameter. In the example below, the top robot moves using [code]delta[/code]. As a result, it moves at a fixed speed. The bottom robot moves over a constant distance every frame, [i]without[/i] taking [code]delta[/code] into account. It will move faster or slower than the top robot on [i]your[/i] computer. The bottom robot will move [i]differently for everyone[/i]!
hu: Egy új frame kirajzolásához szükséges idő folyamatosan változik. ha ezt az időt nem veszed figyelembe a kódodban, akkor bugok és egyéb játékmeneti hibák jöhetnek elő a játékodban. A Godot elérhetővé teszi ezt az időt a [code]_process()[/code] függvényben a [code]delta[/code] paraméter segítségével. A lenti példában a felső robot [code]delta[/code] segítségével mozog. Ennek eredményeképpen a sebessége állandó. Az alsó robot minden frame-en azonos távolságot tesz meg, [i]anélkül[/i],hogy figyelembe venné a [code]delta[/code] időt. Így a [i]te[/i] számítógépeden lassabban vagy épp gyorsabban mozog, mint a fenti robot. Az alsó robot [i]mindenkinél máshogy fog mozogni[/i]!
nl: De tijd die nodig is om een nieuw frame weer te geven varieert. Als je in je code geen rekening houdt met die tijd, zal je spel gameplayproblemen en bugs vertonen. Godot geeft die tijd door aan de [code]_process()[/code] functie via de [code]delta[/code] parameter. In het onderstaande voorbeeld beweegt de bovenste robot met behulp van [code]delta[/code]. Daardoor beweegt hij met een vaste snelheid. De onderste robot beweegt elk frame over een constante afstand, [i]zonder[/i] rekening te houden met [code]delta[/code]. Hij zal sneller of langzamer bewegen dan de bovenste robot op [i]jouw[/i] computer. De onderste robot zal [i]voor iedereen[/i] anders bewegen!
pl: Czas potrzebny do wyświetlenia nowej klatki się różni. Jeśli nie weźmiesz tego czasu pod uwagę w swoim kodzie, stworzona przez ciebie gra będzie miała błędy i może sprawić problemy z rozgrywką. Godot udostępnia czas upływający pomiędzy poszczególnymi klatkami funkcji [code]_process()[/code] poprzez parametr [code]delta[/code]. W poniższym przykładzie górny robot porusza się za pomocą wartości [code]delta[/code]. W rezultacie porusza się on ze stałą prędkością dla każdego użytkownika. Dolny robot porusza się o odległość stałą w każdej klatce [i]bez[/i] uwzględniania czasu [code]delta[/code]. Na [i]twoim[/i] komputerze będzie on poruszał się szybciej lub wolniej niż [i]deltowy robot[/i]. Dolny robot będzie poruszał się z [i]inną prędkością dla każdego[/i]!
pt: O tempo que leva para exibir um novo frame varia. Se não levar esse tempo em consideração no seu código, o seu jogo terá problemas de jogabilidade e bugs. A Godot fornece esse tempo para a função [code]_process()[/code] através do parâmetro [code]delta[/code]. No exemplo abaixo, o robô da parte superior se move usando [code]delta[/code]. Como resultado, ele se move a uma velocidade fixa. O robô da parte inferior se move a uma distância constante a cada frame, [i]sem[/i] levar em consideração [code]delta[/code]. Ele se moverá mais rápido ou mais devagar que o robô da parte superior no [i]seu[/i] computador. O robô da parte inferior se vai mover [i]diferente para todo mundo[/i]!
zh_hans: 显示新的一帧所需的时间会有所不同。 如果你在代码中不考虑这个时间差，你的游戏就会出现游戏性问题和各种bug。 Godot 通过 [code]delta[/code] 参数向 [code]_process()[/code] 函数提供了该时间。 在下面的示例中，上面的机器人使用 [code]delta[/code] 移动。结果数，它以恒定的速度移动。 下面的机器人每帧移动一个恒定的距离，[i]没有[/i]考虑[code]delta[/code]。在 [i]你的这台[/i] 计算机上，它会比上面那个机器人更快或更慢。 下面的机器人会[i]因为设备的不同有着完全不同的移动方式[/i]！
