Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-12-using-variables.po
Languages: es, hu, nl, pl, pt, tr, zh_hans

source: Let's give the [code]4[/code] here a label so we know what it does. Create a variable called [code]angular_speed[/code] outside of the [code]_process()[/code] function to make it script-wide. This allows us to use it in other functions too. Then, replace the [code]4[/code] with [code]angular_speed[/code].
es: Démosle al [code]4[/code] aquí una etiqueta para que sepamos lo que hace. Crea una variable llamada [code]angular_speed[/code] fuera de la función [code]_process()[/code] para hacerla script-wide. Esto nos permite utilizarla también en otras funciones. Luego, sustituye el [code]4[/code] por [code]angular_speed[/code].
hu: Adjunk a [code]4[/code]-nek egy címkét, hogy tudjuk, mit csinál. Hozz létre egy [code]angular_speed[/code] nevű változót a [code]_process()[/code] függvényen kívül, hogy szkript-szintű legyen. Így más függvényekben is felhasználhatjuk. Ezután cseréld le a [code]4[/code]-et [code]angular_speed[/code]-re.
nl: Laten we de [code]4[/code] hier een label geven zodat we weten wat het doet. Maak een variabele genaamd [code]angular_speed[/code] buiten de [code]_process()[/code] functie om deze script-breed te maken. Hierdoor kunnen we hem ook in andere functies gebruiken. Vervang vervolgens de [code]4[/code] door [code]angular_speed[/code].
pl: Dajmy wartości [code]4[/code] etykietę, dzięki której na pierwszy rzut oka będziemy wiedzieli, co takiego robi. Utwórz zmienną o nazwie [code]angular_speed[/code] poza funkcją [code]_process()[/code], aby była ona dostępna w całym skrypcie. To pozwali nam używać jej również w innych funkcjach. Następnie podmień w kodzie wartość [code]4[/code] na zmienną [code]angular_speed[/code].
pt: Vamos dar um nome ao valor [code]4[/code] aqui para sabermos o que ele faz. Crie uma variável chamada [code]angular_speed[/code] fora da função [code]_process()[/code] para torná-la uma variável de script. Isso nos permite usá-la em outras funções também. Em seguida, substitua o [code]4[/code] por [code]angular_speed[/code].
tr: Buradaki [code]4[/code] sayısına bir etiket verelim ki ne işe yaradığını bilelim. Betik-genelinde olması için [code]_process()[/code] fonksiyonunun dışında [code]angular_speed[/code] (açısal_hız) adında bir değişken oluştur. Bu, onu diğer fonksiyonlarda da kullanmamızı sağlar. Ardından, [code]4[/code] değerini [code]angular_speed[/code] ile değiştir.
zh_hans: 给这里的 [code]4[/code] 一个标签，以便我们了解它的作用。 在 [code]_process()[/code] 函数之外创建一个名为 [code]angular_speed[/code] 的变量，使其成为脚本范围的变量。这样我们就可以在其他函数中使用它。 然后，将 [code]4[/code] 替换为 [code]angular_speed[/code]。

source: Using variables to store number values makes code easier to read. Tidy up this function by storing a value in a variable.
es: El uso de variables para almacenar valores numéricos hace que el código sea más fácil de leer. Ordena esta función almacenando un valor en una variable.
hu: A változók használata értékek tárolására, könyebben átláthatóvá teszi a kódot. Szedd rendbe ezt a függvényt azzal, hogy egy változóban tárolod az értéket.
nl: Variabelen gebruiken om getalwaarden op te slaan maakt code gemakkelijker om te lezen. Verduidelijk deze functie door een waarde in een variabele op te slaan.
pl: Używanie zmiennych do przechowywania wartości liczbowych ułatwia czytanie kodu. Uporządkuj tę funkcję przechowując wartość w zmiennej.
pt: O uso de variáveis para armazenar valores numéricos facilita a leitura do código. Arrume essa função armazenando um valor numa variável.
tr: Sayısal değerleri saklamak için değişkenleri kullanmak kodun okunmasını kolaylaştırır. Bir değeri bir değişkende saklayarak bu fonksiyonu düzelt.
zh_hans: 使用变量来存储数值，代码会更易于阅读。通过将值存储在变量中，让这个函数更清晰。

source: Fixing an Out of Scope Error
es: Corrección de un error fuera de alcance
hu: Out of Scope Error javítása
nl: Een out-of-scope-fout oplossen
pl: Naprawianie błędu Out of Scope
pt: Corrigindo um Erro Chamado Fora do Escopo (Out of Scope Error)
tr: Bir Kapsam Dışı (Out of Scope) Hatasını Düzeltmek
zh_hans: 修复这个“超出范围”错误

source: There's something wrong with the code here. Can you see what it is? Run the code and read the error. Correct the code so it works as intended.
es: Hay algo mal con el código aquí. ¿Puedes ver qué es? Ejecuta el código y lee el error. Corrige el código para que funcione como es debido.
hu: Valami baj vana kóddal. Látod, mi az? Futtasd a kódot, és olvasd el a hibaüzenetet. Javítsd a kódot, hogy megfelelően működjön..
nl: Er is iets mis met de code hier. Zie je wat het is? Voer de code uit en lees de foutmelding. Corrigeer de code zodat hij werkt zoals bedoeld.
pl: Z napisanym kodem coś jest nie tak. Jesteś w stanie powiedzieć, co takiego wywołuje problem? Uruchom kod i odczytaj błąd. Popraw kod, aby działał zgodnie z przeznaczeniem.
pt: Tem alguma coisa de errado com o código aqui. Pode ver o que é? Execute o código e leia o erro. Corrija o código para que funcione como pretendido.
tr: Buradaki kodda bir sorun var. Ne olduğunu görebiliyor musun? Kodu çalıştır ve hatayı oku. (Açıkla tuşunu kullanabilirsin) Amaçlandığı gibi çalışması için kodu düzelt.
zh_hans: 这里的代码有问题。你能看出是什么问题吗？ 运行代码并看看是什么错误。 更正代码，使其按预期工作。

source: Uh oh! There's something wrong here. Can you fix it?
es: ¡Oh, oh! Hay algo mal aquí. ¿Puedes arreglarlo?
hu: Ajaj! Valami baj van. Ki tudod javítani?
nl: Uh oh! Er is hier iets mis. Kun jij het oplossen?
pl: Uaa-a! Poza zakresem? Coś tu nie gra. Dasz radę to jakoś ogarnąć?
pt: Uh oh! Há algo de errado aqui. Pode consertar isso?
tr: Eyvah! Burada bir sorun var. Düzeltebilir misin?
zh_hans: 哎呀！这里有点儿问题。你能修好吗？

source: Using Variables to Make Code Easier to Read
es: Uso de variables para facilitar la lectura del código
hu: Változók használata a kód könyebben olvashatóvá tételére
nl: Variabelen gebruiken om code leesbaarder te maken
pl: Używanie zmiennych do uczynienia kodu bardziej czytelnym
pt: Usando Variáveis para Fazer o Código Mais Fácil de se Ler
tr: Kodu Kolay Okunur Yapmak için Değişkenleri Kullanmak
zh_hans: 变量使代码更易于阅读
