Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-11-time-delta.po
Languages: hu, nl, pl, pt, zh_hans

source: Multiplying time-sensitive values by [code]delta[/code] makes them [b]time-dependent[/b] rather than [b]frame-dependent[/b]. Thanks to that, we get reliable movement over time. Without [code]delta[/code], frame times vary from computer to computer and during gameplay. Because of that, the movement will differ for every player, making the game inconsistent and messy.
hu: Ha idő érzékeny értékeket szorzunk [code]delta[/code]-val, akkor ezután az [b]időtől[/b] fognak függni, nem pedig a [b]frame[/b]-ektől. Ennek köszönhetően megbízható mozgást kapunk. [code]delta[/code] nélkül, a frame-ek miden számítógépen és játék közben is mások lennének. Ennek hatására a mozgás minden játékos számára más lenne, ami miatt következetlen lenne a játék és zavaros.
nl: Tijdgevoelige waarden vermenigvuldigen met [code]delta[/code] maakt ze [b]tijdsafhankelijk[/b] in plaats van [b]frame-afhankelijk[/b]. Daardoor krijgen we betrouwbare beweging in de tijd. Zonder [code]delta[/code] variëren frametijden van computer tot computer en tijdens het spelen. Daardoor verschilt de beweging voor elke speler, waardoor het spel onregelmatig en rommelig wordt.
pl: Pomnożenie wartości zależnych od czasu przez [code]delta[/code] powoduje, że są one [b]zależne od czasu[/b], a nie [b]zależne od ramki[/b]. Dzięki temu z czasem otrzymujemy niezawodny ruch. Bez [code]delta[/code] czas wyświetlania klatek różni się w zależności od komputera, a nawet zmienia się podczas gry. Z tego powodu ruch będzie inny dla każdego gracza, przez co gra będzie niespójna i niechlujna.
pt: A multiplicação de valores sensíveis ao tempo por [code]delta[/code] os torna [b]dependentes do tempo[/b] ao invés de [b]dependentes do frame[/b]. Graças a isso, obtemos um movimento estável ao longo do tempo. Sem o [code]delta[/code], os tempos de frame variam de computador para computador e durante o jogo. Por causa disso, o movimento vai ser diferente para cada jogador, tornando o jogo inconsistente e confuso.
zh_hans: 将时间高度相关的值乘以 [code]delta[/code] 使它们的行为 [b]基于时间（time-dependent）[/b] 进行而不是 [b]基于帧（frame-dependent）[/b]进行。 好在能这样做，我们才能得到随着时间推移可靠的运动。 如果没有 [code]delta[/code]，每帧的时间会因计算机不同和游玩过程不同而不同。受此影响，每个玩家看到的运动模式都会有所不同，游戏会变得不稳定、表现得乱七八糟的。

source: What does this mean?
hu: Mit jelent ez?
nl: Wat betekent dit?
pl: Co to oznacza?
pt: O que isso significa?
zh_hans: 下面这个式子是什么意思？

source: [code]rotation_speed * delta[/code]
zh_hans: [code]rotation_speed * delta[/code]（旋转速度*delta）

source: The [code]*[/code] symbol means we're multiplying [code]rotation_speed[/code] by [code]delta[/code] time.
hu: A [code]*[/code] karakter azt jelenti, hogy a [code]rotation_speed[/code]-et megszorozzuk a [code]delta[/code] idővel.
nl: Het symbool [code]*[/code] betekent dat we de [code]rotation_speed[/code] vermenigvuldigen met de tijd [code]delta[/code].
pl: Symbol [code]*[/code] oznacza, że mnożymy [code]rotation_speed[/code] przez czas [code]delta[/code].
pt: O símbolo [code]*[/code] significa que estamos multiplicando [code]rotation_speed[/code] por [code]delta[/code].
zh_hans: [code]*[/code] 符号表示将 [code]rotation_speed[/code] 乘以 [code]delta[/code] 时间。

source: We're multiplying rotation_speed by delta.
hu: A rotation_speed-et szorozzuk delta-val.
nl: We vermenigvuldigen rotation_speed met delta.
pl: Mnożymy rotation_speed przez wartość delta.
pt: Estamos multiplicando a variável rotation_speed por delta.
zh_hans: 将rotation_speed 乘以delta。

source: We're dividing delta by rotation_speed.
hu: Elosztjuk a delta-t a rotation_speed-del.
nl: We delen delta door rotation_speed.
pl: Dzielimy deltę przez rotation_speed.
pt: Estamos dividindo delta pela variável rotation_speed.
zh_hans: 将delta除以rotation_speed。

source: We're adding rotation_speed to delta.
hu: Hozzáadjuk a rotation_speed-et a delta-hoz.
nl: We tellen rotation_speed op bij delta.
pl: Do rotation_speed dodajemy wartość delta.
pt: Estamos somando a variável rotation_speed e delta.
zh_hans: 将rotation_speed和delta相加。

source: We're subtracting delta from rotation_speed.
hu: Kivonjuk a delta-t a rotation_speed-ből.
nl: We trekken delta af van rotation_speed.
pl: Odejmujemy wartość delta od rotation_speed.
pt: Estamos subtraindo delta da variável rotation_speed.
zh_hans: 从rotation_speed 中减去delta。

source: In the next practice, we'll use delta to make rotating time-dependent.
hu: A következő gyakorlatban arra fogjuk használni a delta-t, hogy a forgatás az időtől függjön.
nl: In de volgende oefening zullen we delta gebruiken om het draaien tijdsafhankelijk te maken.
pl: W następnym ćwiczeniu użyjemy wartości delta do uzależnia obrotu od czasu.
pt: Na próxima prática, vamos usar delta para tornar a rotação dependente do tempo.
zh_hans: 在接下来的练习中，我们将使用 delta 来使旋转与时间关联起来。

source: Rotating Using Delta
hu: Forgatás a delta segítségével
nl: Draaien met delta
pl: Obracanie z wykorzystaniem delty
pt: Rotacionando Usando Delta
zh_hans: 使用 Delta 的旋转

source: At the moment, the rotation of the robot is frame-dependent. Add [code]delta[/code] to make the rotational speed time-dependent. The robot should rotate [code]2[/code] radians per second.
hu: Jelenleg a robot forgatása a frame-ektől függ. Adjuk hozzá a [code]delta[/code]-t, hogy a forgatás sebessége az időtől függjön. A robotnak másodpercenként [code]2[/code] radiánnal kell elfordulnia.
nl: Op dit moment is de draaiing van de robot frame-afhankelijk. Voeg [code]delta[/code] toe om de draaisnelheid tijdsafhankelijk te maken. De robot moet [code]2[/code] radialen per seconde draaien.
pl: W tej chwili obrót robota zależy od klatki. Użyj w kodzie wartości [code]delta[/code], aby uzależnić prędkość obrotową od czasu. Robot powinien obracać [code]2[/code] radiany na sekundę.
pt: No momento, a rotação do robô depende do frame. Adicione [code]delta[/code] para tornar a velocidade de rotação dependente do tempo. O robô deve rotacionar [code]2[/code] radianos por segundo.
zh_hans: 目前，机器人的旋转是帧相关的运动。 添加 [code]delta[/code] 变量，以使旋转速度与时间相关。 机器人应该每秒旋转 [code]2[/code] 弧度。

source: Moving in a Circle Using Delta
hu: Körkörös mozgás a delta segítségével
nl: In een cirkel bewegen met delta
pl: Poruszanie się po kole z wykorzystaniem delty
pt: Mover num Círculo Usando Delta
zh_hans: 使用 Delta 的绕圈移动

source: In this practice, make the robot move in a smooth circle using delta. To get this movement, the robot should rotate [code]2[/code] radians per second and move [code]100[/code] pixels per second towards clockwise. [b]Note:[/b] Please write the values in the parentheses when calling the functions. If you define extra variables, we will not be able to check your practice.
hu: Ebben a gyakorlatban egyenletesen fogjukkörbe mozgatni a robotot a delta segítségével. Ennek eléréséhez a robotnak másodpercenként [code]2[/code] radiánt és [code]100[/code] pixelt kell mozognia az óramutató járása szerint. [b]Megjegyzés:[/b] Kérjük írd az értékeket a zárójelbe, ha hívod a függvényt. ha extra változókat hozol létre nem fogjuk tudni értékelni a gyakorlatot.
nl: In deze oefening laat je de robot in een vloeiende cirkel bewegen met behulp van delta. Om deze beweging te krijgen, moet de robot [code]2[/code] radialen per seconde draaien en [code]100[/code] pixels per seconde met de klok mee bewegen. [b]Let op:[/b] Schrijf de waarden tussen de haakjes wanneer je de functies aanroept. Als je extra variabelen definieert, kunnen we je oefening niet controleren.
pt: Neste exercício, faça o robô se mover num círculo suave usando delta. Para obter esse movimento, o robô deve girar [code]2[/code] radianos por segundo e mover [code]100[/code] pixels por segundo no sentido horário. [b]Nota:[/b] Por favor, escreva os valores entre parênteses ao chamar as funções. Se definir variáveis adicionais, não poderemos corrigir o seu exercício.
zh_hans: 在这个练习中，使用 delta 使机器人做平滑的圆周运动。 为了实现这种运动，机器人应该每秒旋转 [code]2[/code] 弧度，并以每秒 [code]100[/code] 个像素的线速度向顺时针方向移动。 [b]请注意：[/b]在调用函数时请将值写在函数的小括号内。以及如果你定义了额外的变量，我们将无法检查你的练习。

source: Time Delta
hu: Delta idő
nl: De tijdsdelta
pt: Delta de Tempo
zh_hans: 时间增量Delta

source: rotate
pt: rotacionar

source: Depending on the game, the computer, and what the game engine needs to calculate, frames take more or less time to display. There will always be milliseconds variations from frame to frame. That is why the [code]_process()[/code] function receives a [code]delta[/code] parameter. The word "delta" represents a time difference. It's the time passed since the previous frame, in seconds. The [code]delta[/code] parameter tells us how long it took for Godot to complete the [b]previous frame[/b]. We can use it to ensure that the variations between frames don't make the game's simulation unreliable.
hu: A játéktól, a számítógéptől és attól, hogy az engine-nek mit kell számolnia, egy frame kirajzolása több vagy kevesebb ideig is eltarthat. Mindig lesznek milliszekundumnyi különbségek a frame-ek közt. Ezért fogad a [code]_process()[/code] függvény egy [code]delta[/code] nevű paramétert. A "delta" az időkülönbséget jelképezi. Ez az előző frame óta eltelt idő, másodpercben megadva. A [code]delta[/code] paraméter mondja meg, hogy a Godotnak mennyi időbe telt kiszámolni az [b]előző frame[/b]-et. Használhatjuk arra, hogy megbizonyosodjunk róla, hogy a frame-ek közti különbségek nem mennek a szimuláció rovására.
pt: Dependendo do jogo, do computador e do que a engine do jogo precisa calcular, os frames levam mais ou menos tempo para serem exibidos. Sempre haverá variações de milissegundos de frame a frame. É por isso que a função [code]_process()[/code] recebe um parâmetro [code]delta[/code]. A palavra "delta" representa uma diferença de tempo. É o tempo decorrido desde o frame anterior, em segundos. O parâmetro [code]delta[/code] nos diz quanto tempo levou para a Godot completar o [b]frame anterior[/b]. Podemos usar o delta para garantir que as variações entre os frames não tornem a simulação do jogo instável.

source: [code]delta[/code] is the time it takes Godot to complete the previous frame in seconds. It's very small because frames happen many times a second. It varies each frame because Godot needs to process more or less each frame.
hu: A [code]delta[/code] az a másodpercben megadott idő, ami alatt a Godot kiszámolta az előző frame-et. Nagyon kicsi szám, mert másodpercenként sok frame van. Frame-enként változik, mert a Godotnak minden újabb frame-en többet vagy kevesebbet kell számolnia.
pt: [code]delta[/code] é o tempo que a Godot leva para completar o frame anterior medido em segundos. É muito pequeno porque os frames acontecem muitas vezes por segundo. Varia a cada frame porque a Godot precisa processar mais ou processar menos cada frame.

source: It's the time it takes Godot to complete the previous frame.
hu: Az az idő, ami alatt a Godot kiszámolta az előző frame-et.
pt: É o tempo que a Godot leva para completar o frame anterior.
