Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-9-adding-and-subtracting.po
Languages: hu, id, ja, pl, tr, zh_hans

source: Our character in our game will have health by defining the [code]health[/code] variable. The higher the character's health, the further away the player is from losing the game.
id: Karakter kita dalam permainan kita akan memiliki kesehatan dengan mendefinisikan variabel [code]health[/code]. Semakin tinggi kesehatan karakter, semakin jauh pemain dari kekalahan.

source: Health that changes adds tension to the game, especially if the player is fighting with low health! It's a resource that the player should manage carefully.
id: Kesehatan yang berubah menambah ketegangan dalam permainan, terutama jika pemain bertarung dengan kesehatan yang rendah! Ini adalah sumber daya yang harus dikelola pemain dengan hati-hati.

source: The character's health might get low if an enemy attacks them or they fall into a hole.
id: Kesehatan karakter mungkin berkurang jika musuh menyerangnya atau terjatuh ke dalam lubang.

source: We can create a function to represent damage in these cases.
id: Kita dapat membuat fungsi untuk mewakili kerusakan dalam kasus ini.

source: We pass the amount of damage the robot should take as a parameter.
id: Kita mengirimkan jumlah kerusakan yang harus diterima robot sebagai parameter.

source: Line 2 subtracts [code]amount[/code] from [code]health[/code].
id: Pada baris ke-2, nilai [code]amount[/code] dikurangkan dari [code]health[/code].

source: Note the [code]-=[/code] syntax which achieves this. It's a shorthand we often use.
id: Perhatikan sintaks [code]-=[/code] yang digunakan untuk melakukan hal ini. Ini adalah bentuk singkat yang sering digunakan.

source: You can also use a longer form. Both of these lines have the same effect. They both subtract the value of [code]amount[/code] from the [code]health[/code] variable:
id: Kamu juga bisa menggunakan bentuk yang lebih panjang. Kedua baris di bawah ini memiliki efek yang sama, yaitu mengurangkan nilai [code]amount[/code] dari variabel [code]health[/code]:

source: You may notice that the health of the robot can go below [code]0[/code]. We'll see how to manage this in a future lesson using [i]conditions[/i].
id: Kamu mungkin menyadari bahwa nilai kesehatan robot bisa turun di bawah [code]0[/code]. Kita akan mempelajari cara menangani hal ini di pelajaran selanjutnya dengan menggunakan [i]kondisi[/i].

source: The robot's health could increase instead if the player picks up an item that heals them, or if they use a healing item.
hu: A robot életereje növekedhet is, ha a játékos felvesz vagy használ egy tárgyat, ami gyógyítja őt.
id: Kesehatan robot bisa meningkat jika pemain mengambil item yang menyembuhkan, atau jika mereka menggunakan item penyembuh.
ja: ロボットの体力は、プレイヤーが回復するアイテムを拾ったり、回復アイテムを使用したりした場合に増加する可能性があります。
pl: Zdrowie naszego robota może również wzrosnąć, jeśli gracz podniesie przedmiot, który go uleczy lub użyje przedmiotu leczącego.
tr: Bunun tersine, oyuncu, onları iyileştiren bir eşya toplayınca, veya iyileştirici bir eşya kullanırsa, robotun sağlığı artabilir.
zh_hans: 如果玩家捡起一个可以回血物品，或者如果他们使用治疗道具，机器人的生命值应该得增加。

source: Here again, the health can go beyond [code]100[/code].
id: Di sini juga, kesehatan bisa melebihi [code]100[/code].

source: Also, once more, the short line [code]health += amount[/code] is equivalent to the longer form [code]health = health + amount[/code].
id: Selain itu, sekali lagi, baris pendek [code]health += amount[/code] setara dengan bentuk yang lebih panjang [code]health = health + amount[/code].

source: Which of these would increase the health of the robot?
hu: Az alábbiak közül melyik növelné a robot életerejét?
id: Manakah dari ini yang akan meningkatkan kesehatan robot?
ja: これらのうち、ロボットの体力を向上させるのはどれですか?
pl: Które z podanych operacji zwiększą zdrowie naszego robota?
tr: Bunlardan hangisi, robotun sağlığını yükseltir?
zh_hans: 下列哪些操作能增加机器人的生命值？

source: Both of these lines increase the [code]health[/code] of the robot by [code]amount[/code]. [code] health += amount health = health + amount [/code]
hu: Mindkét sor növeli a [code]health[/code] értékét [code]amount[/code]-tal. [code] health += amount health = health + amount [/code]
id: Keduanya akan meningkatkan [code]health[/code] dari robot sebesar [code]amount[/code]. [code] health += amount health = health + amount [/code]
ja: これらの行は両方とも、ロボットの [code]health[/code] を [code]amount[/code] だけ増やします。 [code] health += amount health = health + amount [/code]
pl: Oba te wiersze zwiększą zdrowie reprezentowane przez [code]health[/code] o wartość [code]amount[/code]. [code] health += amount health = health + amount [/code]
tr: Bu satırların her ikisi de, robotun sağlığını, [code]health[/code], verilen miktarda, [code]amount[/code] artırır. [code] health += amount health = health + amount [/code]
zh_hans: 这两种代码都能让机器人的 [code]health[/code] 增加 [code]amount[/code]点。 [code] health += amount health = health + amount [/code]

source: In the following practices, you'll code the [code]take_damage()[/code] and [code]heal()[/code] functions so the robot's health can decrease and increase.
hu: A következő gyakorlatban, el fogod készíteni a [code]take_damage()[/code] és a [code]heal()[/code] függvényeket, hogy a robot életereje csökenhessen és nőhessen.
id: Dalam latihan berikut, kamu akan menulis kode fungsi [code]take_damage()[/code] dan [code]heal()[/code] agar kesehatan robot bisa berkurang dan bertambah.
ja: 次の演習では、ロボットの体力を増減できるように、[code]take_damage()[/code] 関数と [code]heal()[/code] 関数をコーディングします。
pl: W poniższych ćwiczeniach zakodujesz funkcje [code]take_damage()[/code] i [code]heal()[/code], dzięki którym zdrowie robota będzie mogło się zmniejszać i zwiększać.
tr: Sıradaki uygulamada, [code]take_damage()[/code] (al_hasar) ve [code]heal()[/code] (iyileş) fonksiyonlarını kodlayacaksın, ve bu sayede robotun sağlığı azalabilir ve artabilir.
zh_hans: 在以下的练习中，你需要编写 [code]take_damage()[/code]（承受伤害） 和 [code]heal()[/code]（治疗） 函数，以便机器人的生命值可以减少或增加。

source: Damaging the Robot
hu: A robot sebzése
id: Melukai Robot
ja: ロボットの損傷
pl: Zadawanie obrażeń robotowi
tr: Robota Hasar Vermek
zh_hans: 让机器人受伤

source: In our game, the main character has a certain amount of [code]health[/code]. When it gets hit, the health should go down by a varying [code]amount[/code] of damage.
id: Dalam permainan kita, karakter utama memiliki sejumlah [code]health[/code]. Ketika terkena serangan, nilai kesehatan seharusnya berkurang berdasarkan [code]amount[/code] kerusakan yang berbeda-beda.

source: Add to the [code]take_damage()[/code] function so it subtracts the [code]amount[/code] to the predefined [code]health[/code] variable.
id: Tambahkan ke dalam fungsi [code]take_damage()[/code] agar [code]amount[/code] dikurangkan dari variabel [code]health[/code] yang sudah ditentukan.

source: The robot starts with 100 health and will take 50 damage.
id: Robot memulai dengan 100 health dan akan menerima 50 damage.

source: Learn how to deal damage to entities like our robot.
hu: Tanuld meg, hogyan kell sebzést okozni.
id: Pelajari cara memberikan damage (kerusakan) pada entitas seperti robot kita.
ja: ロボットのようなエンティティにダメージを与える方法を学びましょう。
pl: Dowiedz się, jak zadawać obrażenia jednostkom takim jak nasz robot.
tr: Robotumuz gibi varlıklara nasıl hasar vereceğinizi öğren.
zh_hans: 学习如何处理对类似这个机器人的实体造成伤害的功能。

source: Healing the Robot
hu: A robot gyógyítása
id: Menyembuhkan Robot
ja: ロボットの体力を回復する
pl: Leczenie robota
tr: Robotu İyileştirmek
zh_hans: 治疗这个机器人

source: It's time to heal the robot up to full health!
id: Sudah waktunya menyembuhkan robot hingga kesehatannya penuh!

source: Write a function called [code]heal()[/code] that takes [code]amount[/code] as a parameter.
id: Tulislah sebuah fungsi bernama [code]heal()[/code] yang menerima [code]amount[/code] sebagai parameter.

source: The function should add [code]amount[/code] to [code]health[/code].
id: Fungsi tersebut harus menambahkan [code]amount[/code] ke [code]health[/code].

source: The robot starts with 50 health and will heal 50 to get it up to 100.
id: Robot memulai dengan 50 health dan akan menyembuhkan 50 untuk kembali menjadi 100.

source: Our robot needs healing after that practice! Create a function to heal it back to full health.
hu: A robotunknak szüksége van egy kis gyógyulásra ezután a gyakorlat után! Készíts egy függvényt, ami teljesen felgyógyítja.
id: Robot kita butuh penyembuhan setelah latihan tadi! Buatlah sebuah fungsi untuk menyembuhkannya kembali hingga kesehatan penuh.
ja: 私たちのロボットは、その演習の後に癒しを必要としています!完全な体力に戻す関数を作成します。
pl: Po poprzednim ćwiczeniu nasz robot potrzebuje leczenia! Utwórz funkcję, która wyleczy go z powrotem do pełnego zdrowia.
tr: Robotumuzun bu alıştırmadan sonra iyileşmeye ihtiyacı var! Onu tam sağlığına kavuşturmak için bir fonksiyon oluştur.
zh_hans: 在扣血练习后我们的机器人需要治疗！创建一个函数来将其恢复到满血的状态。

source: Adding and Subtracting
hu: Összeadás és kivonás
id: Menambah dan Mengurangi
ja: 足し算と引き算
pl: Dodawanie i odejmowanie
tr: Ekleme ve Çıkartma Yapma
zh_hans: 加减法

source: Our character in our game will have health by defining the [code]health[/code] variable. The higher the character's health, the further away the player is from losing the game. Health that changes adds tension to the game, especially if the player is fighting with low health! It's a resource that the player should manage carefully. The character's health might get low if an enemy attacks them or they fall into a hole. We can create a function to represent damage in these cases.
ja: このゲームのキャラクターは、[code]health[/code]変数を定義することで体力を持ちます。キャラクターの体力が高いほど、プレイヤーはゲームに負ける可能性が低くなります。 体力が変化すると、特にプレイヤーが低体力で戦っている場合は、ゲームに緊張感が加わります!これは、プレイヤーが慎重に管理する必要があるリソースです。 キャラクターの体力は、敵に攻撃されたり、穴に落ちたりすると低下する可能性があります。 このような場合の損傷を表す関数を作成できます。
pl: Postać w naszej grze będzie miała zdrowie, które zdefiniujemy za pomocą zmiennej [code]health[/code]. Jak wiadomo im wyższy poziom zdrowia postaci, tym dalej gracz jest od przegranej. Zdrowie które się zmienia dodaje napięcie do gry, zwłaszcza kiedy gracz walczy z niskim poziomem zdrowia! Zdrowie jest zasobem którym gracz powinien bardzo ostrożnie zarządzać. Zdrowie postaci może spaść, jeśli wróg ją zaatakuje lub wpadnie ona do dziury. Dla takich przypadków możemy stworzyć funkcję reprezentującą otrzymywane obrażenia.
tr: Oyunumuzdaki karakterimiz, [code]health[/code] (sağlık) değişkenini tanımladığınızda artık bir sağlığa sahip olacaktır. Karakterin canı ne kadar yüksek olursa, oyuncunun oyunu kaybetmesi de o kadar zor olur. Değişen sağlık, oyuna gerilim katar, özellikle de oyuncu düşük sağlıkla savaşıyorsa! Sağlık, oyuncuların dikkatle yönetmesi gereken bir kaynaktır. Bir düşman saldırırsa veya bir çukura düşerse, karakterin sağlığı azalabilir. Bu durumlar için hasarı temsil edecek bir fonksiyon oluşturabiliriz.
zh_hans: 通过定义 [code]health[/code]（生命值） 变量，我们游戏中的角色将拥有生命值。角色的生命值越高，玩家离输掉游戏就越远。 生命值的变化增加了游戏的紧张感，尤其是当玩家在低生命值的情况下战斗时！这是玩家应该谨慎管理的资源。 如果被敌人攻击或掉进陷阱里，角色的生命值可能会变低。 我们可以创建一个函数来表示出这些情况中受到的伤害。

source: We pass the amount of damage the robot should take as a parameter. Line 2 subtracts [code]amount[/code] from [code]health[/code]. Note the [code]-=[/code] syntax which achieves this. It's a shorthand we often use. You can also use a longer form. Both of these lines have the same effect. They both subtract the value of [code]amount[/code] from the [code]health[/code] variable: [code]health -= amount[/code] [code]health = health - amount[/code] You may notice that the health of the robot can go below [code]0[/code]. We'll see how to manage this in a future lesson using [i]conditions[/i].
ja: ロボットが受けるダメージの量をパラメータとして渡します。 2 行目では、[code]health[/code] から [code]amount[/code] を減算します。 これを実現する [code]-=[/code] 構文に注目してください。 私たちがよく使う略語です。 より長い形式を使用することもできます。 これらの行はどちらも同じ効果があります。 どちらも [code]health[/code] 変数から [code]amount[/code] の値を減算します。 [code]health -= amount[/code] [code]health = health - amount[/code] ロボットの健全性が [code]0[/code] を下回る可能性があることに気づくかもしれません。 [i]条件[/i] を使用してこれを管理する方法については、今後のレッスンで説明します。
pl: Jako parametr przekazujemy ilość obrażeń które robot powinien przyjąć. Wiersz 2 odejmuje [code]amount[/code] od naszego zdrowia reprezentowanego przez [code]health[/code]. Zwróć uwagę na składnię [code]-=[/code], którą do tego wykorzystujemy. To często używany skrót. Zawsze możesz użyć również dłuższej formy. Obie pokazane linie dawać będą ten sam efekt. W obu wierszach odejmujemy wartość [code]amount[/code] od zmiennej [code]health[/code]: [code]health -= amount[/code] [code]health = health - amount[/code] Możesz zauważyć, że stan zdrowia robota może spaść poniżej [code]0[/code]. W kolejnej lekcji nauczymy się jak obsługiwać takie przypadki przy użyciu [i]warunków[/i].
tr: Robotun alması gereken hasar miktarını, alınan değişken (parametre) olarak geçiyoruz. Satır 2, hasar miktarını, [code]amount[/code], sağlık toplamından, [code]health[/code], çıkarır. Bunu sağlayan [code]-=[/code] sözdizimine dikkat et. Sıklıkla kullandığımız bir kısaltmadır. Daha uzun bir şeklini de kullanabilirsin. Aşağıdaki satırların her ikisi de aynı etkiye sahiptir. Her ikisi de [code]amount[/code] değerini, [code]health[/code] değişkeninden çıkartır: [code]health -= amount[/code] [code]health = health - amount[/code] Dikkat ederseniz, robotun sağlığının [code]0[/code]'dan aşağıya düşebileceğini görebilirsiniz. Bunu, [i]koşullar[/i] kullanarak nasıl yöneteceğimizi ileriki bir derste göreceğiz.
zh_hans: 我们将机器人应该承受的伤害量作为参数传递。 第 2 行从 [code]health[/code] 中减去 [code]amount[/code]（一定数量）。 请注意实现这种减法的 [code]-=[/code] 语法。这是经常使用的缩写方式。 你也可以使用一种长一些的写法。这两行的效果是一样的。它们都在 [code]health[/code] 的值里减去 [code]amount[/code] ： [code]health -= amount[/code] [code]health = health - amount[/code] 你可能会发现机器人的生命值可能低于 [code]0[/code]。我们将在以后的课程中学到如何使用 [i]conditions[/i]（条件） 来约束它。

source: Here again, the health can go beyond [code]100[/code]. Also, once more, the short line [code]health += amount[/code] is equivalent to the longer form [code]health = health + amount[/code].
hu: Itt megintcsak azt kátjuk, hogy a health mehet [code]100[/code] fölé is. És mégegyszer a rövid [code]health += amount[/code] formula ugyanaz, mint a hosszabb [code]health = health + amount[/code].
ja: ここでも、体力は[code]100[/code]を超える可能性があります。 また、短い行 [code]health += amount[/code] は、長い形式の [code]health = health + amount[/code] と同等です。
pl: Tutaj znowu nasze zdrowie może przekroczyć [code]100[/code]. Jeszcze raz przypomnimy, że krótki wiersz [code]health += amount[/code] jest odpowiednikiem dłuższej formy [code]health = health + amount[/code].
tr: Benzer şekilde, sağlık [code]100[/code] değerinin ötesine geçebilir. Ayrıca, bir kez daha, [code]health += amount[/code] kısa satırı, [code]health = health + amount[/code] uzun yazım şekline eşdeğerdir.
zh_hans: 同样的问题，生命值可以高出[code]100[/code]点。 以及同理，缩写方式 [code]health += amount[/code] 和 [code]health = health + amount[/code]这种更长的形式等价。

source: In our game, the main character has a certain amount of [code]health[/code]. When it gets hit, the health should go down by a varying [code]amount[/code] of damage. Add to the [code]take_damage()[/code] function so it subtracts the [code]amount[/code] to the predefined [code]health[/code] variable. The robot starts with 100 health and will take 50 damage.
hu: A játékunkban a főhösnek van egy bizonyos [code]health[/code] értéke. Ha találat éri, ennek csökkenie kéne az [code]amount[/code] értékű sebzés miatt. Egészítsd ki a [code]take_damage()[/code] függvényt, hogy kivonja az [code]amount[/code] értékét a [code]health[/code] változóból. A robot 100 élettel kezd és 50 sebzést szenved el.
ja: 私たちのゲームでは、主人公は一定量の[code]health[/code]を持っています。攻撃を受けると、体力はさまざまな[code]amount[/code]のダメージだけ減少するはずです。 [code]take_damage()[/code] 関数に追加して、定義済みの [code]health[/code] 変数に [code]amount[/code] を減算します。 ロボットの体力は100から始まり、50ダメージを受けます。
pl: W naszej grze główny bohater ma określoną ilość zdrowia przechowywaną w zmiennej [code]health[/code]. Kiedy bohater zostanie trafiony, zdrowie powinno spaść o wartość [code]amount[/code]. Dodaj do funkcji [code]take_damage()[/code] kod, który odejmować będzie [code]amount[/code] od wstępnie zdefiniowanej zmiennej [code]health[/code]. Robot zaczyna ze 100 punktami zdrowia i otrzyma 50 obrażeń.
tr: Oyunumuzda, ana karakterin belirli bir miktarda sağlığı var, [code]health[/code]. Hasar alırsa sağlığı, hasara bağlı değişen bir miktarda, [code]amount[/code], azalmalıdır. [code]take_damage()[/code] fonksiyonuna ekleme yaparak, [code]amount[/code] miktarını, önceden tanımlı [code]health[/code] değişkeninden çıkarmasını sağla. Robot 100 sağlıkla başlayacak, ve 50 hasar alacak.
zh_hans: 在我们的游戏中，主角有一定量的[code]health[/code]。当它被击中时，生命值应该会因收到不同的[code]amount[/code]（数量）伤害而下降。 补全 [code]take_damage()[/code] 函数，让它能把 定义好的[code]health[/code]变量减去[code]amount[/code]点。 机器人有 100 点起始生命值，会受到 50 点伤害。

source: It's time to heal the robot up to full health! Write a function called [code]heal()[/code] that takes [code]amount[/code] as a parameter. The function should add [code]amount[/code] to [code]health[/code]. The robot starts with 50 health and will heal 50 to get it up to 100.
hu: Ideje, hogy teljesen felgyógyítsuk a robotunkat. Készíts egy [code]heal()[/code] nevű függvényt, mely egy [code]amount[/code] nevű paramétert fogad. A függvény adja hozzá az [code]amount[/code] értékét a [code]health[/code]-hez. A robot 50 életerővel kezd, majd 50-et gyógyul, hogy 100 legyen.
ja: ロボットを完全な体力まで回復させる時が来ました! [code]amount[/code] をパラメーターとして受け取る [code]heal()[/code] という関数を記述します。 関数は [code]amount[/code] を [code]health[/code] に追加する必要があります。 ロボットの体力は50から始まり、50を回復して100まで回復します。
pl: Czas przywrócić naszemu robotowi pełnię zdrowia! Napisz funkcję o nazwie [code]heal()[/code], która przyjmie [code]amount[/code] jako parametr. Funkcja powinna dodać zmienną [code]amount[/code] do zmiennej [code]health[/code] Robot zaczyna z 50 punktami zdrowia i zostanie uleczony o 50 punktów, aby finalnie uzyskać wartość 100 punktów zdrowia.
tr: Şimdi de, robotu tam sağlığına kavuşturmanın zamanı! Alınan değişken olarak [code]amount[/code] (miktar) kullanan, [code]heal()[/code] (iyileştir) adında bir fonksiyon yaz. Bu fonksiyon, [code]amount[/code] değerini alıp sağlığa, [code]health[/code], eklemelidir. Robot, 50 sağlıkla başlayıp, 50 iyileşme alarak 100 sağlığa kavuşmalı.
zh_hans: 是时候让机器人重回健康状态了！ 编写一个名为 [code]heal()[/code] （治疗）的函数，它将 [code]amount[/code] 作为参数。 该函数应给 [code]health[/code] 添加 [code]amount[/code]点。 机器人开始时有 50 点生命值，然后会被治疗 50 点恢复成 100 点。
