Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-4-drawing-a-rectangle.po
Languages: fr, hu, it, nl, pl, pt_br, sv

source: We'll use code created by others like we did in the previous lesson. This time, we'll solve a more complicated problem: drawing shapes.
fr: Nous utiliserons du code créé par d'autres personnes comme nous l'avons fait dans la leçon précédente. Cette fois-ci, nous allons résoudre un problème plus compliqué : dessiner des formes.
hu: Az előző leckéhez hasonlóan, mások által írt kódot fogunk használni. Ezúttal egy kicsit bonyolultabb problémát oldunk meg: formákat rajzolunk.
it: Useremo codice creato da altri proprio come nelle scorse successive. Questa volta risolveremo un problema più complicato: disegnare delle forme geometriche.
nl: Net als in de vorige les gebruiken we code die door anderen is gemaakt. Deze keer lossen we een ingewikkelder probleem op: vormen tekenen.
pl: Użyjemy kodu stworzonego przez innych dokładnie w ten sam sposób, co w poprzedniej lekcji. Tym razem poruszymy jednak bardziej skomplikowany problem: rysowanie figur.
pt_br: Nós vamos usar códigos feitos por outros programadores assim como fizemos na lição anterior. Dessa vez, vamos resolver um problema mais complicado: desenhar formas.
sv: Vi kommer att använda kod skapad av andra som vi gjorde i föregående lektion. Den här gången ska vi lösa ett mer komplicerat problem: att rita former.

source: Meet the turtle
fr: Rencontrez la tortue
hu: Ismerkedj meg a teknőssel
it: Ti presentiamo la tartaruga
nl: Maak kennis met de schildpad
pl: Poznaj żółwika
pt_br: Conheça a tartaruga
sv: Möt sköldpaddan

source: We present you: the turtle! We created the turtle to teach you how to call functions.
fr: On vous présente : la tortue ! Nous avons créé la tortue pour vous apprendre à appeler des fonctions.
hu: Bemutatjuk: a teknőst! Azért hoztuk létre a teknőst, hogy megtanítsuk, hogy kell függvényeket hívni.
it: Ti presentiamo: la tartaruga! Abbiamo creato la tartaruga per insegnarti a chiamare le funzioni.
nl: Hierbij stellen we je voor aan: de schildpad! We hebben de schildpad gemaakt om je te leren hoe je functies aanroept.
pl: Prezentujemy ci jedynego w swojej osobie żółwika! Stworzyliśmy go, by nauczył cię wywoływać funkcje.
pt_br: Nós apresentamos a você: a tartaruga! Nós criamos a tartaruga para te ensinar como chamar funções.
sv: Låt oss presentera: sköldpaddan! Vi skapade sköldpaddan för att lära dig hur du anropar funktioner.

source: The turtle is a little machine that moves forward, turns, and draws lines along its path.
pl: Żółwik jest niewielką maszyną, która porusza się w przód, obraca się i rysuje linie na swojej drodze.

source: To make it draw, you give it a list of instructions: on each code line, you call one specific function.
hu: Ahhoz, hogy rajzoljon, egy sor utasítást fogsz neki adni: minden sorban egy külön utasítást hívsz.
pl: Aby [i]uczynić go[/i] narzędziem do rysowania, podajesz mu listę instrukcji: w każdej linii kodu wywołujesz jedną konkretną funkcję.

source: We prepared several functions for you:
hu: Előkészítettünk számodra néhány utasítást:
pl: Przygotowaliśmy ich dla ciebie kilka:

source: - [code]move_forward(pixels)[/code] makes the turtle move forward over a given distance in [i]pixels[/i]. - [code]turn_right(degrees)[/code] makes the turtle turn clockwise by a precise amount of [i]degrees[/i]. - [code]turn_left(degrees)[/code] works the same as [code]turn_right(degrees)[/code], except the turtle turns counter-clockwise.
hu: - [code]move_forward(pixels)[/code] előre mozdítja a teknőst a megadott [i]pixels[/i] mennyiséggel. - [code]turn_right(degrees)[/code] jobbra forgatja a teknőst, [i]degrees[/i] fokkal. - [code]turn_left(degrees)[/code] ugyanaz, mint a [code]turn_right(degrees)[/code], csak ez balra fordítja.
pl: - [code]move_forward(liczba_pikseli)[/code] sprawia, że żółwik porusza się do przodu o określoną odległość w [i]pikselach[/i]. - [code]turn_right(liczba_stopni)[/code] powoduje, że żółwik skręca w prawo o dokładną wartość podaną w [i]stopniach[/i]. - [code]turn_left(liczba_stopni)[/code] działa tak samo jak [code]turn_right(liczba_stopni)[/code] , z tym wyjątkiem, że żółwik skręca w lewo.

source: You'll use these functions the same way you used [code]rotate()[/code] before.
hu: Ezeket is ugyanúgy kell használni, mint korábban a [code]rotate()[/code] függvényt.
pl: Będziesz używać podanych funkcji w taki sam sposób, jak wcześniej używałeś funkcji [code]rotate()[/code].

source: The turtle draws a white line as it moves. We'll use this line to draw shapes.
hu: Ahogy halad a teknős, egy fehér vonalat hagy maga után. Ennek a segítségével fogunk formákat rajzolni.
pl: Żółwik poruszając się, pozostawia za sobą białą linię. Użyjemy jej do rysowania kształtów.

source: For example, to move the turtle 200 pixels, you would write [code]move_forward(200)[/code].
hu: Például, ha 200 pixellel akarod előre mozdítani a teknőst, akkor írj [code]move_forward(200)[/code]-at.
pl: Dla przykładu, chcąc przesunąć żółwika o 200 pikseli, napiszesz [code]move_forward(200)[/code].

source: Turning left and right
nl: Links- en rechtsom draaien
pl: Skręcanie w lewo i w prawo

source: The functions [code]turn_left()[/code] and [code]turn_right()[/code] work the same.
hu: A [code]turn_left()[/code] és a [code]turn_right()[/code] függvény ugyanígy működik.
pl: Funkcje [code]turn_left()[/code] i [code]turn_right()[/code] działają tak samo.

source: To turn 45 degrees to the right, you would write [code]turn_right(45)[/code].
hu: Ha 45 fokkal akarod jobbra elforgatni, akkor írj [code]turn_right(45)[/code]-öt.
pl: Aby skręcić o 45 stopni w prawo, musimy wydać żółwikowi komendę [code]turn_right(45)[/code].

source: If we call [code]turn_right(45)[/code], the turtle turns 45 degrees to the right before moving on to the next instruction.
hu: Ha hívjuk a [code]turn_right(45)[/code]-öt, a teknős jobbra fordul 45 fokkal, mielőtt továbblépne a következő utasításra.
pl: Wywołując funkcję [code]turn_right(45)[/code], obrócimy żółwika o 45 stopni w prawo przed przejściem do następnej instrukcji.

source: Using these instructions, we can make any two-dimensional shape we like!
hu: Ezekkel az utasításokkal bármilyen 2 dimenziós formát kirajzolhatunk.
pl: Korzystając z powyższych instrukcji, możemy wykonać dowolny dwuwymiarowy kształt, jaki tylko nam się zamarzy!

source: Try to understand the example below.
hu: Próbáld meg értelmezni a lenti a példát.
pl: Przyjrzyj się teraz poniższemu przykładowi i spróbuj go zrozumieć.

source: In the next practice, you'll use the functions we saw above to first draw a corner, then a rectangle like this one.
hu: A következő gyakorlatban, a fenti kódot fogjuk használni, hogy előbb egy sarkot, majd egy ilyen téglalapot rajzoljunk.
pl: W następnym ćwiczeniu użyjesz funkcji, które widziałeś w powyższych przykładach, aby najpierw narysować róg, a następnie prostokąt taki jak ten.

source: In the function call below, which part is the argument?
fr: Dans l'appel de fonction ci-dessous, quelle partie est le paramètre ?
hu: A lenti függvényhívásban, melyik rész az argumentum?
it: Nella funzione chiamata qui sotto, quale parte è il parametro?
nl: Welk deel van de onderstaande functieaanroep is het argument?
pl: W poniższym wywołaniu funkcji, która część jest argumentem?
pt_br: Na chamada de função abaixo, qual parte é o argumento?
sv: Vilken del är argumentet i funktionsanropet nedan?

source: A function's arguments are all the values inside the parentheses. In this case, there's only one, but there can be multiple separated by commas.
hu: A függvény argumentumai a zárójelben lévő összes érték.
pl: Argumenty funkcji to wszystkie wartości znajdujące się w nawiasach. W tym przypadku jest tylko jeden, ale może ich być kilka, oddzielonych przecinkami.

source: In this case, [code]move_forward[/code] is the function's name and [code]30[/code] is the argument.
hu: Ebben az esetben a [code]move_forward[/code] a függvény neve, a [code]30[/code] pedig az argumentuma.
pl: Tutaj [code]move_forward[/code] to nazwa funkcji, a [code]30[/code] to argument.

source: This function call will make the turtle move forward by [code]30[/code] pixels.
hu: Ez a függvényhívás előre mozdítja a teknőst [code]30[/code] pixellel.
pl: Wywołanie tej funkcji spowoduje, że żółw przesunie się do przodu o [code]30[/code] pikseli.

source: Drawing a Corner
fr: Dessiner un coin
hu: Sarok rajzolása
it: Disegnando uno Spigolo
nl: Een hoek tekenen
pl: Narysuj róg
pt_br: Desenhando um ângulo de 90 graus
sv: Rita ett hörn

source: The corner is made up of two lines that are [code]200[/code] pixels long. The lines are connected at each end by [code]90[/code] degrees, or right-angle.
hu: A sarok 2 egyenként [code]200[/code] pixel hosszúságú vonalból áll. A vonalak össze vannak kötve és egymással [code]90[/code] fokos szöget zárnak be, avagy derékszöget.
pl: Róg składa się z dwóch linii o długości [code]200[/code] pikseli. Linie są połączone ze sobą pod kątem [code]90[/code] stopni (czyli pod kątem prostym).

source: The [code]move_forward()[/code] and [code]turn_right()[/code] functions to the right draw a corner, but they're missing some arguments.
hu: A [code]move_forward()[/code] és a [code]turn_right()[/code] függvények rajzolják ki a sarkat, de az argumentumok hiányoznak.
pl: Podane funkcje [code]move_forward()[/code] i [code]turn_right()[/code] w istocie rysują róg, ale brakuje im niektórych parametrów.

source: Add the missing arguments so the turtle moves forward [code]200[/code] pixels, turns right [code]90[/code] degrees, then moves forward again [code]200[/code] pixels.
hu: Add meg a hiányzó argumentumokat, hogy a teknős előre menjen [code]200[/code] pixelt, forduljon jobbra [code]90[/code] fokkal, majd ismét menjen előre [code]200[/code] pixelt.
pl: Dodaj brakujące parametry tak, aby żółwik przesunął się do przodu o [code]200[/code] pikseli, skręcił w prawo o [code]90[/code] stopni, a na koniec ponownie przesunął się do przodu o [code]200[/code] pikseli.

source: We added the first argument for you so the turtle moves forward [code]200[/code] pixels.
hu: Az első argumentumot már megadtuk, így a teknős előre megy [code]200[/code] pixelt.
pl: Do pierwszej z funkcji dodaliśmy już parametr, dzięki któremu żółwik przesuwa się do przodu o [code]200[/code] pikseli.

source: In the following practices, we'll draw multiple corners to create rectangles.
hu: A következő gyakorlatokban több sarkot is rajzolunk majd, hogy téglalapokat csináljunk.
pl: W kolejnych praktykach narysujemy wiele narożników, tworząc prostokąty.

source: Use the turtle to draw a square's corner. You'll then build upon it to draw a rectangle.
fr: Utilisez la tortue pour dessiner le coin d'un carré. Vous allez ensuite vous appuyer sur cette base pour dessiner un rectangle.
hu: Használd a teknőst, hogy megrajzolja egy négyzet sarkát. Így továbbhaladva fog kirajzolódni a négyzet.
it: Usa la tartaruga per disegnare lo spigolo di un quadrato. Dopodiché su quella base, disegnerai un rettangolo.
nl: Gebruik de schildpad om de hoek van een vierkant te tekenen. Je zult er dan op voortbouwen om een rechthoek te tekenen.
pl: Użyj żółwika, aby narysować róg kwadratu. Następnie, opierając się na zdobytej umiejętności rysowania rogów, narysujesz złożony z rogów prostokąt.
pt_br: Use a tartaruga para desenhar um ângulo de 90 graus de um quadrado. Em seguida, com o que você já fez, você vai desenhar um retângulo.
sv: Använd sköldpaddan för att rita ett kvadrats hörn. Du kommer senare att bygga vidare på samma kod för att rita en rektangel.

source: Drawing a Rectangle
fr: Dessiner un rectangle
hu: Téglalap rajzolása
it: Disegnando un Rettangolo
nl: Een rechthoek tekenen
pl: Narysuj prostokąt
pt_br: Desenhando um retângulo
sv: Rita en rektangel

source: We wrote the first argument for you.
hu: Az első argumentumot már beírtuk.
pl: Wpisaliśmy już za ciebie pierwszy z parametrów.

source: In the next practice, you'll use the same functions to draw a bigger rectangle.
hu: A következő gyakorlatban egy nagyobb téglalapot rajzolunk ki, ugyanezekkel a függvényekkel.
pl: W następnym ćwiczeniu użyjesz tych samych funkcji do narysowania jeszcze większego prostokąta.

source: Based on your rectangle corner, you now need to draw a complete rectangle.
fr: En vous appuyant sur le coin de votre rectangle, vous devez maintenant dessiner un rectangle complet.
hu: A téglalap sarkát alapul véve, most be kell fejezned a teljes téglalapot.
it: A partire dallo spigolo che hai creato, ora dovrai disegnare un rettangolo completo.
nl: Op basis van je rechthoekhoek moet je nu een volledige rechthoek tekenen.
pl: Bazując na umiejętności rysowania rogów narysuj cały prostokąt.
pt_br: Com base no seu ângulo de 90 graus do retângulo, você precisa agora desenhar um retângulo completo.
sv: Utgående från ditt rektangelhörn ska du nu rita en komplett rektangel.

source: Drawing a Bigger Rectangle
fr: Dessiner un rectangle plus grand
hu: Nagyobb téglalap rajzolása
it: Disegnando un Rettangolo Più Grande
nl: Een grotere rechthoek tekenen
pl: Narysuj większy prostokąt
pt_br: Desenhando um Retângulo Ainda Maior
sv: Rita en större rektangel

source: Write out calls to the functions [code]move_forward()[/code] and [code]turn_right()[/code] to draw a rectangle with a width of 220 pixels, and a height of 260 pixels.
hu: Hívd a [code]move_forward()[/code] és a [code]turn_right()[/code] függvényeket, hogy kirajzolj egy 220 pixel széles és 260 pixel magas téglalapot.
pl: Wywołaj funkcje [code]move_forward()[/code] i [code]turn_right()[/code], aby narysować prostokąt o szerokości 220 pikseli i wysokości 260 pikseli.

source: We wrote the first two lines for you.
hu: Az első két sort már megírtuk helyetted.
pl: Napisaliśmy już dwie pierwsze linijki kodu.

source: Be sure to write each instruction on a separate line.
hu: Győződj meg róla, hogy minden utasítást új sorban kezdesz.
pl: Pamiętaj, aby wydawać każdą z instrukcji w osobnym wierszu.

source: Every line should start with one [code]Tab[/code] character so the computer understands it's part of the [code]draw_rectangle()[/code] function.
hu: Minden sornak egy [code]Tab[/code] karakterrel kezdődni, hogy a számítógép tudja, hogy ezek a [code]draw_rectangle()[/code] függvény részei.
pl: Każda linia powinna zaczynać się od jednego znacznika [code]TAB[/code], dzięki czemu nasz komputer będzie wiedział, że jest ona częścią funkcji [code]draw_rectangle()[/code].

source: At this point, you're ready to code entirely on your own. Call functions by yourself to draw a complete rectangle.
fr: Maintenant, vous êtes prêt(e) à coder entièrement par vous-même. Appelez des fonctions par vous-même pour dessiner un rectangle complet.
hu: Most már készen állsz rá, hogy egyedül is programozz. Hívj függvényeket, és rajzolj egy teljes téglalapot.
it: A questo punto, sei pronto a scrivere codice da solo. Chiama le funzioni e disegna un rettangolo completo.
nl: Je bent nu klaar om helemaal zelf te coderen. Roep zelf functies aan om een volledige rechthoek te tekenen.
pl: W tym momencie jesteś już gotów do samodzielnego kodowania. Wywołaj wszystkie potrzebne do narysowania pełnego prostokąta funkcje samodzielnie.
pt_br: A partir desse ponto, você está pronto para programar por si só. Chame você mesmo as funções para desenhar um retângulo completo.
sv: Vid det här laget är du redo att koda helt på egen hand. Anropa själv funktioner för att rita en komplett rektangel.

source: The turtle is a little machine that moves forward, turns, and draws lines along its path. To make it draw, you give it a list of instructions: on each code line, you call one specific function. We prepared several functions for you: - [code]move_forward(pixels)[/code] makes the turtle move forward over a given distance in [i]pixels[/i]. - [code]turn_right(degrees)[/code] makes the turtle turn clockwise by a precise amount of [i]degrees[/i]. - [code]turn_left(degrees)[/code] works the same as [code]turn_right(degrees)[/code], except the turtle turns counter-clockwise. You'll use these functions the same way you used [code]rotate()[/code] before. The turtle draws a white line as it moves. We'll use this line to draw shapes. For example, to move the turtle 200 pixels, you would write [code]move_forward(200)[/code].
fr: La tortue est une petite machine qui avance, tourne et dessine des lignes sur son chemin. Pour la faire dessiner, vous lui donnez une liste d'instructions : sur chaque ligne de code, vous appelez une fonction spécifique. Nous avons préparé plusieurs fonctions pour vous : - [code]move_forward(pixels)[/code] fait avancer la tortue sur une distance donnée en [i]pixels[/i]. - [code]turn_right(degrees)[/code] fait tourner la tortue vers la droite d'une quantité précise de [i]degrés[/i]. - [code]turn_left(degrees)[/code] fonctionne de la même manière que [code]turn_right(degrees)[/code], sauf que la tortue tourne vers la gauche. Vous utiliserez ces fonctions de la même manière que vous avez utilisé [code]rotate()[/code] auparavant. La tortue dessine une ligne blanche lorsqu'elle se déplace. Nous allons utiliser cette ligne pour dessiner des formes. Par exemple, pour déplacer la tortue de 200 pixels, vous écrivez [code]move_forward(200)[/code].
it: La tartaruga è una piccola macchina che si muove in avanti, si gira e disegna linee lungo il suo percorso. Per farla disegnare, si dà un elenco di istruzioni: in ogni riga di codice si chiama una funzione specifica. Abbiamo preparato per voi diverse funzioni: - [code]move_forward(pixel)[/code] fa avanzare la tartaruga su una determinata distanza in [i]pixel[/i]. - [code]turn_right(degrees)[/code] fa girare la tartaruga in senso orario di una quantità precisa di [i]gradi[/i]. - [code]turn_left(degrees)[/code] funziona come [code]turn_right(degrees)[/code], ma la tartaruga gira in senso antiorario. Queste funzioni si usano nello stesso modo in cui si è usato [code]rotate()[/code]. La tartaruga disegna una linea bianca mentre si muove. Questa linea verrà utilizzata per disegnare forme. Per esempio, per spostare la tartaruga di 200 pixel, si scrive [code]move_forward(200)[/code].
nl: De schildpad is een kleine machine die vooruit beweegt, draait en lijnen trekt langs zijn pad. Om hem te laten tekenen, geef je hem een lijst met instructies: op elke coderegel roep je een specifieke functie aan. We hebben een aantal functies voor je voorbereid: - [code]move_forward(pixels)[/code] laat de schildpad vooruit bewegen over een bepaalde afstand in [i]pixels[/i]. - [code]turn_right(degrees)[/code] laat de schildpad een precies aantal [i]graden[/i] met de klok mee draaien. - [code]turn_left(degrees)[/code] werkt hetzelfde als [code]turn_right(degrees)[/code], behalve dat de schildpad tegen de klok in draait. Je gebruikt deze functies op dezelfde manier als je eerder [code]rotate()[/code] hebt gebruikt. De schildpad tekent een witte lijn terwijl hij beweegt. We zullen deze lijn gebruiken om vormen te tekenen. Bijvoorbeeld, om de schildpad 200 pixels te verplaatsen, zou je [code]move_forward(200)[/code] schrijven.
pt_br: A tartaruga é uma pequena máquina se move para frente, gira e desenha uma linha ao longo do seu caminho. Para fazê-la desenhar, você deve dar a ela uma lista de instruções: em cada linha de código, você chama uma função específica. Nós preparamos várias funções para você: - [code]move_forward(pixels)[/code] faz com que a tartaruga se mova para frente por uma determinada distancia em [i]pixels[/i]. - [code]turn_right(degrees)[/code] faz com que a tartaruga gire em sentido horário (para a direita) por uma determinada quantia em [i]graus[/i]. - [code]turn_left(degrees)[/code] funciona igual a função [code]turn_right(degrees)[/code], exceto que dessa vez ela gira em sentido anti-horário (para a esquerda). Você vai usar essas funções da mesma forma que você usou a função [code]rotate()[/code] anteriormente. A tartaruga irá desenhar uma linha branca enquanto se move. Vamos usar essa linha para desenhar formas. Por exemplo, para mover a tartaruga em 200 pixels, você deve escrever [code]move_forward(200)[/code].

source: The functions [code]turn_left()[/code] and [code]turn_right()[/code] work the same. To turn 45 degrees to the right, you would write [code]turn_right(45)[/code]. If we call [code]turn_right(45)[/code], the turtle turns 45 degrees to the right before moving on to the next instruction.
fr: Les fonctions [code]turn_left()[/code] et [code]turn_right()[/code] fonctionnent de la même manière. Pour tourner de 45 degrés vers la droite, vous écrivez [code]turn_right(45)[/code]. Si nous appelons [code]turn_right(45)[/code], la tortue tourne de 45 degrés vers la droite avant de passer à l'instruction suivante.
it: Le funzioni [code]turn_left()[/code] e [code]turn_right()[/code] funzionano allo stesso modo. Per ruotare di 45 gradi a destra, dovresti scrivere [code]turn_right(45)[/code]. Se chiamiamo [code]turn_right(45)[/code], la tartaruga ruoterà di 45 gradi a destra prima di passare all'istruzione successiva.
nl: De functies [code]turn_left()[/code] en [code]turn_right()[/code] werken hetzelfde. Om 45 graden naar rechts te draaien, zou je [code]turn_right(45)[/code] schrijven. Als we [code]turn_right(45)[/code] aanroepen, draait de schildpad 45 graden naar rechts voordat we naar de volgende instructie gaan.
pt_br: As funções [code]turn_lef()[/code] e [code]turn_right()[/code] funcionam da mesma forma. Para girar 45 graus para a direita, você deve escrever [code]turn_right(45)[/code]. Se chamarmos [code]turn_right(45)[/code], a tartaruga vai girar 45 graus para a direita antes do código passar para a próxima instrução.
sv: Funktionerna [code]turn_left()[/code] och [code]turn_right()[/code] fungerar på samma sätt. För att svänga 45 grader åt höger skulle du skriva [code]turn_right(45)[/code]. Om vi anropar [code]turn_right(45)[/code], svänger sköldpaddan 45 grader åt höger innan den går vidare till nästa instruktion.

source: Using these instructions, we can make any two-dimensional shape we like! Try to understand the example below. In the next practice, you'll use the functions we saw above to first draw a corner, then a rectangle like this one.
fr: En utilisant ces instructions, nous pouvons créer n'importe quelle forme bidimensionnelle que nous voulons ! Essayez de comprendre l'exemple ci-dessous. Lors de la pratique de cette leçon, vous utiliserez les fonctions que nous avons vues ci-dessus pour dessiner d'abord un coin, puis un rectangle comme celui-ci.
it: Usando queste istruzioni possiamo creare qualsiasi forma bi-dimensionale che vogliamo! Cerca di capire l'esempio qui sotto. Nel prossimo esercizio, userai le funzioni che abbiamo visto sopra per disegnare un angolo, poi un rettangolo, proprio come questo.
nl: Met behulp van deze instructies kunnen we elke tweedimensionale vorm maken die we maar willen! Probeer het onderstaande voorbeeld te begrijpen. In de volgende oefening gebruik je de functies die we hierboven zagen om eerst een hoek te tekenen en daarna een rechthoek zoals deze.
pt_br: Usando essas instruções, podemos fazer qualquer forma que seja bidimensional que quisermos. Tente entender o exemplo abaixo. Na próxima seção de prática, você vai usar as funções que vimos acima para, primeiro, desenhar um ângulo de 90 graus e depois uma retângulo como esse.
sv: Med hjälp av dessa instruktioner kan vi göra vilken tvådimensionell figur vi vill! Försök att förstå koden i exemplet nedan. I nästa övning kommer du att använda funktionerna vi såg ovan först för att rita ett hörn, sedan för att rita en rektangel som den här.
