Repository: GDQuest/learn-gdscript-translations
Catalog: */lesson-28-specifying-types.po
Languages: es, fr, it, ja, nl, pt, tr, zh_hans

source: By default, GDScript is what we call a dynamically-typed language. That means that you can just write variables, assign them a value with a number, and assign them another value with a different type. Unlike in some other languages, in GDScript, the following code is valid.
es: Por defecto, GDScript es lo que llamamos un lenguaje de tipado dinámico. Eso significa que puedes escribir variables, asignarles un valor con un número y asignarles otro valor con un tipo diferente. A diferencia de otros lenguajes, en GDScript, el siguiente código es válido.
fr: Par défaut, GDScript est ce que nous appelons un langage à typage dynamique. Cela signifie que vous pouvez simplement écrire des variables, leur assigner une valeur avec un nombre et leur assigner une autre valeur avec un type différent. Contrairement à d'autres langages, en GDScript, le code suivant est valide.
it: Di norma, GDScript è un tipo di linguaggio che chiamiamo a tipizzazione dinamica. Questo significa che puoi direttamente scrivere le variabili, assegnare loro un valore con un numero e assegnare loro un altro valore con un tipo differente. Al contrario di altri linguaggi, in GDScript, il seguente codice è valido.
ja: デフォルトでは、GDScriptは動的型付け言語と呼ばれるものです。つまり、変数を記述し、数値で値を代入し、別の型で別の値を割り当てるだけで済みます。 他の言語とは異なり、GDScriptでは次のコードが有効です。
nl: GDScript is standaard wat we noemen een dynamisch getypeerde taal. Dat betekent dat je gewoon variabelen kunt schrijven, ze een waarde kunt toewijzen met een getal en ze daarna een andere waarde kunt toewijzen met een ander type. In tegenstelling tot sommige andere talen, is de volgende code in GDScript geldig.
pt: Por padrão, GDScript é o que chamamos de linguagem tipada dinamicamente. Isso significa que pode apenas escrever variáveis, atribuir nelas um valor com um número e atribuir nela outro valor com um tipo diferente. Ao contrário de algumas outras linguagens, no GDScript, o código a seguir é válido.
tr: GDScript, varsayılan olarak, dinamik-yazımlı dediğimiz bir dildir. Bu, değişkenleri öylece yazabileceğiniz, onlara bir sayı gibi bir değer verip, sonra onlara farklı tipte başka bir değer atayabileceğiniz anlamına gelir. Diğer bazı dillerden farklı olarak, GDScript'te aşağıdaki kod geçerlidir.
zh_hans: 默认情况下，GDScript 是我们常说的动态类型（dynamically-typed）语言。 这意味着你写变量的时候，给它分配一个数字类型的值也可以，然后重新分配一个不同类型的值也可以。 与其他一些语言不同，在GDScript中，以下代码是有效的。

source: But this feature often causes problems down the line. Let's take one example.
es: Pero esta característica a menudo causa problemas a la larga. Pongamos un ejemplo.
fr: Mais cette fonctionnalité entraîne souvent des problèmes par la suite. Prenons un exemple.
it: Ma questa caratteristica può spesso causare problemi a lungo andare. Prendiamo questo esempio.
ja: しかし、この機能はしばしば将来的に問題を引き起こします。1つの例を見てみましょう。
nl: Maar deze eigenschap veroorzaakt later vaak problemen. Laten we een voorbeeld bekijken.
pt: Mas esse recurso geralmente causa problemas no futuro. Vamos ver um exemplo.
tr: Ancak bu özellik genellikle daha sonra sorunlara neden olur. Bir örnek verelim.
zh_hans: 但是这个特性通常会导致问题。举个例子。

source: Cell size: decimal number, or 2D vector?
es: Tamaño de la celda: ¿número decimal o vector 2D?
fr: Taille de la case : nombre décimal ou vecteur 2D ?
it: Grandezza cella: numero decimale o vettore 2D?
ja: セル サイズ: 10 進数、または 2D ベクトル？
nl: Celgrootte: kommagetal of 2D vector?
pt: Tamanho da célula: número decimal ou vetor 2D?
tr: Hücre boyutu: ondalık sayı mı, yoksa 2B vektör mü?
zh_hans: 格子的大小：是小数还是二维向量？

source: Games use grids all the time, be it for grid-based gameplay or to make algorithms faster. When working with grids, you need to convert grid coordinates into positions in the game world all the time. To do so, you give each cell a size in pixels. You'll likely pick one of two types for that: [code]float[/code] or [code]Vector2[/code]. Either of those two values would be fine:
es: Los juegos utilizan cuadrículas todo el tiempo, ya sea para los juegos basados en cuadrículas o para hacer que los algoritmos sean más rápidos. Cuando trabajas con cuadrículas, tienes que convertir coordenadas de cuadrícula en posiciones del mundo del juego todo el tiempo. Para ello, le das a cada celda un tamaño en pixeles. Es probable que elijas uno de los siguientes dos tipos para eso: [code]float[/code] o [code]Vector2[/code]. Cualquiera de esos dos valores estaría bien:

source: Using a [code]Vector2[/code] could simplify some calculations. For example, when converting grid coordinates to game world coordinates.
es: Utilizar un [code]Vector2[/code] podría simplificar algunos cálculos. Por ejemplo, al convertir las coordenadas de la cuadrícula en coordenadas del mundo del juego.
fr: L'utilisation d'un [code]Vector2[/code] pourrait simplifier certains calculs. Par exemple, lors de la conversion des coordonnées de la grille en coordonnées du monde du jeu.
it: Usare un [code]Vector2[/code] potrebbe semplificare alcuni calcoli. Per esempio, quando converti le coordinate delle celle in coordinate nel mondo di gioco.
ja: [code]Vector2[/code]を使用すると、一部の計算が簡略化されます。たとえば、グリッド座標をゲームのワールド座標に変換する場合などです。
nl: Het gebruik van een [code]Vector2[/code] zou sommige berekeningen kunnen vereenvoudigen. Bijvoorbeeld bij het converteren van rastercoördinaten naar coördinaten voor de spelwereld.
pt: Usar um [code]Vector2[/code] pode simplificar alguns cálculos. Por exemplo, quando for converter coordenadas de grid em coordenadas do mundo do jogo.
tr: [code]Vector2[/code] kullanmak bazı hesaplamaları basitleştirebilir. Örneğin, ızgara konumlarını oyun dünyası konumlarına dönüştürürken.
zh_hans: 使用 [code]Vector2[/code] 能简化一些计算。 例如，将网格坐标转换为游戏世界坐标时。

source: In this example, because both [code]cell[/code] and [code]cell_size[/code] are [code]Vector2[/code] values, we can add them. However, if [code]cell_size[/code] is a [code]float[/code], we will get a type error.
es: En este ejemplo, debido a que tanto [code]cell[/code] como [code]cell_size[/code] son valores [code]Vector2[/code], podemos sumarlos. Sin embargo, si [code]cell_size[/code] es un [code]float[/code], obtendremos un error de tipo.
fr: Dans cet exemple, comme [code]cell[/code] et [code]cell_size[/code] sont tous deux des valeurs [code]Vector2[/code], nous pouvons les additionner. Cependant, si [code]cell_size[/code] est un [code]float[/code], nous obtiendrons une erreur de type.
it: In questo esempio, dato che sia [code]cell[/code] e [code]cell_size[/code] sono valori [code]Vector2[/code], li possiamo sommare. Tuttavia, se [code]cell_size[/code] fosse un [code]float[/code], otterremmo un errore di tipo.
ja: この例では、[code]cell[/code] と [code]cell_size[/code] はどちらも [code]Vector2[/code] の値であるため、追加できます。 ただし、[code]cell_size[/code] が [code]float[/code] の場合、型エラーが発生します。
nl: In dit voorbeeld, aangezien [code]cell[/code] en [code]cell_size[/code] allebei [code]Vector2[/code]-waarden zijn, kunnen we ze optellen. Echter, als [code]cell_size[/code] een [code]float[/code] is, krijgen we een typefout.
pt: Nesse exemplo, como [code]cell[/code] e [code]cell_size[/code] são valores de [code]Vector2[/code], podemos somar eles. No entanto, se [code]cell_size[/code] for um [code]float[/code], vamos ter um erro de tipo.
tr: Bu örnekte, hem [code]cell[/code] (hücre) hem de [code]cell_size[/code] (hücre_boyu), [code]Vector2[/code] tipinde olduğundan, bunları ekleyebiliriz. Ancak, [code]cell_size[/code] bir [code]float[/code] olursa, bir tip hatası alırız.
zh_hans: 在这个例子中，因为 [code]cell[/code] 和 [code]cell_size[/code] 都是 [code]Vector2[/code] 值，可以直接相加。 但是，如果 [code]cell_size[/code] 是 [code]float[/code]型，就会得到类型错误。

source: Worse: due to dynamic typing, we won't get an error [i]right away[/i]. We will only get the error when calling [code]grid_to_world(Vector2(1, 1))[/code]. And that's a big problem.
es: Peor aún: debido a la tipificación dinámica, no obtendremos un error [i]de inmediato[/i]. Sólo obtendremos el error cuando llamemos a [code]grid_to_world(Vector2(1, 1))[/code]. Y ese es un gran problema.
fr: Pire : en raison du typage dynamique, nous n'obtiendrons pas d'erreur [i]tout de suite[/i]. Nous n'obtiendrons l'erreur que lors de l'appel de [code]grid_to_world(Vector2(1, 1))[/code]. Et c'est un gros problème.
it: O peggio: a causa della tipizzazione dinamica, non otterremmo un errore [i]subito[/i]. Otterremo l'errore solo chiamando [code]grid_to_world(Vector2(1, 1))[/code]. E questo è un problema.
ja: さらに悪いことに、動的型付けのため、エラーが[i]すぐには発生しません[/i]。[code]grid_to_world(Vector2(1, 1))[/code]を呼び出したときにのみエラーが発生します。 そして、それは大きな問題です。
nl: Erger nog: door dynamische types krijgen we niet [i]meteen[/i] een foutmelding. We krijgen de fout pas als we [code]grid_to_world(Vector2(1, 1))[/code] aanroepen. En dat is een groot probleem.
pt: Pior: devido à tipagem dinâmica, não receberemos um erro [i]imediatamente[/i]. Só obteremos o erro ao chamar [code]grid_to_world(Vector2(1, 1))[/code]. E isso é um grande problema.
tr: Daha da kötüsü: dinamik yazma nedeniyle, bu hatayı [i]hemen[/i] almayacağız. Hatayı, ancak [code]grid_to_world(Vector2(1, 1))[/code] gibi bir fonksiyon çağrısı yaparsak alacağız. Ve bu büyük bir sorun.
zh_hans: 更糟糕的是：由于类型可以动态变化，不会[i]写完就提示错误[/i]。在你调用 [code]grid_to_world(Vector2(1, 1))[/code]时才会得到错误。 这是一个大问题。

source: Because we're learning, we only have small code examples in this course. But your games' code will get long and split into many files. When coding, you often forget about the code you wrote several weeks ago. And with a lot of code, it could take [i]hours[/i] of play before players trigger a type error in your code.
es: Como estamos aprendiendo, sólo tenemos ejemplos de código pequeños en este curso. Pero el código de tus juegos se hará largo y se dividirá en muchos archivos. Al codificar, a menudo te olvidas del código que escribiste hace varias semanas. Y con mucho código, podrían pasar [i]horas[/i] de juego antes de que los jugadores hagan que se manifieste un error de tipo en tu código.
fr: Comme nous sommes en train d'apprendre, nous n'avons que de petits exemples de code dans ce cours. Mais le code de vos jeux deviendra long et sera divisé en plusieurs fichiers. Lorsque l'on code, on oublie souvent le code que l'on a écrit il y a plusieurs semaines. Et avec beaucoup de code, cela peut prendre des [i]heures[/i] de jeu avant que les joueurs ne déclenchent une erreur de type dans votre code.
it: Dato che stiamo imparando, abbiamo solo esempi di codice piccoli in questo codice, Ma il codice del tuo gioco diventerà lungo e si dividerà in molti file. Quando programmi, spesso dimenticherai il codice che hai scritto settimane fa. E con un sacco di codice, impiegheresti [i]ore[/i] di gioco prima che il giocatore scateni un errore di tipo nel tuo codice.
ja: 学習中なので、このコースには小さなコード例しかありません。しかし、ゲームのコードは長くなり、多くのファイルに分割されます。コーディングをしていると、数週間前に書いたコードを忘れてしまうことがよくあります。 また、コードが多いと、プレイヤーがコードで型エラーをトリガーするまでに[i]何時間[/i]もかかることがあります。
nl: Omdat we aan het leren zijn, hebben we alleen kleine codevoorbeelden in deze cursus. Maar de code van je spellen zal lang worden en in veel bestanden worden opgesplitst. Tijdens het coderen vergeet je vaak de code die je een paar weken geleden hebt geschreven. En met veel code kan het [i]uren[/i] spelen duren voordat spelers een typefout in je code ontdekken.
pt: Como estamos aprendendo, temos apenas pequenos exemplos de código nesse curso. Mas os códigos dos seus jogos ficarão longos e divididos em muitos ficheiros. Ao programar, muitas vezes esquece o código que escreveu várias semanas atrás. E com muito código, pode levar [i]horas[/i] de jogo antes que os jogadores acionem um erro de tipo no seu código.
tr: Henüz öğrenme aşamasında olduğumuz için, bu derste sadece küçük kod örneklerimiz var. Ancak oyun kodlarınız uzayacak ve bir sürü dosyaya bölünecektir. Kodlama yaparken, genellikle, birkaç hafta önce yazdığınız kodu unutursunuz. Ve kodlar arttıkça, oyuncuların kod içindeki bir tip hatasını tetiklemesi için [i]saatlerce[/i] oynaması gerekebilir.
zh_hans: 因为我们正在学习，在本课程中的代码示例都是小体量的。但你的游戏代码会变得很长，并且拆分成许多个文件。敲代码时，忘记几周前写了啥代码是很寻常的。 也就是说在成吨代码里，尽管错误已经发生了，玩家可能还要玩[i]好几个小时[/i]，类型错误才会被触发。

source: Using type hints
es: Utilizar sugerencias de tipo
fr: Utiliser des suggestions de type
it: Usare i suggerimenti di tipo
ja: 型ヒントの使用
nl: Typehints gebruiken
pt: Usando dicas de tipo
tr: Tip belirteçlerini kullanmak
zh_hans: 使用类型提示功能

source: Fortunately, GDScript has optional [i]type hints[/i]. Type hints let the computer know the value type you want for variables and report errors before running the code. To specify the type a variable can accept, you can write a colon and a type after the name when defining a new variable.
es: Afortunadamente, GDScript tiene [i]sugerencias de tipo[/i] opcionales. Las sugerencias de tipo le permiten a la computadora conocer el tipo de valor que quieres para las variables e informar sobre errores antes de ejecutar el código. Para especificar el tipo que puede aceptar una variable, puedes escribir dos puntos y un tipo después del nombre al definir una nueva variable.
fr: Heureusement, GDScript a des [i]suggestions de type[/i] facultatives. Les suggestions de type, ou « type hints », permettent à l'ordinateur de connaître le type de valeur que vous souhaitez pour les variables et de signaler des erreurs avant d'exécuter le code. Pour spécifier le type qu'une variable peut accepter, vous pouvez écrire deux points et un type après le nom lors de la définition d'une nouvelle variable.
it: Fortunatamente, GDScript ha dei [i]suggerimenti di tipo[/i] opzionali. I suggerimenti di tipo fanno capire al computer il tipo di valore che desideri per le variabili, così ché gli errori arrivino prima di eseguire il codice. Per specificare il tipo che una variabile può accettare, puoi inserire dei due punti e un tipo dopo il nome quando definisci una variabile.
ja: 幸いなことに、GDScriptにはオプションの[i]型ヒント[/i]があります。 型ヒントは、変数に必要な値の型をコンピューターに知らせ、コードを実行する前にエラーを報告します。 変数が受け入れることができる型を指定するには、新しい変数を定義するときに、名前の後にコロンと型を記述します。
nl: Gelukkig heeft GDScript optionele [i]typehints[/i]. Typehints laten de computer weten welk waardetype je wilt voor variabelen en rapporteren fouten voordat de code wordt uitgevoerd. Om het gewenste type van een variabele aan te geven, kun je een dubbele punt en een type achter de naam zetten wanneer je een nieuwe variabele definieert.
pt: Felizmente, o GDScript tem [i]dicas de tipo (type hints)[/i] opcionais. As dicas de tipo permitem que o computador saiba o tipo de valor desejado para variáveis e faz ele relatar erros antes de executar o código. Para especificar o tipo que uma variável pode aceitar, pode escrever dois pontos e um tipo após o nome quando for definir uma nova variável.
tr: Neyse ki GDScript, isteğe bağlı [i]tip belirteçleri[/i]'ne sahip. Tip belirteçleri bilgisayara, kodu çalıştırmadan önce, değişkenler için istediğiniz değer tipi bilgisini verir ve geriye hataları bildirmesini sağlar. Bir değişkenin kabul edebileceği değer tipini belirtmek için, yeni bir değişken tanımlarken, isimden sonra iki nokta üst üste ve ardına tipi yazabilirsiniz.
zh_hans: 幸运的是，GDScript有可选的[i] 类型提示 [/i]功能。 使用类型提示功能，计算机就能知道你想要的值类型，并在运行代码之前就报告错误。 要指定某个变量可以接受的类型，在定义新变量时要在变量名称后写一个冒号和一个类型名。

source: You could tell the computer you want [code]cell_size[/code] only to accept [code]Vector2[/code] values like so.
es: Podrías decirle a la computadora que quieres que [code]cell_size[/code] sólo acepte valores [code]Vector2[/code] de esta manera.
fr: Vous pouvez dire à l'ordinateur que vous voulez que [code]cell_size[/code] n'accepte que les valeurs [code]Vector2[/code] comme ceci.
it: Puoi dire al computer che vuoi che la variabile [code]cell_size[/code] accetti soltanto valori [code]Vector2[/code] così.
ja: [code]cell_size[/code]が[code]Vector2[/code]の値のみを受け入れるようにコンピューターに指示できます。
nl: Je zou op deze manier de computer kunnen vertellen dat je wilt dat [code]cell_size[/code] alleen [code]Vector2[/code]-waarden aan kan nemen.
pt: Pode dizer ao computador que deseja que [code]cell_size[/code] apenas aceite valores de [code]Vector2[/code] assim.
tr: Bilgisayara, [code]cell_size[/code] değişkeninin yalnızca [code]Vector2[/code] tipindeki değerleri kabul etmesini şöyle söyleyebilirsiniz.
zh_hans: 你可以告诉计算机，你想让 [code]cell_size[/code] 只接受 [code]Vector2[/code]类型的值，像下面这样。

source: If you try to replace the [code]cell_size[/code] with a value of another type later, the computer will not let you.
es: Si intentas remplazar el valor de [code]cell_size[/code] por un valor de otro tipo más adelante, la computadora no te lo permitirá.
fr: Si vous essayez de remplacer [code]cell_size[/code] par une valeur d'un autre type plus tard, l'ordinateur ne vous laissera pas faire.
it: Se cerchi di rimpiazzare la variabile [code]cell_size[/code] con un valore di un tipo differente in seguito, il computer te lo farà notare.
ja: 後で [code]cell_size[/code] を別の型の値に置き換えようとすると、コンピューターは許可しません。
nl: Als je later de [code]cell_size[/code] probeert te vervangen door een waarde van een ander type, zal de computer dit niet toestaan.
pt: Se tentar substituir o [code]cell_size[/code] por um valor de outro tipo posteriormente, o computador não vai permitir.
tr: Eğer daha sonra, [code]cell_size[/code] değerini başka değer tipinde bir değerle değiştirmeye çalışırsanız, bilgisayar size izin vermez.
zh_hans: 如果你写着写着将 [code]cell_size[/code] 替换为了其他类型的值，计算机不会允许你这么做。

source: Letting the computer figure it out
es: Dejar que la computadora lo resuelva
fr: Laisser l'ordinateur se débrouiller
it: Lasciare che il computer capisca da solo
ja: コンピュータに理解させる
nl: De computer het laten uitzoeken
pt: Deixando o computador descobrir por ele mesmo
tr: Anlama işini bilgisayara bırakmak
zh_hans: 让电脑自己搞清楚

source: GDScript comes with a feature called [i]type inference[/i]. In many cases, but not all, the computer can figure out the type of a variable for you. To do so, you write [code]:=[/code], without the type. The computer will set the type using the value after the equal sign. We could make [code]cell_size[/code] a variable of type [code]Vector2[/code] like so:
es: GDScript viene con una funcionalidad llamada [i]inferencia de tipo[/i]. En muchos casos, pero no en todos, la computadora puede averiguar el tipo de una variable por ti. Para ello, escribe [code]:=[/code], sin el tipo. La computadora establecerá el tipo utilizando el valor que hay después del signo de igual. Podríamos hacer que [code]cell_size[/code] sea una variable de tipo [code]Vector2[/code] de esta manera:
fr: GDScript est livré avec une fonctionnalité appelée [i]inférence de type[/i]. Dans de nombreux cas, mais pas tous, l'ordinateur peut déterminer le type d'une variable pour vous. Pour ce faire, vous écrivez [code]:=[/code], sans le type. L'ordinateur définira le type à l'aide de la valeur située après le signe égal. Nous pourrions faire de [code]cell_size[/code] une variable de type [code]Vector2[/code] ainsi :
it: GSDcript possiede una funzionalità chiamata [i]inferenza di tipo[/i]. In molti casi, ma non tutti, il computer può capire il tipo di variabile per te. Per fare questo, scrivi [code]:=[/code], senza il tipo. Il computer imposterà il tipo usando il valore dopo il segno di uguaglianza. Potremmo rendere [code]cell_size[/code]una variabile di tipo [code]Vector2[/code] così:
ja: GDScriptには、[i]型推論[/i]と呼ばれる機能が付属しています。すべてではありませんが、多くの場合、コンピューターは変数の型を把握できます。 これを行うには、型を指定せずに [code]:=[/code] と記述します。コンピューターは、等号の後の値を使用してタイプを設定します。次のように、[code]cell_size[/code]を[code]Vector2 [/code]型の変数にすることができます。
nl: GDScript heeft een voorziening die [i]type-inferentie[/i] heet. In veel gevallen, maar niet altijd, kan de computer het type van een variabele voor je uitvogelen. Hiervoor schrijf je [code]:=[/code], zonder het type. De computer stelt het type in aan de hand van de waarde achter het gelijkheidsteken. We zouden van [code]cell_size[/code] een variabele van het type [code]Vector2[/code] kunnen maken op deze manier:
pt: O GDScript vem com um recurso chamado [i]inferência de tipo[/i]. Em muitos casos, mas não em todos, o computador pode descobrir o tipo de uma variável para si. Para fazê-lo, escreve [code]:=[/code], sem o tipo. O computador definirá o tipo usando o valor após o sinal de igual. Poderíamos tornar [code]cell_size[/code] uma variável do tipo [code]Vector2[/code] assim:
tr: GDScript, [i]tip çıkarımı[/i] (type inference) isimli bir özellikle birlikte gelir. Her zaman değil ama çoğu durumda, bilgisayar sizin için bir değişkenin tipini bulabilir. Bunu yapmak için, tip olmadan [code]:=[/code] yazarsınız. Bilgisayar, eşittir işaretinden sonraki değeri kullanarak tip ayarını yapar. [code]cell_size[/code] değişkenini, şu şekilde [code]Vector2[/code] tipinde bir değişken yapabiliriz:
zh_hans: GDScript 带有一个称为[i]类型推测[/i]（type inference）的功能。在多数情况，但不是全部的情况下，计算机可以替你确定变量的类型。 为此，你只用写[code]:=[/code]，不用写类型。计算机将使用等号后面的值为依据来设置类型。这样也可以将[code]cell_size[/code]设为[code]Vector2[/code]类型的变量，如下所示：

source: This takes little typing, yet you get the benefits of using type hints, like the computer reporting errors better and faster.
es: Esto requiere escribir un poco, pero obtienes los beneficios de utilizar las sugerencias de tipo, como que la computadora informe de los errores mejor y más rápido.
fr: Cela demande un peu de frappe, mais vous bénéficiez des avantages de l'utilisation des suggestions de type, comme le fait que l'ordinateur signale les erreurs mieux et plus rapidement.
it: Questo si può scrivere con semplicità e ottieni i benefici dei suggerimenti di tipo, come il computer che ti segnala gli errori più velocemente.
ja: これには入力の手間がほとんどかかりませんが、コンピューターがエラーをより適切かつ迅速に報告するなど、型ヒントを使用する利点があります。
nl: Dit kost weinig typewerk, maar je krijgt wel de voordelen van het gebruik van typehints, zoals de computer die vergissingen beter en sneller rapporteert.
pt: Isso exige pouca digitação, mas obtém os benefícios de usar dicas de tipo, como o computador relatando erros de forma melhor e mais rápida.
tr: Bu azıcık daha yazma gerektirir (fazladan iki nokta üst üste), ancak bilgisayarın hataları daha iyi ve daha hızlı bildirmesi gibi, tip belirteçlerini kullanmanın avantajlarından yararlanırsınız.
zh_hans: 这样你写的也少，也能得到变量类型提示功能的好处，比如能更好更快地报告类型错误。

source: Why bother to add hints?
es: ¿Por qué molestarse en añadir sugerencias?
fr: Pourquoi prendre la peine d'ajouter des suggestions de type ?
it: Perchè preoccuparsi di aggiungere i suggerimenti?
ja: なぜわざわざヒントを追加するのですか?
nl: Waarom zou je hints toevoegen?
pt: Por que se preocupar em adicionar dicas?
tr: Neden belirteçler eklemek için uğraşıyoruz?
zh_hans: 何必多写一个类型提示呢？
